--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\nhats\nhats_code\NHATS data setup\logs\/1a-help_hours_imputation
> _17_Apr_2019.smcl
  log type:  text
 opened on:  17 Apr 2019, 15:31:22

. 
. 
. 
. 
. *********************************************
. 
. cd "${work}"
E:\nhats\data\NHATS working data

. 
. **User note: This section can be commented out after run one time to set up da
> tasets
. ********************************************************************
. //combine op and sp data files
. 
. forvalues w=1/2{
  2. use "${r`w'raw}NHATS_Round_`w'_OP_File_v2.dta", clear
  3. sort spid opid 
  4. 
. merge m:1 spid using round_`w'_1.dta //bring in sorted sp ivw dataset
  5. keep if _merge==3 //drop obs with no OP entries
  6. save R`w'_OPSPlinked.dta, replace
  7. }

    Result                           # of obs.
    -----------------------------------------
    not matched                           667
        from master                         0  (_merge==1)
        from using                        667  (_merge==2)

    matched                            38,097  (_merge==3)
    -----------------------------------------
(667 observations deleted)
file R1_OPSPlinked.dta saved
(label r1dresid already defined)
(label r2dresid already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                           465
        from master                         0  (_merge==1)
        from using                        465  (_merge==2)

    matched                            37,944  (_merge==3)
    -----------------------------------------
(465 observations deleted)
file R2_OPSPlinked.dta saved

. 
. forvalues w=3/$w{
  2. use "${r`w'raw}NHATS_Round_`w'_OP_File.dta", clear
  3. sort spid opid 
  4. 
. merge m:1 spid using round_`w'_1.dta //bring in sorted sp ivw dataset
  5. keep if _merge==3 //drop obs with no OP entries
  6. save R`w'_OPSPlinked.dta, replace
  7. }
(label r1dresid already defined)
(label r2dresid already defined)
(label r3dresid already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                           317
        from master                         0  (_merge==1)
        from using                        317  (_merge==2)

    matched                            35,745  (_merge==3)
    -----------------------------------------
(317 observations deleted)
file R3_OPSPlinked.dta saved
(label r1dresid already defined)
(label r2dresid already defined)
(label r3dresid already defined)
(label r4dresid already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                           211
        from master                         0  (_merge==1)
        from using                        211  (_merge==2)

    matched                            33,016  (_merge==3)
    -----------------------------------------
(211 observations deleted)
file R4_OPSPlinked.dta saved
(label r1dresid already defined)
(label r2dresid already defined)
(label r3dresid already defined)
(label r4dresid already defined)
(label r5dresid already defined)
(label r5dcontnew already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                           394
        from master                         0  (_merge==1)
        from using                        394  (_merge==2)

    matched                            52,285  (_merge==3)
    -----------------------------------------
(394 observations deleted)
file R5_OPSPlinked.dta saved
(label r1dresid already defined)
(label r2dresid already defined)
(label r3dresid already defined)
(label r4dresid already defined)
(label r5dresid already defined)
(label r6dresid already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                           284
        from master                         0  (_merge==1)
        from using                        284  (_merge==2)

    matched                            51,174  (_merge==3)
    -----------------------------------------
(284 observations deleted)
file R6_OPSPlinked.dta saved
(label r5dcontnew already defined)
(label r1dresid already defined)
(label r2dresid already defined)
(label r3dresid already defined)
(label r4dresid already defined)
(label r5dresid already defined)
(label r6dresid already defined)
(label r7dresid already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                           189
        from master                         0  (_merge==1)
        from using                        189  (_merge==2)

    matched                            49,065  (_merge==3)
    -----------------------------------------
(189 observations deleted)
file R7_OPSPlinked.dta saved

. 
. 
. //now create limited datasets for each wave with only needed variables
. forvalues w=1/$w{
  2.         use R`w'_OPSPlinked.dta
  3.         
.                 if inlist(`w',1,2,3,4){
  4.                         keep spid opid op`w'* wave w`w'anfinwgt0 w`w'varstr
> at w`w'varunit r`w'dresid ///
>                 mo`w'douthelp mo`w'dinsdhelp mo`w'dbedhelp sc`w'deathelp sc`w'
> dbathhelp ///
>                 sc`w'dtoilhelp sc`w'ddreshelp ha`w'dlaunreas ha`w'dshopreas ha
> `w'dmealreas ///
>                 ha`w'dbankreas mc`w'dmedsreas
  5.                 }
  6.                 //add new wave to list below
.                 if inrange(`w',5,$w){ 
  7.                         keep spid opid op`w'* wave w`w'anfinwgt0 w`w'varstr
> at w`w'varunit r`w'dresid ///
>                 mo`w'douthelp mo`w'dinsdhelp mo`w'dbedhelp sc`w'deathelp sc`w'
> dbathhelp ///
>                 sc`w'dtoilhelp sc`w'ddreshelp ha`w'dlaunreas ha`w'dshopreas ha
> `w'dmealreas ///
>                 ha`w'dbankreas mc`w'dmedsreas w`w'an2011wgt0 
  8.                 }
  9.                 
.         rename (op`w'* w`w'* r`w'* mo`w'* sc`w'* ha`w'* mc`w'*) (*) 
 10. 
.         save R`w'_OPSPltd.dta, replace
 11. }
file R1_OPSPltd.dta saved
file R2_OPSPltd.dta saved
file R3_OPSPltd.dta saved
file R4_OPSPltd.dta saved
file R5_OPSPltd.dta saved
file R6_OPSPltd.dta saved
file R7_OPSPltd.dta saved

. 
. 
. 
. ********************************************************************
. //merge into single file for initial setup
. use R1_OPSPltd.dta, clear

. forvalues w=2/$w{
  2. append using R`w'_OPSPltd.dta
  3. }

. 
. save R1234_OPSPltd_n.dta, replace
file R1234_OPSPltd_n.dta saved

. ********************************************************************
. 
. tab wave, missing

Survey wave |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     38,097       12.81       12.81
          2 |     37,944       12.76       25.57
          3 |     35,745       12.02       37.60
          4 |     33,016       11.10       48.70
          5 |     52,285       17.59       66.29
          6 |     51,174       17.21       83.50
          7 |     49,065       16.50      100.00
------------+-----------------------------------
      Total |    297,326      100.00

. 
. ********************************************************************
. //recode helper time variables to -1 (na) if not helper per flag variable
. **Note, these OP variables are backfilled from wave to wave
. gen opishelper_allw=.
(297,326 missing values generated)

. forvalues w=1/$w{
  2. tab ishelper wave if wave==`w', missing //helper flag variable
  3. replace opishelper_allw=ishelper if wave==`w'
  4. }

                |   Survey
 R1 BXHL1 HELPS |    wave
             SP |         1 |     Total
----------------+-----------+----------
-1 Inapplicable |    26,500 |    26,500 
          1 Yes |    11,597 |    11,597 
----------------+-----------+----------
          Total |    38,097 |    38,097 

(38,097 real changes made)

                |   Survey
 R1 BXHL1 HELPS |    wave
             SP |         2 |     Total
----------------+-----------+----------
-1 Inapplicable |    28,120 |    28,120 
          1 Yes |     9,824 |     9,824 
----------------+-----------+----------
          Total |    37,944 |    37,944 

(37,944 real changes made)

                |   Survey
 R1 BXHL1 HELPS |    wave
             SP |         3 |     Total
----------------+-----------+----------
-1 Inapplicable |    27,332 |    27,332 
          1 Yes |     8,413 |     8,413 
----------------+-----------+----------
          Total |    35,745 |    35,745 

(35,745 real changes made)

                |   Survey
 R1 BXHL1 HELPS |    wave
             SP |         4 |     Total
----------------+-----------+----------
-1 Inapplicable |    25,931 |    25,931 
          1 Yes |     7,085 |     7,085 
----------------+-----------+----------
          Total |    33,016 |    33,016 

(33,016 real changes made)

                |   Survey
 R1 BXHL1 HELPS |    wave
             SP |         5 |     Total
----------------+-----------+----------
-1 Inapplicable |    39,861 |    39,861 
          1 Yes |    12,424 |    12,424 
----------------+-----------+----------
          Total |    52,285 |    52,285 

(52,285 real changes made)

                |   Survey
 R1 BXHL1 HELPS |    wave
             SP |         6 |     Total
----------------+-----------+----------
-1 Inapplicable |    40,006 |    40,006 
          1 Yes |    11,168 |    11,168 
----------------+-----------+----------
          Total |    51,174 |    51,174 

(51,174 real changes made)

                |   Survey
 R1 BXHL1 HELPS |    wave
             SP |         7 |     Total
----------------+-----------+----------
-1 Inapplicable |    39,533 |    39,533 
          1 Yes |     9,532 |     9,532 
----------------+-----------+----------
          Total |    49,065 |    49,065 

(49,065 real changes made)

. tab opishelper_allw wave, missing

opishelper |                      Survey wave
     _allw |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
        -1 |    26,500     28,120     27,332     25,931     39,861 |   227,283 
         1 |    11,597      9,824      8,413      7,085     12,424 |    70,043 
-----------+-------------------------------------------------------+----------
     Total |    38,097     37,944     35,745     33,016     52,285 |   297,326 


opishelper |      Survey wave
     _allw |         6          7 |     Total
-----------+----------------------+----------
        -1 |    40,006     39,533 |   227,283 
         1 |    11,168      9,532 |    70,043 
-----------+----------------------+----------
     Total |    51,174     49,065 |   297,326 


. 
. forvalues w=1/$w{
  2.         foreach v in helpsched numdayswk numdaysmn numhrsday {
  3.                 tab `v' if ishelper==-1 & wave==`w', missing
  4.                 replace `v'=-1 if ishelper==-1 & wave==`w'
  5.         }
  6. }

 R1 HL1 HELP IS |
  REG SCHEDULED |      Freq.     Percent        Cum.
----------------+-----------------------------------
          -8 DK |         12        0.05        0.05
          -7 RF |          3        0.01        0.06
-1 INAPPLICABLE |     26,481       99.93       99.98
       2 VARIED |          4        0.02      100.00
----------------+-----------------------------------
          Total |     26,500      100.00
(19 real changes made)

R1 HL2 NUM DAYS |
    HELP PER WK |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     26,500      100.00      100.00
----------------+-----------------------------------
          Total |     26,500      100.00
(0 real changes made)

R1 HL3 NUM DAYS |
   HELP PER MON |      Freq.     Percent        Cum.
----------------+-----------------------------------
          -8 DK |         14        0.05        0.05
          -7 RF |          3        0.01        0.06
-1 Inapplicable |     26,483       99.94      100.00
----------------+-----------------------------------
          Total |     26,500      100.00
(17 real changes made)

 R1 HL4 NUM HRS |
   HELP PER DAY |      Freq.     Percent        Cum.
----------------+-----------------------------------
          -8 DK |         14        0.05        0.05
          -7 RF |          3        0.01        0.06
-1 Inapplicable |     26,483       99.94      100.00
----------------+-----------------------------------
          Total |     26,500      100.00
(17 real changes made)

 R1 HL1 HELP IS |
  REG SCHEDULED |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 INAPPLICABLE |     28,120      100.00      100.00
----------------+-----------------------------------
          Total |     28,120      100.00
(0 real changes made)

R1 HL2 NUM DAYS |
    HELP PER WK |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     28,120      100.00      100.00
----------------+-----------------------------------
          Total |     28,120      100.00
(0 real changes made)

R1 HL3 NUM DAYS |
   HELP PER MON |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     28,120      100.00      100.00
----------------+-----------------------------------
          Total |     28,120      100.00
(0 real changes made)

 R1 HL4 NUM HRS |
   HELP PER DAY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     28,120      100.00      100.00
----------------+-----------------------------------
          Total |     28,120      100.00
(0 real changes made)

 R1 HL1 HELP IS |
  REG SCHEDULED |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 INAPPLICABLE |     27,329       99.99       99.99
       2 VARIED |          3        0.01      100.00
----------------+-----------------------------------
          Total |     27,332      100.00
(3 real changes made)

R1 HL2 NUM DAYS |
    HELP PER WK |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     27,332      100.00      100.00
----------------+-----------------------------------
          Total |     27,332      100.00
(0 real changes made)

R1 HL3 NUM DAYS |
   HELP PER MON |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     27,332      100.00      100.00
----------------+-----------------------------------
          Total |     27,332      100.00
(0 real changes made)

 R1 HL4 NUM HRS |
   HELP PER DAY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     27,332      100.00      100.00
----------------+-----------------------------------
          Total |     27,332      100.00
(0 real changes made)

 R1 HL1 HELP IS |
  REG SCHEDULED |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 INAPPLICABLE |     25,931      100.00      100.00
----------------+-----------------------------------
          Total |     25,931      100.00
(0 real changes made)

R1 HL2 NUM DAYS |
    HELP PER WK |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     25,931      100.00      100.00
----------------+-----------------------------------
          Total |     25,931      100.00
(0 real changes made)

R1 HL3 NUM DAYS |
   HELP PER MON |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     25,931      100.00      100.00
----------------+-----------------------------------
          Total |     25,931      100.00
(0 real changes made)

 R1 HL4 NUM HRS |
   HELP PER DAY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     25,931      100.00      100.00
----------------+-----------------------------------
          Total |     25,931      100.00
(0 real changes made)

 R1 HL1 HELP IS |
  REG SCHEDULED |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 INAPPLICABLE |     39,861      100.00      100.00
----------------+-----------------------------------
          Total |     39,861      100.00
(0 real changes made)

R1 HL2 NUM DAYS |
    HELP PER WK |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     39,861      100.00      100.00
----------------+-----------------------------------
          Total |     39,861      100.00
(0 real changes made)

R1 HL3 NUM DAYS |
   HELP PER MON |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     39,861      100.00      100.00
----------------+-----------------------------------
          Total |     39,861      100.00
(0 real changes made)

 R1 HL4 NUM HRS |
   HELP PER DAY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     39,861      100.00      100.00
----------------+-----------------------------------
          Total |     39,861      100.00
(0 real changes made)

 R1 HL1 HELP IS |
  REG SCHEDULED |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 INAPPLICABLE |     40,006      100.00      100.00
----------------+-----------------------------------
          Total |     40,006      100.00
(0 real changes made)

R1 HL2 NUM DAYS |
    HELP PER WK |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     40,006      100.00      100.00
----------------+-----------------------------------
          Total |     40,006      100.00
(0 real changes made)

R1 HL3 NUM DAYS |
   HELP PER MON |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     40,006      100.00      100.00
----------------+-----------------------------------
          Total |     40,006      100.00
(0 real changes made)

 R1 HL4 NUM HRS |
   HELP PER DAY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     40,006      100.00      100.00
----------------+-----------------------------------
          Total |     40,006      100.00
(0 real changes made)

 R1 HL1 HELP IS |
  REG SCHEDULED |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 INAPPLICABLE |     39,533      100.00      100.00
----------------+-----------------------------------
          Total |     39,533      100.00
(0 real changes made)

R1 HL2 NUM DAYS |
    HELP PER WK |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     39,533      100.00      100.00
----------------+-----------------------------------
          Total |     39,533      100.00
(0 real changes made)

R1 HL3 NUM DAYS |
   HELP PER MON |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     39,533      100.00      100.00
----------------+-----------------------------------
          Total |     39,533      100.00
(0 real changes made)

 R1 HL4 NUM HRS |
   HELP PER DAY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     39,533      100.00      100.00
----------------+-----------------------------------
          Total |     39,533      100.00
(0 real changes made)

. 
. //generate indicator of help with any task that has monthly reference period
. gen month=.
(297,326 missing values generated)

. forvalues w=1/$w{
  2. replace month=0 if wave==`w'
  3. replace month=1 if (outhlp==1 | insdhlp==1 | bedhlp==1 | tkplhlp1==1 | ///
>  tkplhlp2==1 | launhlp==1 | shophlp==1 | mealhlp==1 | bankhlp==1 | ///
>  eathlp==1 | bathhlp==1 | toilhlp==1 | dreshlp==1 | medshlp==1) & wave==`w'
  4. } 
(38,097 real changes made)
(11,077 real changes made)
(37,944 real changes made)
(10,419 real changes made)
(35,745 real changes made)
(9,099 real changes made)
(33,016 real changes made)
(7,623 real changes made)
(52,285 real changes made)
(12,432 real changes made)
(51,174 real changes made)
(11,682 real changes made)
(49,065 real changes made)
(10,060 real changes made)

. tab month wave, missing

           |                      Survey wave
     month |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
         0 |    27,020     27,525     26,646     25,393     39,853 |   224,934 
         1 |    11,077     10,419      9,099      7,623     12,432 |    72,392 
-----------+-------------------------------------------------------+----------
     Total |    38,097     37,944     35,745     33,016     52,285 |   297,326 


           |      Survey wave
     month |         6          7 |     Total
-----------+----------------------+----------
         0 |    39,492     39,005 |   224,934 
         1 |    11,682     10,060 |    72,392 
-----------+----------------------+----------
     Total |    51,174     49,065 |   297,326 


. 
.  //generate indicator of help with any task that has yearly reference period
. gen year=.
(297,326 missing values generated)

. forvalues w=1/$w{
  2. replace year=0 if wave==`w'
  3. replace year=1 if (moneyhlp==1 | dochlp==1 | insurhlp==1) & wave==`w'
  4. tab year month if wave==`w', missing
  5. }
(38,097 real changes made)
(4,425 real changes made)

           |         month
      year |         0          1 |     Total
-----------+----------------------+----------
         0 |    26,152      7,520 |    33,672 
         1 |       868      3,557 |     4,425 
-----------+----------------------+----------
     Total |    27,020     11,077 |    38,097 

(37,944 real changes made)
(3,489 real changes made)

           |         month
      year |         0          1 |     Total
-----------+----------------------+----------
         0 |    26,835      7,620 |    34,455 
         1 |       690      2,799 |     3,489 
-----------+----------------------+----------
     Total |    27,525     10,419 |    37,944 

(35,745 real changes made)
(2,978 real changes made)

           |         month
      year |         0          1 |     Total
-----------+----------------------+----------
         0 |    25,983      6,784 |    32,767 
         1 |       663      2,315 |     2,978 
-----------+----------------------+----------
     Total |    26,646      9,099 |    35,745 

(33,016 real changes made)
(2,689 real changes made)

           |         month
      year |         0          1 |     Total
-----------+----------------------+----------
         0 |    24,744      5,583 |    30,327 
         1 |       649      2,040 |     2,689 
-----------+----------------------+----------
     Total |    25,393      7,623 |    33,016 

(52,285 real changes made)
(4,599 real changes made)

           |         month
      year |         0          1 |     Total
-----------+----------------------+----------
         0 |    38,773      8,913 |    47,686 
         1 |     1,080      3,519 |     4,599 
-----------+----------------------+----------
     Total |    39,853     12,432 |    52,285 

(51,174 real changes made)
(4,127 real changes made)

           |         month
      year |         0          1 |     Total
-----------+----------------------+----------
         0 |    38,483      8,564 |    47,047 
         1 |     1,009      3,118 |     4,127 
-----------+----------------------+----------
     Total |    39,492     11,682 |    51,174 

(49,065 real changes made)
(3,538 real changes made)

           |         month
      year |         0          1 |     Total
-----------+----------------------+----------
         0 |    38,169      7,358 |    45,527 
         1 |       836      2,702 |     3,538 
-----------+----------------------+----------
     Total |    39,005     10,060 |    49,065 


. 
. 
. //generate indicator of help in last year but not last month
. gen yearnotmonth=0

. replace yearnotmonth=1 if year==1 & month==0
(5,795 real changes made)

. tab yearnotmonth wave, missing

yearnotmon |                      Survey wave
        th |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
         0 |    37,229     37,254     35,082     32,367     51,205 |   291,531 
         1 |       868        690        663        649      1,080 |     5,795 
-----------+-------------------------------------------------------+----------
     Total |    38,097     37,944     35,745     33,016     52,285 |   297,326 


yearnotmon |      Survey wave
        th |         6          7 |     Total
-----------+----------------------+----------
         0 |    50,165     48,229 |   291,531 
         1 |     1,009        836 |     5,795 
-----------+----------------------+----------
     Total |    51,174     49,065 |   297,326 


. ********************************************************************
. //pull variable for sits in with doctor
. gen op_doc_help=.
(297,326 missing values generated)

. forvalues w=1/$w {
  2.         replace op_doc_help=dochlp if wave==`w'
  3. }
(38,097 real changes made)
(37,944 real changes made)
(35,745 real changes made)
(33,016 real changes made)
(52,285 real changes made)
(51,174 real changes made)
(49,065 real changes made)

. ********************************************************************
. //generate SP received help with self care or mobility activity or 
. //household activity for health and functioning reasons
. gen disab=.
(297,326 missing values generated)

. forvalues w=1/$w{
  2. replace disab=0 if wave==`w'
  3. //self care or mobility, assumed to be for health reasons
. replace disab=1 if (douthelp==2 | dinsdhelp==2 | dbedhelp==2 | ///
> deathelp==2 | dbathhelp==2 | dtoilhelp==2 | ddreshelp==2) & wave==`w'
  4. //household activity for health or functioning reasons or in residential ca
> re
. **note this is different from tech paper #7 because codes disab=1 if 1,3 or 4
. **not just if 3 or 4
. foreach v in dlaunreas dshopreas dmealreas dbankreas dmedsreas{
  5. replace disab=1 if inlist(`v',1,3,4) & wave==`w'
  6. }
  7. }
(38,097 real changes made)
(9,055 real changes made)
(1,494 real changes made)
(1,737 real changes made)
(376 real changes made)
(335 real changes made)
(211 real changes made)
(37,944 real changes made)
(10,999 real changes made)
(1,524 real changes made)
(1,870 real changes made)
(347 real changes made)
(388 real changes made)
(280 real changes made)
(35,745 real changes made)
(11,252 real changes made)
(1,182 real changes made)
(1,866 real changes made)
(392 real changes made)
(370 real changes made)
(205 real changes made)
(33,016 real changes made)
(10,392 real changes made)
(1,215 real changes made)
(1,557 real changes made)
(423 real changes made)
(383 real changes made)
(266 real changes made)
(52,285 real changes made)
(14,693 real changes made)
(1,735 real changes made)
(2,443 real changes made)
(716 real changes made)
(497 real changes made)
(337 real changes made)
(51,174 real changes made)
(15,688 real changes made)
(1,912 real changes made)
(2,230 real changes made)
(751 real changes made)
(537 real changes made)
(272 real changes made)
(49,065 real changes made)
(15,536 real changes made)
(1,761 real changes made)
(2,301 real changes made)
(556 real changes made)
(455 real changes made)
(248 real changes made)

. tab disab wave, missing

           |                      Survey wave
     disab |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
         0 |    24,889     22,536     20,478     18,780     31,864 |   176,539 
         1 |    13,208     15,408     15,267     14,236     20,421 |   120,787 
-----------+-------------------------------------------------------+----------
     Total |    38,097     37,944     35,745     33,016     52,285 |   297,326 


           |      Survey wave
     disab |         6          7 |     Total
-----------+----------------------+----------
         0 |    29,784     28,208 |   176,539 
         1 |    21,390     20,857 |   120,787 
-----------+----------------------+----------
     Total |    51,174     49,065 |   297,326 


. 
. ********************************************************************
. //flag variable for hours/month reported, valid
. tab dhrsmth wave, missing //derived hours/month from HL section

 R1 D HL2 HL3 HL4 HRS |                 Survey wave
           HELP MONTH |         1          2          3          4 |     Total
----------------------+--------------------------------------------+----------
                  -13 |         0      2,287      2,790      2,516 |    16,231 
 -12:valid skip/staff |         0      1,264      1,024        998 |     9,399 
    -11:hours missing |       253        220        324        237 |     1,886 
     -10:days missing |       103          0          0          0 |       103 
  -9:days+hrs missing |       729        372        558        547 |     4,199 
            -1:Inapp. |    26,500     25,833     24,542     23,415 |   211,052 
                    1 |     1,093        412        246        186 |     2,754 
                    2 |       554        391        364        249 |     2,885 
                    3 |       219        200        173        147 |     1,400 
                    4 |       834        433        403        330 |     3,422 
                 4.33 |         0        161        100         73 |       627 
                    5 |       134         79         94         79 |       678 
                    6 |       291        261        248        184 |     1,952 
                    7 |        68         54         30         26 |       321 
                    8 |       285        298        222        216 |     1,950 
                 8.66 |         0        182        127        106 |       864 
                    9 |       291         71         71         62 |       780 
                   10 |       191        179        170        103 |     1,216 
                   11 |         2          1          2          1 |        11 
                   12 |       197        206        212        137 |     1,450 
                12.99 |         0         96         88         64 |       519 
                   13 |       118          0          0          0 |       122 
                   14 |        72         60         44         39 |       351 
                   15 |       118        113        107         86 |       774 
                   16 |       129        135        114         82 |       878 
                   17 |       126          0          0          0 |       129 
                17.32 |         0        172        115        105 |       823 
                   18 |        36         28         29         44 |       261 
                   20 |       139        138        137        115 |     1,081 
                   21 |        33         38         24         17 |       180 
                21.65 |         0         36         25         22 |       213 
                   22 |        66          1          1          2 |        77 
                   23 |         2          1          2          0 |         7 
                   24 |        92         94         76         74 |       640 
                   25 |        34         35         27         14 |       198 
                25.98 |         0        122        100         94 |       666 
                   26 |       134          1          2          2 |       142 
                   27 |         2          3          3          3 |        16 
                   28 |        31         33         30         18 |       211 
                   29 |         0          0          1          0 |         1 
                   30 |       531        308        265        222 |     2,357 
                30.31 |         0        124         99         50 |       529 
                   31 |        41         21         26         35 |       234 
                   32 |        41         38         25         27 |       257 
                   33 |         1          1          0          1 |         7 
                   34 |         0          1          2          0 |         5 
                34.64 |         0         89         65         38 |       427 
                   35 |       116         14         13          5 |       190 
                   36 |        24         32         25         23 |       202 
                38.97 |         0         49         34         28 |       217 
                   39 |        47          2          0          3 |        52 
                   40 |        62         68         60         59 |       518 
                   42 |        23         18          8         10 |       102 
                   43 |        60          0          0          0 |        60 
                 43.3 |         0         41         34         24 |       232 
                   44 |         4          0          1          0 |        14 
                   45 |        23         29         19         19 |       182 
                   46 |         2          0          2          0 |         6 
                47.63 |         0          1          0          2 |         4 
                   48 |        24         34         26         20 |       203 
                   49 |         7          5          4          1 |        24 
                   50 |        28         20         22         20 |       177 
                   51 |         0          0          0          0 |         1 
                51.96 |         0         94         43         53 |       418 
                   52 |        76          1          0          0 |        81 
                   54 |         1          2          3          1 |        13 
                   55 |         0          0          3          0 |         4 
                   56 |        27         14         18          9 |       124 
                   57 |         0          1          0          0 |         2 
                   58 |         0          0          2          4 |         8 
                   60 |       304        313        266        238 |     2,182 
                60.62 |         0        189        135        122 |       845 
                   61 |       219          0          0          0 |       219 
                   62 |        34         33         29         28 |       260 
                   63 |         3          0          3          1 |        12 
                   64 |         9          7          6          5 |        58 
                64.95 |         0         41         25         28 |       223 
                   65 |        54          1          0          1 |        57 
                   66 |         0          0          1          0 |         3 
                   68 |         0          0          0          0 |         1 
                   69 |        40          0          1          1 |        44 
                69.28 |         0         29         24         16 |       165 
                   70 |         8          5          5          5 |        36 
                   72 |        11         18          8         12 |        87 
                   75 |        15         11          9         19 |       112 
                   76 |         0          0          1          0 |         1 
                   77 |         0          0          0          0 |         3 
                77.94 |         0         26         21         14 |       121 
                   78 |        18          1          0          1 |        24 
                   80 |        23         21         15         22 |       152 
                   81 |         0          0          0          1 |         3 
                   84 |         8          5          6          4 |        59 
                   85 |         0          0          0          0 |         1 
                 86.6 |         0         42         20         25 |       209 
                   87 |        38          0          0          1 |        40 
                   88 |         0          1          0          2 |         3 
                   90 |       146        161        158        103 |     1,053 
                90.93 |         0        100         80         72 |       487 
                   91 |       122          0          1          0 |       123 
                   92 |         0          0          0          0 |         2 
                   93 |        13         29         20          9 |       153 
                   95 |         1          0          0          0 |         1 
                95.26 |         0          1          0          1 |         2 
                   96 |        16         15         10          3 |        73 
                   98 |         2          3          0          0 |         7 
                99.59 |         0          0          0          1 |         1 
                  100 |        23          9         11         11 |       117 
                  102 |         0          0          0          0 |         1 
               103.92 |         0         42         26         22 |       189 
                  104 |        45          0          1          0 |        47 
                  105 |         3          0          0          0 |         8 
                  108 |        23          2          1          1 |        28 
               108.25 |         0         22         14         12 |       107 
                  110 |         0          0          0          0 |         1 
                  112 |         4          8          8          3 |        46 
               112.58 |         0          1          0          0 |         2 
                  115 |         0          0          0          0 |         3 
                  116 |         0          0          1          0 |         3 
               116.91 |         0          4          4          2 |        12 
                  120 |       139        136         97         84 |       867 
                  121 |       108          0          0          0 |       109 
               121.24 |         0         92         51         59 |       405 
                  124 |        20         20         23         15 |       145 
                  125 |         6          1          1          2 |        23 
                  126 |         1          0          0          4 |         8 
                  128 |         2          1          0          0 |         4 
                129.9 |         0         17         24         10 |       113 
                  130 |        10          0          0          0 |        10 
                  132 |         0          0          0          1 |         1 
                  135 |         1          1          0          0 |         3 
                  138 |         0          1          0          0 |         2 
               138.56 |         0          6          7          8 |        57 
                  139 |         2          0          0          0 |         2 
                  140 |         6          1          4          3 |        27 
               142.89 |         0          1          2          0 |         3 
                  144 |         0          3          4          2 |        21 
                  145 |         0          0          0          1 |         1 
               147.22 |         0          0          1          0 |         1 
                  150 |        81         58         49         36 |       408 
               151.55 |         0         67         54         40 |       321 
                  152 |        81          0          1          0 |        82 
                  154 |         1          0          0          0 |         2 
                  155 |        17          9          8         12 |        88 
               155.88 |         0         16         10         14 |        87 
                  156 |        11          1          0          1 |        14 
                  160 |         9          5          7          2 |        41 
                  161 |         1          1          0          0 |         2 
                  162 |         0          0          0          0 |         1 
                  165 |         0          0          0          0 |         1 
                  168 |        28         28         17          6 |       128 
               168.87 |         0          0          0          0 |         2 
                  173 |        20          0          0          0 |        20 
                173.2 |         0         14         23         12 |       120 
                  174 |         0          1          0          0 |         2 
                  175 |         0          0          1          1 |         4 
                  176 |         1          0          0          0 |         3 
                  180 |        43         34         44         29 |       307 
               181.86 |         0         43         41         27 |       216 
                  182 |        56          0          0          0 |        57 
                  184 |         1          0          1          0 |         4 
                  186 |        12          7         10          5 |        60 
                  189 |         0          1          0          0 |         1 
               190.52 |         0          1          0          0 |         3 
                  191 |         1          0          0          0 |         1 
                  192 |         0          2          4          1 |        22 
               194.85 |         0          3          2          4 |        19 
                  195 |         5          0          0          0 |         5 
                  196 |         0          0          0          0 |         1 
                  198 |         0          0          0          0 |         1 
                  200 |         9          2          3          1 |        21 
               207.84 |         0         21         12         15 |        93 
                  208 |        16          0          0          0 |        16 
                  210 |         8          8          8          4 |        55 
                  212 |        27          0          0          0 |        27 
               212.17 |         0         17          5         15 |        70 
                  216 |         1          1          0          0 |         7 
                216.5 |         0          5          4          4 |        28 
                  217 |         4          3          1          1 |        17 
                  220 |         1          1          0          0 |         2 
               220.83 |         0          0          0          0 |         1 
                  224 |         2          0          1          0 |         6 
                  225 |         1          1          0          0 |         5 
                  231 |         0          0          0          0 |         1 
               233.82 |         0          1          2          0 |         3 
                  234 |         2          0          0          0 |         2 
               238.15 |         0          0          0          0 |         2 
                  240 |        73         62         56         51 |       457 
                  242 |       101          0          0          0 |       101 
               242.48 |         0         88         48         44 |       351 
                  248 |        18         13          9          8 |        74 
                  250 |         1          1          0          1 |         4 
                  252 |         3          0          0          0 |         3 
                  253 |         0          0          0          0 |         1 
                  256 |         0          0          0          0 |         1 
                259.8 |         0          3          5          6 |        41 
                  260 |         7          0          0          0 |         8 
                  264 |         0          1          1          0 |         2 
                  270 |         2          6          2          2 |        27 
               272.79 |         0          6          3          4 |        29 
                  273 |         7          1          0          0 |         8 
                  276 |         0          0          0          0 |         1 
               277.12 |         0          0          1          1 |         2 
                  279 |         1          0          0          0 |         3 
                  280 |         0          0          1          1 |         2 
               281.45 |         0          0          0          0 |         2 
                  286 |         1          0          0          0 |         1 
                  288 |         1          2          3          1 |        13 
                  299 |         1          0          0          0 |         1 
                  300 |        23         16          9          8 |       130 
                  303 |        23          0          0          0 |        23 
                303.1 |         0         28         16          6 |       119 
                  310 |         5          2          4          1 |        24 
               311.76 |         0         30         28         17 |       113 
                  312 |        18          0          0          0 |        18 
                  324 |         0          0          1          0 |         3 
               324.75 |         0          0          0          0 |         1 
                  330 |         1          0          1          2 |        10 
                  333 |         2          0          0          0 |         2 
               333.41 |         0          0          2          0 |         3 
                  336 |         1          1          3          4 |        15 
               337.74 |         0          0          0          0 |         2 
                  338 |         1          0          0          0 |         1 
                  341 |         0          0          1          0 |         1 
                346.4 |         0          2          0          0 |         4 
                  348 |         0          0          1          0 |         2 
                  360 |        33         30         22         18 |       201 
               363.72 |         0         36         31         15 |       179 
                  364 |        49          0          0          0 |        49 
                  372 |         4          4          4          7 |        44 
                  375 |         3          0          0          0 |         3 
               381.04 |         0          1          0          0 |         2 
                  384 |         0          2          0          0 |         4 
                389.7 |         0          1          0          0 |         2 
                  390 |         1          1          0          0 |         3 
                  394 |         1          0          0          0 |         1 
               394.03 |         0          1          0          1 |         4 
               398.36 |         0          0          0          0 |         1 
                  400 |         0          0          0          2 |         3 
                  403 |         0          1          0          1 |         4 
               415.68 |         0          8          4          1 |        25 
                  416 |         3          0          0          0 |         3 
                  420 |         1          0          1          0 |         9 
                  424 |         7          0          0          0 |         7 
               424.34 |         0          0          5          3 |        24 
                  425 |         1          0          0          0 |         1 
                  432 |         1          0          0          0 |         1 
                  433 |         3          0          0          0 |         4 
                  434 |         1          1          0          0 |         3 
                  450 |         4          3          0          3 |        23 
               454.65 |         0          3          1          0 |        15 
                  455 |         2          0          0          0 |         2 
                  456 |         0          0          0          0 |         2 
                  465 |         1          0          1          0 |         6 
               467.64 |         0          0          0          0 |         2 
                476.3 |         0          0          0          0 |         1 
                  480 |         8          3         10          7 |        59 
                  484 |         0          0          0          0 |         1 
               484.96 |         0          7         12          5 |        51 
                  485 |        22          0          0          0 |        22 
                  496 |         2          1          2          0 |        10 
                  504 |         1          0          1          1 |         4 
                  510 |         0          0          0          0 |         1 
                  515 |         1          0          0          0 |         1 
               515.27 |         0          0          2          0 |         5 
                519.6 |         0          3          6          7 |        33 
                  520 |         6          0          0          0 |         6 
                  527 |         2          0          0          0 |         3 
                  540 |         3          1          1          1 |        13 
               545.58 |         0          5          3          5 |        19 
                  546 |         4          0          0          0 |         4 
                  552 |         0          0          2          0 |         2 
                  558 |         2          3          1          0 |        13 
                  570 |         0          0          0          0 |         1 
               575.89 |         0          0          1          0 |         2 
                  576 |         2          0          0          0 |         2 
                  600 |         3          2          2          4 |        21 
                606.2 |         0          8          1          0 |        20 
                  620 |         0          0          1          1 |         5 
               623.52 |         0          3          0          3 |         9 
                  624 |         2          0          0          1 |         3 
                  630 |         0          2          1          1 |         4 
               636.51 |         0          2          1          0 |         4 
                  648 |         0          0          0          0 |         1 
                  651 |         0          0          0          0 |         1 
                  660 |         1          0          2          0 |         3 
               666.82 |         0          0          2          0 |         8 
                  667 |         1          0          0          0 |         1 
                  672 |         0          0          1          0 |         3 
                  690 |         1          0          1          0 |         5 
                  697 |         1          0          0          0 |         1 
               697.13 |         0          4          0          0 |         5 
                  713 |         1          0          0          0 |         1 
                  720 |        62         83         73         61 |       447 
                  727 |       301          0          0          0 |       301 
               727.44 |         0        200         98         76 |       726 
                  744 |        30          9         10          1 |        69 
Not codeable, <1 hour |     1,306        466        391        382 |     4,519 
----------------------+--------------------------------------------+----------
                Total |    38,097     37,944     35,745     33,016 |   297,326 


 R1 D HL2 HL3 HL4 HRS |           Survey wave
           HELP MONTH |         5          6          7 |     Total
----------------------+---------------------------------+----------
                  -13 |     2,118      3,143      3,377 |    16,231 
 -12:valid skip/staff |     2,374      1,878      1,861 |     9,399 
    -11:hours missing |       333        292        227 |     1,886 
     -10:days missing |         0          0          0 |       103 
  -9:days+hrs missing |     1,007        543        443 |     4,199 
            -1:Inapp. |    37,743     36,863     36,156 |   211,052 
                    1 |       335        244        238 |     2,754 
                    2 |       465        467        395 |     2,885 
                    3 |       222        241        198 |     1,400 
                    4 |       505        494        423 |     3,422 
                 4.33 |       102        106         85 |       627 
                    5 |       105        103         84 |       678 
                    6 |       343        322        303 |     1,952 
                    7 |        63         44         36 |       321 
                    8 |       336        313        280 |     1,950 
                 8.66 |       151        180        118 |       864 
                    9 |        90         94        101 |       780 
                   10 |       196        224        153 |     1,216 
                   11 |         3          1          1 |        11 
                   12 |       236        254        208 |     1,450 
                12.99 |        79        107         85 |       519 
                   13 |         2          2          0 |       122 
                   14 |        57         42         37 |       351 
                   15 |       136        143         71 |       774 
                   16 |       134        153        131 |       878 
                   17 |         3          0          0 |       129 
                17.32 |       158        150        123 |       823 
                   18 |        38         48         38 |       261 
                   20 |       194        194        164 |     1,081 
                   21 |        28         25         15 |       180 
                21.65 |        51         47         32 |       213 
                   22 |         2          3          2 |        77 
                   23 |         0          1          1 |         7 
                   24 |       103        125         76 |       640 
                   25 |        34         31         23 |       198 
                25.98 |       125        128         97 |       666 
                   26 |         1          2          0 |       142 
                   27 |         0          5          0 |        16 
                   28 |        41         33         25 |       211 
                   29 |         0          0          0 |         1 
                   30 |       338        396        297 |     2,357 
                30.31 |        94         98         64 |       529 
                   31 |        42         29         40 |       234 
                   32 |        43         49         34 |       257 
                   33 |         0          2          2 |         7 
                   34 |         0          0          2 |         5 
                34.64 |        76         90         69 |       427 
                   35 |        19         13         10 |       190 
                   36 |        36         29         33 |       202 
                38.97 |        35         39         32 |       217 
                   39 |         0          0          0 |        52 
                   40 |        97        103         69 |       518 
                   42 |        15         19          9 |       102 
                   43 |         0          0          0 |        60 
                 43.3 |        56         44         33 |       232 
                   44 |         2          6          1 |        14 
                   45 |        32         24         36 |       182 
                   46 |         0          0          2 |         6 
                47.63 |         0          1          0 |         4 
                   48 |        29         34         36 |       203 
                   49 |         3          2          2 |        24 
                   50 |        32         29         26 |       177 
                   51 |         0          0          1 |         1 
                51.96 |        76         87         65 |       418 
                   52 |         3          0          1 |        81 
                   54 |         2          3          1 |        13 
                   55 |         1          0          0 |         4 
                   56 |        21         21         14 |       124 
                   57 |         0          1          0 |         2 
                   58 |         1          0          1 |         8 
                   60 |       364        375        322 |     2,182 
                60.62 |       150        143        106 |       845 
                   61 |         0          0          0 |       219 
                   62 |        48         43         45 |       260 
                   63 |         0          3          2 |        12 
                   64 |        13          7         11 |        58 
                64.95 |        58         42         29 |       223 
                   65 |         0          0          1 |        57 
                   66 |         1          0          1 |         3 
                   68 |         1          0          0 |         1 
                   69 |         1          1          0 |        44 
                69.28 |        31         37         28 |       165 
                   70 |         7          3          3 |        36 
                   72 |        11         11         16 |        87 
                   75 |        22         25         11 |       112 
                   76 |         0          0          0 |         1 
                   77 |         1          2          0 |         3 
                77.94 |        28         18         14 |       121 
                   78 |         1          2          1 |        24 
                   80 |        26         25         20 |       152 
                   81 |         1          1          0 |         3 
                   84 |        22         11          3 |        59 
                   85 |         1          0          0 |         1 
                 86.6 |        39         49         34 |       209 
                   87 |         0          0          1 |        40 
                   88 |         0          0          0 |         3 
                   90 |       171        183        131 |     1,053 
                90.93 |        90         79         66 |       487 
                   91 |         0          0          0 |       123 
                   92 |         0          2          0 |         2 
                   93 |        32         24         26 |       153 
                   95 |         0          0          0 |         1 
                95.26 |         0          0          0 |         2 
                   96 |         8         14          7 |        73 
                   98 |         0          1          1 |         7 
                99.59 |         0          0          0 |         1 
                  100 |        19         24         20 |       117 
                  102 |         1          0          0 |         1 
               103.92 |        37         35         27 |       189 
                  104 |         0          0          1 |        47 
                  105 |         1          4          0 |         8 
                  108 |         0          0          1 |        28 
               108.25 |        26         21         12 |       107 
                  110 |         1          0          0 |         1 
                  112 |        13          6          4 |        46 
               112.58 |         0          1          0 |         2 
                  115 |         2          0          1 |         3 
                  116 |         0          2          0 |         3 
               116.91 |         1          1          0 |        12 
                  120 |       153        148        110 |       867 
                  121 |         0          1          0 |       109 
               121.24 |        81         72         50 |       405 
                  124 |        17         19         31 |       145 
                  125 |         4          4          5 |        23 
                  126 |         2          1          0 |         8 
                  128 |         0          1          0 |         4 
                129.9 |        18         23         21 |       113 
                  130 |         0          0          0 |        10 
                  132 |         0          0          0 |         1 
                  135 |         1          0          0 |         3 
                  138 |         1          0          0 |         2 
               138.56 |        12         15          9 |        57 
                  139 |         0          0          0 |         2 
                  140 |         4          6          3 |        27 
               142.89 |         0          0          0 |         3 
                  144 |         5          4          3 |        21 
                  145 |         0          0          0 |         1 
               147.22 |         0          0          0 |         1 
                  150 |        80         53         51 |       408 
               151.55 |        55         63         42 |       321 
                  152 |         0          0          0 |        82 
                  154 |         0          0          1 |         2 
                  155 |        16         11         15 |        88 
               155.88 |        20         16         11 |        87 
                  156 |         1          0          0 |        14 
                  160 |         7          5          6 |        41 
                  161 |         0          0          0 |         2 
                  162 |         0          0          1 |         1 
                  165 |         0          0          1 |         1 
                  168 |        17         18         14 |       128 
               168.87 |         2          0          0 |         2 
                  173 |         0          0          0 |        20 
                173.2 |        27         26         18 |       120 
                  174 |         0          1          0 |         2 
                  175 |         1          1          0 |         4 
                  176 |         1          1          0 |         3 
                  180 |        51         45         61 |       307 
               181.86 |        33         35         37 |       216 
                  182 |         0          1          0 |        57 
                  184 |         1          1          0 |         4 
                  186 |        17          3          6 |        60 
                  189 |         0          0          0 |         1 
               190.52 |         1          1          0 |         3 
                  191 |         0          0          0 |         1 
                  192 |         5          5          5 |        22 
               194.85 |         6          2          2 |        19 
                  195 |         0          0          0 |         5 
                  196 |         1          0          0 |         1 
                  198 |         0          0          1 |         1 
                  200 |         0          3          3 |        21 
               207.84 |        19         14         12 |        93 
                  208 |         0          0          0 |        16 
                  210 |        19          4          4 |        55 
                  212 |         0          0          0 |        27 
               212.17 |        11          7         15 |        70 
                  216 |         1          1          3 |         7 
                216.5 |         3          2         10 |        28 
                  217 |         2          4          2 |        17 
                  220 |         0          0          0 |         2 
               220.83 |         0          0          1 |         1 
                  224 |         2          1          0 |         6 
                  225 |         1          1          1 |         5 
                  231 |         0          0          1 |         1 
               233.82 |         0          0          0 |         3 
                  234 |         0          0          0 |         2 
               238.15 |         1          1          0 |         2 
                  240 |        82         60         73 |       457 
                  242 |         0          0          0 |       101 
               242.48 |        63         58         50 |       351 
                  248 |         9          5         12 |        74 
                  250 |         0          0          1 |         4 
                  252 |         0          0          0 |         3 
                  253 |         1          0          0 |         1 
                  256 |         1          0          0 |         1 
                259.8 |        14          7          6 |        41 
                  260 |         0          1          0 |         8 
                  264 |         0          0          0 |         2 
                  270 |         3          8          4 |        27 
               272.79 |         6          7          3 |        29 
                  273 |         0          0          0 |         8 
                  276 |         1          0          0 |         1 
               277.12 |         0          0          0 |         2 
                  279 |         1          0          1 |         3 
                  280 |         0          0          0 |         2 
               281.45 |         1          1          0 |         2 
                  286 |         0          0          0 |         1 
                  288 |         3          0          3 |        13 
                  299 |         0          0          0 |         1 
                  300 |        22         29         23 |       130 
                  303 |         0          0          0 |        23 
                303.1 |        20         29         20 |       119 
                  310 |         4          5          3 |        24 
               311.76 |        17         11         10 |       113 
                  312 |         0          0          0 |        18 
                  324 |         0          0          2 |         3 
               324.75 |         0          1          0 |         1 
                  330 |         1          3          2 |        10 
                  333 |         0          0          0 |         2 
               333.41 |         0          1          0 |         3 
                  336 |         2          1          3 |        15 
               337.74 |         1          1          0 |         2 
                  338 |         0          0          0 |         1 
                  341 |         0          0          0 |         1 
                346.4 |         0          1          1 |         4 
                  348 |         0          0          1 |         2 
                  360 |        37         33         28 |       201 
               363.72 |        43         24         30 |       179 
                  364 |         0          0          0 |        49 
                  372 |         7          6         12 |        44 
                  375 |         0          0          0 |         3 
               381.04 |         1          0          0 |         2 
                  384 |         1          0          1 |         4 
                389.7 |         1          0          0 |         2 
                  390 |         0          0          1 |         3 
                  394 |         0          0          0 |         1 
               394.03 |         1          0          1 |         4 
               398.36 |         0          1          0 |         1 
                  400 |         0          1          0 |         3 
                  403 |         0          0          2 |         4 
               415.68 |         4          6          2 |        25 
                  416 |         0          0          0 |         3 
                  420 |         3          1          3 |         9 
                  424 |         0          0          0 |         7 
               424.34 |         9          7          0 |        24 
                  425 |         0          0          0 |         1 
                  432 |         0          0          0 |         1 
                  433 |         0          0          1 |         4 
                  434 |         0          1          0 |         3 
                  450 |         5          5          3 |        23 
               454.65 |         4          3          4 |        15 
                  455 |         0          0          0 |         2 
                  456 |         0          2          0 |         2 
                  465 |         2          1          1 |         6 
               467.64 |         0          0          2 |         2 
                476.3 |         0          1          0 |         1 
                  480 |        12         14          5 |        59 
                  484 |         1          0          0 |         1 
               484.96 |         9          6         12 |        51 
                  485 |         0          0          0 |        22 
                  496 |         2          3          0 |        10 
                  504 |         1          0          0 |         4 
                  510 |         0          1          0 |         1 
                  515 |         0          0          0 |         1 
               515.27 |         1          1          1 |         5 
                519.6 |         6          3          8 |        33 
                  520 |         0          0          0 |         6 
                  527 |         0          0          1 |         3 
                  540 |         2          2          3 |        13 
               545.58 |         2          1          3 |        19 
                  546 |         0          0          0 |         4 
                  552 |         0          0          0 |         2 
                  558 |         3          2          2 |        13 
                  570 |         0          1          0 |         1 
               575.89 |         1          0          0 |         2 
                  576 |         0          0          0 |         2 
                  600 |         4          4          2 |        21 
                606.2 |         3          6          2 |        20 
                  620 |         0          2          1 |         5 
               623.52 |         0          1          2 |         9 
                  624 |         0          0          0 |         3 
                  630 |         0          0          0 |         4 
               636.51 |         0          0          1 |         4 
                  648 |         0          1          0 |         1 
                  651 |         0          1          0 |         1 
                  660 |         0          0          0 |         3 
               666.82 |         3          0          3 |         8 
                  667 |         0          0          0 |         1 
                  672 |         0          0          2 |         3 
                  690 |         1          2          0 |         5 
                  697 |         0          0          0 |         1 
               697.13 |         1          0          0 |         5 
                  713 |         0          0          0 |         1 
                  720 |        67         53         48 |       447 
                  727 |         0          0          0 |       301 
               727.44 |       155        111         86 |       726 
                  744 |        13          5          1 |        69 
Not codeable, <1 hour |       735        654        585 |     4,519 
----------------------+---------------------------------+----------
                Total |    52,285     51,174     49,065 |   297,326 


. gen op_ind_hrsmth=.
(297,326 missing values generated)

. forvalues w=1/$w{
  2. replace op_ind_hrsmth=dhrsmth if wave==`w'
  3. }
(38,097 real changes made)
(37,944 real changes made)
(35,745 real changes made)
(33,016 real changes made)
(52,285 real changes made)
(51,174 real changes made)
(49,065 real changes made)

. recode op_ind_hrsmth (1/750=1)
(op_ind_hrsmth: 47183 changes made)

. 
. la def hrsmth -13"-13:Deceased" -12"Zero days/wk" -11"-11:hours missing" ///
>  -10"-10:days missing" -9 "-9:days+hours mssing" -1"-1:NA" 1"1:Valid" 9999"999
> 9:<1hr/day",replace

. la val op_ind_hrsmth hrsmth 

. tab op_ind_hrsmth wave, missing

                     |                 Survey wave
       op_ind_hrsmth |         1          2          3          4 |     Total
---------------------+--------------------------------------------+----------
        -13:Deceased |         0      2,287      2,790      2,516 |    16,231 
        Zero days/wk |         0      1,264      1,024        998 |     9,399 
   -11:hours missing |       253        220        324        237 |     1,886 
    -10:days missing |       103          0          0          0 |       103 
-9:days+hours mssing |       729        372        558        547 |     4,199 
               -1:NA |    26,500     25,833     24,542     23,415 |   211,052 
             1:Valid |     9,206      7,502      6,116      4,921 |    49,937 
       9999:<1hr/day |     1,306        466        391        382 |     4,519 
---------------------+--------------------------------------------+----------
               Total |    38,097     37,944     35,745     33,016 |   297,326 


                     |           Survey wave
       op_ind_hrsmth |         5          6          7 |     Total
---------------------+---------------------------------+----------
        -13:Deceased |     2,118      3,143      3,377 |    16,231 
        Zero days/wk |     2,374      1,878      1,861 |     9,399 
   -11:hours missing |       333        292        227 |     1,886 
    -10:days missing |         0          0          0 |       103 
-9:days+hours mssing |     1,007        543        443 |     4,199 
               -1:NA |    37,743     36,863     36,156 |   211,052 
             1:Valid |     7,975      7,801      6,416 |    49,937 
       9999:<1hr/day |       735        654        585 |     4,519 
---------------------+---------------------------------+----------
               Total |    52,285     51,174     49,065 |   297,326 


. 
. //generate variable indicating one day per month or one day per week
. gen justone=.
(297,326 missing values generated)

. forvalues w=1/$w{
  2. replace justone=0 if wave==`w'
  3. replace justone=1 if (numdayswk==1 | numdaysmn==1) & wave==`w'
  4. }
(38,097 real changes made)
(3,160 real changes made)
(37,944 real changes made)
(1,386 real changes made)
(35,745 real changes made)
(1,062 real changes made)
(33,016 real changes made)
(847 real changes made)
(52,285 real changes made)
(1,387 real changes made)
(51,174 real changes made)
(1,305 real changes made)
(49,065 real changes made)
(1,096 real changes made)

. tab justone op_ind_hrsmth, missing

           |                     op_ind_hrsmth
   justone | -13:Decea  Zero days  -11:hours  -10:days   -9:days+h |     Total
-----------+-------------------------------------------------------+----------
         0 |    16,231      9,398      1,682        103      4,198 |   287,083 
         1 |         0          1        204          0          1 |    10,243 
-----------+-------------------------------------------------------+----------
     Total |    16,231      9,399      1,886        103      4,199 |   297,326 


           |          op_ind_hrsmth
   justone |     -1:NA    1:Valid  9999:<1hr |     Total
-----------+---------------------------------+----------
         0 |   211,052     41,740      2,679 |   287,083 
         1 |         0      8,197      1,840 |    10,243 
-----------+---------------------------------+----------
     Total |   211,052     49,937      4,519 |   297,326 


. 
. //recode help flags to 0=(no or inapplicable) or 1=yes
. forvalues w=1/$w{
  2. foreach v in outhlp insdhlp bedhlp tkplhlp1 tkplhlp2 launhlp shophlp mealhl
> p ///
> bankhlp eathlp bathhlp toilhlp dreshlp medshlp moneyhlp dochlp insurhlp{
  3. tab `v' if wave==`w', missing
  4. replace `v'=0 if `v'==-1 & wave==`w'
  5. }
  6. }

  R1 MO6A HELPS |
  SP GO OUTSIDE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,363       95.45       95.45
          1 Yes |      1,734        4.55      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(36,363 real changes made)

 R1 MO19A HELPS |
SP INSIDE HOUSE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,951       96.99       96.99
          1 Yes |      1,146        3.01      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(36,951 real changes made)

 R1 MO25A HELPS |
  SP OUT OF BED |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     37,372       98.10       98.10
          1 Yes |        725        1.90      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(37,372 real changes made)

  R1 DT5A TAKES |
 SP PLACES MOST |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,277       89.97       89.97
          1 Yes |      3,820       10.03      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(34,277 real changes made)

  R1 DT7A TAKES |
  SP PLACES OTH |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,423       95.61       95.61
          1 Yes |      1,674        4.39      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(36,423 real changes made)

  R1 HA3A HELPS |
SP WITH LAUNDRY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,248       89.90       89.90
          1 Yes |      3,849       10.10      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(34,248 real changes made)

 R1 HA25A HELPS |
        SP WITH |
       SHOPPING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     32,691       85.81       85.81
          1 Yes |      5,406       14.19      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(32,691 real changes made)

 R1 HA32A HELPS |
  SP WITH MEALS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     33,240       87.25       87.25
          1 Yes |      4,857       12.75      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(33,240 real changes made)

 R1 HA42A HELPS |
SP WITH BANKING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,595       90.81       90.81
          1 Yes |      3,502        9.19      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(34,595 real changes made)

  R1 SC3A HELPS |
 SP WITH EATING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     37,466       98.34       98.34
          1 Yes |        631        1.66      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(37,466 real changes made)

 R1 SC11A HELPS |
SP WITH BATHING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     37,131       97.46       97.46
          1 Yes |        966        2.54      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(37,131 real changes made)

 R1 SC17A HELPS |
        SP WITH |
      TOILETING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     37,601       98.70       98.70
          1 Yes |        496        1.30      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(37,601 real changes made)

 R1 SC23A HELPS |
        SP WITH |
       DRESSING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,877       96.80       96.80
          1 Yes |      1,220        3.20      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(36,877 real changes made)

  R1 MC5A HELPS |
        SP WITH |
      MEDICINES |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,515       95.85       95.85
          1 Yes |      1,582        4.15      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(36,515 real changes made)

 R1 HA52A HELPS |
  SP WITH MONEY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,906       96.87       96.87
          1 Yes |      1,191        3.13      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(36,906 real changes made)

  R1 MC17A SITS |
 IN W SP AT DRS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,631       90.90       90.90
          1 Yes |      3,466        9.10      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(34,631 real changes made)

 R1 MC22A HELPS |
     WITH INSUR |
          DECIS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     37,690       98.93       98.93
          1 Yes |        407        1.07      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(37,690 real changes made)

  R1 MO6A HELPS |
  SP GO OUTSIDE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,119       95.19       95.19
          1 Yes |      1,825        4.81      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(36,119 real changes made)

 R1 MO19A HELPS |
SP INSIDE HOUSE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,536       96.29       96.29
          1 Yes |      1,408        3.71      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(36,536 real changes made)

 R1 MO25A HELPS |
  SP OUT OF BED |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,942       97.36       97.36
          1 Yes |      1,002        2.64      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(36,942 real changes made)

  R1 DT5A TAKES |
 SP PLACES MOST |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,708       91.47       91.47
          1 Yes |      3,236        8.53      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(34,708 real changes made)

  R1 DT7A TAKES |
  SP PLACES OTH |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,459       96.09       96.09
          1 Yes |      1,485        3.91      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(36,459 real changes made)

  R1 HA3A HELPS |
SP WITH LAUNDRY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,791       91.69       91.69
          1 Yes |      3,153        8.31      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(34,791 real changes made)

 R1 HA25A HELPS |
        SP WITH |
       SHOPPING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     33,637       88.65       88.65
          1 Yes |      4,307       11.35      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(33,637 real changes made)

 R1 HA32A HELPS |
  SP WITH MEALS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     33,840       89.18       89.18
          1 Yes |      4,104       10.82      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(33,840 real changes made)

 R1 HA42A HELPS |
SP WITH BANKING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     35,151       92.64       92.64
          1 Yes |      2,793        7.36      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(35,151 real changes made)

  R1 SC3A HELPS |
 SP WITH EATING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,948       97.38       97.38
          1 Yes |        996        2.62      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(36,948 real changes made)

 R1 SC11A HELPS |
SP WITH BATHING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,479       96.14       96.14
          1 Yes |      1,465        3.86      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(36,479 real changes made)

 R1 SC17A HELPS |
        SP WITH |
      TOILETING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     37,086       97.74       97.74
          1 Yes |        858        2.26      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(37,086 real changes made)

 R1 SC23A HELPS |
        SP WITH |
       DRESSING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,411       95.96       95.96
          1 Yes |      1,533        4.04      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(36,411 real changes made)

  R1 MC5A HELPS |
        SP WITH |
      MEDICINES |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,629       96.53       96.53
          1 Yes |      1,315        3.47      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(36,629 real changes made)

 R1 HA52A HELPS |
  SP WITH MONEY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     37,034       97.60       97.60
          1 Yes |        910        2.40      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(37,034 real changes made)

  R1 MC17A SITS |
 IN W SP AT DRS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     35,204       92.78       92.78
          1 Yes |      2,740        7.22      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(35,204 real changes made)

 R1 MC22A HELPS |
     WITH INSUR |
          DECIS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     37,670       99.28       99.28
          1 Yes |        274        0.72      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(37,670 real changes made)

  R1 MO6A HELPS |
  SP GO OUTSIDE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,099       95.40       95.40
          1 Yes |      1,646        4.60      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(34,099 real changes made)

 R1 MO19A HELPS |
SP INSIDE HOUSE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,468       96.43       96.43
          1 Yes |      1,277        3.57      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(34,468 real changes made)

 R1 MO25A HELPS |
  SP OUT OF BED |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,758       97.24       97.24
          1 Yes |        987        2.76      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(34,758 real changes made)

  R1 DT5A TAKES |
 SP PLACES MOST |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     33,064       92.50       92.50
          1 Yes |      2,681        7.50      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(33,064 real changes made)

  R1 DT7A TAKES |
  SP PLACES OTH |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,376       96.17       96.17
          1 Yes |      1,369        3.83      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(34,376 real changes made)

  R1 HA3A HELPS |
SP WITH LAUNDRY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     33,148       92.73       92.73
          1 Yes |      2,597        7.27      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(33,148 real changes made)

 R1 HA25A HELPS |
        SP WITH |
       SHOPPING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     32,111       89.83       89.83
          1 Yes |      3,634       10.17      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(32,111 real changes made)

 R1 HA32A HELPS |
  SP WITH MEALS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     32,304       90.37       90.37
          1 Yes |      3,441        9.63      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(32,304 real changes made)

 R1 HA42A HELPS |
SP WITH BANKING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     33,433       93.53       93.53
          1 Yes |      2,312        6.47      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(33,433 real changes made)

  R1 SC3A HELPS |
 SP WITH EATING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,725       97.15       97.15
          1 Yes |      1,020        2.85      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(34,725 real changes made)

 R1 SC11A HELPS |
SP WITH BATHING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,399       96.23       96.23
          1 Yes |      1,346        3.77      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(34,399 real changes made)

 R1 SC17A HELPS |
        SP WITH |
      TOILETING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,880       97.58       97.58
          1 Yes |        865        2.42      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(34,880 real changes made)

 R1 SC23A HELPS |
        SP WITH |
       DRESSING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,251       95.82       95.82
          1 Yes |      1,494        4.18      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(34,251 real changes made)

  R1 MC5A HELPS |
        SP WITH |
      MEDICINES |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,644       96.92       96.92
          1 Yes |      1,101        3.08      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(34,644 real changes made)

 R1 HA52A HELPS |
  SP WITH MONEY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,973       97.84       97.84
          1 Yes |        772        2.16      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(34,973 real changes made)

  R1 MC17A SITS |
 IN W SP AT DRS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     33,422       93.50       93.50
          1 Yes |      2,323        6.50      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(33,422 real changes made)

 R1 MC22A HELPS |
     WITH INSUR |
          DECIS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     35,516       99.36       99.36
          1 Yes |        229        0.64      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(35,516 real changes made)

  R1 MO6A HELPS |
  SP GO OUTSIDE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     31,583       95.66       95.66
          1 Yes |      1,433        4.34      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(31,583 real changes made)

 R1 MO19A HELPS |
SP INSIDE HOUSE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     31,894       96.60       96.60
          1 Yes |      1,122        3.40      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(31,894 real changes made)

 R1 MO25A HELPS |
  SP OUT OF BED |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     32,139       97.34       97.34
          1 Yes |        877        2.66      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(32,139 real changes made)

  R1 DT5A TAKES |
 SP PLACES MOST |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     30,769       93.19       93.19
          1 Yes |      2,247        6.81      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(30,769 real changes made)

  R1 DT7A TAKES |
  SP PLACES OTH |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     31,867       96.52       96.52
          1 Yes |      1,149        3.48      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(31,867 real changes made)

  R1 HA3A HELPS |
SP WITH LAUNDRY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     30,847       93.43       93.43
          1 Yes |      2,169        6.57      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(30,847 real changes made)

 R1 HA25A HELPS |
        SP WITH |
       SHOPPING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     30,036       90.97       90.97
          1 Yes |      2,980        9.03      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(30,036 real changes made)

 R1 HA32A HELPS |
  SP WITH MEALS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     30,131       91.26       91.26
          1 Yes |      2,885        8.74      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(30,131 real changes made)

 R1 HA42A HELPS |
SP WITH BANKING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     31,080       94.14       94.14
          1 Yes |      1,936        5.86      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(31,080 real changes made)

  R1 SC3A HELPS |
 SP WITH EATING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     32,104       97.24       97.24
          1 Yes |        912        2.76      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(32,104 real changes made)

 R1 SC11A HELPS |
SP WITH BATHING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     31,910       96.65       96.65
          1 Yes |      1,106        3.35      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(31,910 real changes made)

 R1 SC17A HELPS |
        SP WITH |
      TOILETING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     32,329       97.92       97.92
          1 Yes |        687        2.08      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(32,329 real changes made)

 R1 SC23A HELPS |
        SP WITH |
       DRESSING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     31,704       96.03       96.03
          1 Yes |      1,312        3.97      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(31,704 real changes made)

  R1 MC5A HELPS |
        SP WITH |
      MEDICINES |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     32,033       97.02       97.02
          1 Yes |        983        2.98      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(32,033 real changes made)

 R1 HA52A HELPS |
  SP WITH MONEY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     32,285       97.79       97.79
          1 Yes |        731        2.21      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(32,285 real changes made)

  R1 MC17A SITS |
 IN W SP AT DRS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     31,006       93.91       93.91
          1 Yes |      2,010        6.09      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(31,006 real changes made)

 R1 MC22A HELPS |
     WITH INSUR |
          DECIS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     32,766       99.24       99.24
          1 Yes |        250        0.76      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(32,766 real changes made)

  R1 MO6A HELPS |
  SP GO OUTSIDE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     50,225       96.06       96.06
          1 Yes |      2,060        3.94      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(50,225 real changes made)

 R1 MO19A HELPS |
SP INSIDE HOUSE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     50,773       97.11       97.11
          1 Yes |      1,512        2.89      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(50,773 real changes made)

 R1 MO25A HELPS |
  SP OUT OF BED |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     51,201       97.93       97.93
          1 Yes |      1,084        2.07      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(51,201 real changes made)

  R1 DT5A TAKES |
 SP PLACES MOST |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     48,505       92.77       92.77
          1 Yes |      3,780        7.23      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(48,505 real changes made)

  R1 DT7A TAKES |
  SP PLACES OTH |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     50,442       96.48       96.48
          1 Yes |      1,843        3.52      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(50,442 real changes made)

  R1 HA3A HELPS |
SP WITH LAUNDRY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     48,357       92.49       92.49
          1 Yes |      3,928        7.51      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(48,357 real changes made)

 R1 HA25A HELPS |
        SP WITH |
       SHOPPING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     46,731       89.38       89.38
          1 Yes |      5,554       10.62      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(46,731 real changes made)

 R1 HA32A HELPS |
  SP WITH MEALS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     47,057       90.00       90.00
          1 Yes |      5,228       10.00      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(47,057 real changes made)

 R1 HA42A HELPS |
SP WITH BANKING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     48,892       93.51       93.51
          1 Yes |      3,393        6.49      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(48,892 real changes made)

  R1 SC3A HELPS |
 SP WITH EATING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     51,286       98.09       98.09
          1 Yes |        999        1.91      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(51,286 real changes made)

 R1 SC11A HELPS |
SP WITH BATHING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     50,903       97.36       97.36
          1 Yes |      1,382        2.64      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(50,903 real changes made)

 R1 SC17A HELPS |
        SP WITH |
      TOILETING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     51,502       98.50       98.50
          1 Yes |        783        1.50      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(51,502 real changes made)

 R1 SC23A HELPS |
        SP WITH |
       DRESSING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     50,533       96.65       96.65
          1 Yes |      1,752        3.35      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(50,533 real changes made)

  R1 MC5A HELPS |
        SP WITH |
      MEDICINES |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     50,666       96.90       96.90
          1 Yes |      1,619        3.10      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(50,666 real changes made)

 R1 HA52A HELPS |
  SP WITH MONEY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     51,075       97.69       97.69
          1 Yes |      1,210        2.31      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(51,075 real changes made)

  R1 MC17A SITS |
 IN W SP AT DRS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     48,781       93.30       93.30
          1 Yes |      3,504        6.70      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(48,781 real changes made)

 R1 MC22A HELPS |
     WITH INSUR |
          DECIS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     51,894       99.25       99.25
          1 Yes |        391        0.75      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(51,894 real changes made)

  R1 MO6A HELPS |
  SP GO OUTSIDE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     49,066       95.88       95.88
          1 Yes |      2,108        4.12      100.00
----------------+-----------------------------------
          Total |     51,174      100.00
(49,066 real changes made)

 R1 MO19A HELPS |
SP INSIDE HOUSE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     49,578       96.88       96.88
          1 Yes |      1,596        3.12      100.00
----------------+-----------------------------------
          Total |     51,174      100.00
(49,578 real changes made)

 R1 MO25A HELPS |
  SP OUT OF BED |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     49,915       97.54       97.54
          1 Yes |      1,259        2.46      100.00
----------------+-----------------------------------
          Total |     51,174      100.00
(49,915 real changes made)

  R1 DT5A TAKES |
 SP PLACES MOST |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     47,690       93.19       93.19
          1 Yes |      3,484        6.81      100.00
----------------+-----------------------------------
          Total |     51,174      100.00
(47,690 real changes made)

  R1 DT7A TAKES |
  SP PLACES OTH |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     49,390       96.51       96.51
          1 Yes |      1,784        3.49      100.00
----------------+-----------------------------------
          Total |     51,174      100.00
(49,390 real changes made)

  R1 HA3A HELPS |
SP WITH LAUNDRY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     47,738       93.29       93.29
          1 Yes |      3,436        6.71      100.00
----------------+-----------------------------------
          Total |     51,174      100.00
(47,738 real changes made)

 R1 HA25A HELPS |
        SP WITH |
       SHOPPING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     46,370       90.61       90.61
          1 Yes |      4,804        9.39      100.00
----------------+-----------------------------------
          Total |     51,174      100.00
(46,370 real changes made)

 R1 HA32A HELPS |
  SP WITH MEALS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     46,584       91.03       91.03
          1 Yes |      4,590        8.97      100.00
----------------+-----------------------------------
          Total |     51,174      100.00
(46,584 real changes made)

 R1 HA42A HELPS |
SP WITH BANKING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     48,291       94.37       94.37
          1 Yes |      2,883        5.63      100.00
----------------+-----------------------------------
          Total |     51,174      100.00
(48,291 real changes made)

  R1 SC3A HELPS |
 SP WITH EATING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     50,058       97.82       97.82
          1 Yes |      1,116        2.18      100.00
----------------+-----------------------------------
          Total |     51,174      100.00
(50,058 real changes made)

 R1 SC11A HELPS |
SP WITH BATHING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     49,655       97.03       97.03
          1 Yes |      1,519        2.97      100.00
----------------+-----------------------------------
          Total |     51,174      100.00
(49,655 real changes made)

 R1 SC17A HELPS |
        SP WITH |
      TOILETING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     50,203       98.10       98.10
          1 Yes |        971        1.90      100.00
----------------+-----------------------------------
          Total |     51,174      100.00
(50,203 real changes made)

 R1 SC23A HELPS |
        SP WITH |
       DRESSING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     49,318       96.37       96.37
          1 Yes |      1,856        3.63      100.00
----------------+-----------------------------------
          Total |     51,174      100.00
(49,318 real changes made)

  R1 MC5A HELPS |
        SP WITH |
      MEDICINES |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     49,779       97.27       97.27
          1 Yes |      1,395        2.73      100.00
----------------+-----------------------------------
          Total |     51,174      100.00
(49,779 real changes made)

 R1 HA52A HELPS |
  SP WITH MONEY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     50,138       97.98       97.98
          1 Yes |      1,036        2.02      100.00
----------------+-----------------------------------
          Total |     51,174      100.00
(50,138 real changes made)

  R1 MC17A SITS |
 IN W SP AT DRS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     48,004       93.81       93.81
          1 Yes |      3,170        6.19      100.00
----------------+-----------------------------------
          Total |     51,174      100.00
(48,004 real changes made)

 R1 MC22A HELPS |
     WITH INSUR |
          DECIS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     50,822       99.31       99.31
          1 Yes |        352        0.69      100.00
----------------+-----------------------------------
          Total |     51,174      100.00
(50,822 real changes made)

  R1 MO6A HELPS |
  SP GO OUTSIDE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     47,332       96.47       96.47
          1 Yes |      1,733        3.53      100.00
----------------+-----------------------------------
          Total |     49,065      100.00
(47,332 real changes made)

 R1 MO19A HELPS |
SP INSIDE HOUSE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     47,702       97.22       97.22
          1 Yes |      1,363        2.78      100.00
----------------+-----------------------------------
          Total |     49,065      100.00
(47,702 real changes made)

 R1 MO25A HELPS |
  SP OUT OF BED |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     47,998       97.83       97.83
          1 Yes |      1,067        2.17      100.00
----------------+-----------------------------------
          Total |     49,065      100.00
(47,998 real changes made)

  R1 DT5A TAKES |
 SP PLACES MOST |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     46,068       93.89       93.89
          1 Yes |      2,997        6.11      100.00
----------------+-----------------------------------
          Total |     49,065      100.00
(46,068 real changes made)

  R1 DT7A TAKES |
  SP PLACES OTH |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     47,543       96.90       96.90
          1 Yes |      1,522        3.10      100.00
----------------+-----------------------------------
          Total |     49,065      100.00
(47,543 real changes made)

  R1 HA3A HELPS |
SP WITH LAUNDRY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     46,118       93.99       93.99
          1 Yes |      2,947        6.01      100.00
----------------+-----------------------------------
          Total |     49,065      100.00
(46,118 real changes made)

 R1 HA25A HELPS |
        SP WITH |
       SHOPPING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     44,920       91.55       91.55
          1 Yes |      4,145        8.45      100.00
----------------+-----------------------------------
          Total |     49,065      100.00
(44,920 real changes made)

 R1 HA32A HELPS |
  SP WITH MEALS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     45,082       91.88       91.88
          1 Yes |      3,983        8.12      100.00
----------------+-----------------------------------
          Total |     49,065      100.00
(45,082 real changes made)

 R1 HA42A HELPS |
SP WITH BANKING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     46,577       94.93       94.93
          1 Yes |      2,488        5.07      100.00
----------------+-----------------------------------
          Total |     49,065      100.00
(46,577 real changes made)

  R1 SC3A HELPS |
 SP WITH EATING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     48,024       97.88       97.88
          1 Yes |      1,041        2.12      100.00
----------------+-----------------------------------
          Total |     49,065      100.00
(48,024 real changes made)

 R1 SC11A HELPS |
SP WITH BATHING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     47,720       97.26       97.26
          1 Yes |      1,345        2.74      100.00
----------------+-----------------------------------
          Total |     49,065      100.00
(47,720 real changes made)

 R1 SC17A HELPS |
        SP WITH |
      TOILETING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     48,318       98.48       98.48
          1 Yes |        747        1.52      100.00
----------------+-----------------------------------
          Total |     49,065      100.00
(48,318 real changes made)

 R1 SC23A HELPS |
        SP WITH |
       DRESSING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     47,470       96.75       96.75
          1 Yes |      1,595        3.25      100.00
----------------+-----------------------------------
          Total |     49,065      100.00
(47,470 real changes made)

  R1 MC5A HELPS |
        SP WITH |
      MEDICINES |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     47,841       97.51       97.51
          1 Yes |      1,224        2.49      100.00
----------------+-----------------------------------
          Total |     49,065      100.00
(47,841 real changes made)

 R1 HA52A HELPS |
  SP WITH MONEY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     48,157       98.15       98.15
          1 Yes |        908        1.85      100.00
----------------+-----------------------------------
          Total |     49,065      100.00
(48,157 real changes made)

  R1 MC17A SITS |
 IN W SP AT DRS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     46,353       94.47       94.47
          1 Yes |      2,712        5.53      100.00
----------------+-----------------------------------
          Total |     49,065      100.00
(46,353 real changes made)

 R1 MC22A HELPS |
     WITH INSUR |
          DECIS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     48,784       99.43       99.43
          1 Yes |        281        0.57      100.00
----------------+-----------------------------------
          Total |     49,065      100.00
(48,784 real changes made)

. 
. //generate variable indicating help with only one activity
. gen numact=.
(297,326 missing values generated)

. forvalues w=1/$w{
  2. replace numact=outhlp + insdhlp + bedhlp + tkplhlp1 + tkplhlp2 + launhlp + 
> ///
> shophlp + mealhlp + bankhlp + eathlp + bathhlp + toilhlp + dreshlp + medshlp /
> //
> + moneyhlp + dochlp + insurhlp if wave==`w'
  3. }
(38,097 real changes made)
(37,944 real changes made)
(35,745 real changes made)
(33,016 real changes made)
(52,285 real changes made)
(51,174 real changes made)
(49,065 real changes made)

. 
. tab numact wave, missing

           |                      Survey wave
    numact |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
         0 |    26,152     26,835     25,983     24,744     38,773 |   219,139 
         1 |     4,741      4,436      4,003      3,367      5,526 |    31,857 
         2 |     1,875      1,747      1,566      1,359      2,220 |    12,465 
         3 |     1,433      1,382      1,091        931      1,627 |     9,299 
         4 |     1,242      1,122        974        755      1,291 |     7,632 
         5 |       877        786        665        611        896 |     5,487 
         6 |       570        580        520        448        679 |     3,945 
         7 |       345        357        357        264        417 |     2,511 
         8 |       246        203        157        173        235 |     1,443 
         9 |       149        152        126        111        185 |     1,097 
        10 |       134        109        105         75        139 |       769 
        11 |       131         95         78         63        110 |       640 
        12 |        92         57         51         55         90 |       470 
        13 |        55         51         40         35         51 |       313 
        14 |        41         23         20         17         40 |       201 
        15 |        13          9          8          7          6 |        54 
        16 |         1          0          1          1          0 |         4 
-----------+-------------------------------------------------------+----------
     Total |    38,097     37,944     35,745     33,016     52,285 |   297,326 


           |      Survey wave
    numact |         6          7 |     Total
-----------+----------------------+----------
         0 |    38,483     38,169 |   219,139 
         1 |     5,262      4,522 |    31,857 
         2 |     1,994      1,704 |    12,465 
         3 |     1,525      1,310 |     9,299 
         4 |     1,220      1,028 |     7,632 
         5 |       874        778 |     5,487 
         6 |       617        531 |     3,945 
         7 |       426        345 |     2,511 
         8 |       230        199 |     1,443 
         9 |       197        177 |     1,097 
        10 |       111         96 |       769 
        11 |        84         79 |       640 
        12 |        62         63 |       470 
        13 |        48         33 |       313 
        14 |        31         29 |       201 
        15 |         9          2 |        54 
        16 |         1          0 |         4 
-----------+----------------------+----------
     Total |    51,174     49,065 |   297,326 


. gen oneact=0 //note this =0 if help with no activities

. replace oneact=1 if numact==1
(31,857 real changes made)

. tab oneact opishelper_allw, missing

           |    opishelper_allw
    oneact |        -1          1 |     Total
-----------+----------------------+----------
         0 |   225,082     40,387 |   265,469 
         1 |     2,201     29,656 |    31,857 
-----------+----------------------+----------
     Total |   227,283     70,043 |   297,326 


. 
. ********************************************************************
. //generate variables indicating relationship is spouse, other rel, other nonre
> l
. gen spouse=.
(297,326 missing values generated)

. gen otherrel=.
(297,326 missing values generated)

. gen nonrel=.
(297,326 missing values generated)

. gen daughter=0

. gen son=0

. gen oth_fam=0

. 
. label var otherrel "Non-spouse relative"

. label var oth_fam "Family member of SP, not spouse, son, or daughter"

. label var nonrel "Non-relative"

. 
. forvalues w=1/$w{
  2. replace spouse=0 if wave==`w'
  3. replace spouse=1 if relat==2 & wave==`w'
  4. replace otherrel=0 if wave==`w'
  5. replace otherrel=1 if ((relat>2 & relat<=29) | relat==91) & wave==`w'
  6. replace nonrel=0 if wave==`w'
  7. replace nonrel=1 if (relat>=30 & relat~=91) & wave==`w'
  8. replace daughter=1 if inlist(relat,3,5,7) & wave==`w'
  9. replace son=1 if inlist(relat,4,6,8) & wave==`w'
 10. replace oth_fam=1 if ((relat>8 & relat<=29) | relat==91) & wave==`w'
 11. 
. tab relat spouse
 12. tab relat otherrel
 13. tab relat nonrel
 14. }
(38,097 real changes made)
(3,804 real changes made)
(38,097 real changes made)
(29,181 real changes made)
(38,097 real changes made)
(5,112 real changes made)
(11,763 real changes made)
(11,544 real changes made)
(5,874 real changes made)

         R1 OTHR PRSN |        spouse
   RELATIONSHIP TO SP |         0          1 |     Total
----------------------+----------------------+----------
    2 SPOUSE/ PARTNER |         0      3,804 |     3,804 
           3 DAUGHTER |    10,386          0 |    10,386 
                4 SON |    10,322          0 |    10,322 
    5 DAUGHTER-IN-LAW |       403          0 |       403 
         6 SON-IN-LAW |       331          0 |       331 
       7 STEPDAUGHTER |       974          0 |       974 
            8 STEPSON |       891          0 |       891 
             9 SISTER |     1,360          0 |     1,360 
           10 BROTHER |       571          0 |       571 
     11 SISTER-IN-LAW |       205          0 |       205 
    12 BROTHER-IN-LAW |        77          0 |        77 
            13 MOTHER |       115          0 |       115 
        14 STEPMOTHER |         5          0 |         5 
     15 MOTHER-IN-LAW |        35          0 |        35 
            16 FATHER |        14          0 |        14 
        17 STEPFATHER |         3          0 |         3 
     18 FATHER-IN-LAW |         7          0 |         7 
     19 GRANDDAUGHTER |     1,169          0 |     1,169 
          20 GRANDSON |       950          0 |       950 
             21 NIECE |       347          0 |       347 
            22 NEPHEW |       201          0 |       201 
              23 AUNT |        45          0 |        45 
             24 UNCLE |        14          0 |        14 
            25 COUSIN |       182          0 |       182 
26 STEPDAUGHTER'S SON |        30          0 |        30 
27 STEPSON'S SON/ DAU |        12          0 |        12 
28 DAUGHTER-IN-LAW'S  |        55          0 |        55 
29 SON-IN-LAW'S SON/  |        26          0 |        26 
    30 BOARDER/RENTER |        10          0 |        10 
31 PAID AIDE/ HOUSEKE |       547          0 |       547 
          32 ROOMMATE |        25          0 |        25 
33 EX-WIFE/ EX-HUSBAN |        54          0 |        54 
34 BOYFRIEND/ GIRLFRI |        51          0 |        51 
          35 NEIGHBOR |       189          0 |       189 
            36 FRIEND |     2,803          0 |     2,803 
37 STAFF PERSON AT TH |       367          0 |       367 
         38 CO-WORKER |        18          0 |        18 
39 MINISTER, PRIEST,  |       155          0 |       155 
40 PSYCHIATRIST, PSYC |        41          0 |        41 
    91 OTHER RELATIVE |       451          0 |       451 
 92 OTHER NONRELATIVE |       852          0 |       852 
----------------------+----------------------+----------
                Total |    34,293      3,804 |    38,097 


         R1 OTHR PRSN |  Non-spouse relative
   RELATIONSHIP TO SP |         0          1 |     Total
----------------------+----------------------+----------
    2 SPOUSE/ PARTNER |     3,804          0 |     3,804 
           3 DAUGHTER |         0     10,386 |    10,386 
                4 SON |         0     10,322 |    10,322 
    5 DAUGHTER-IN-LAW |         0        403 |       403 
         6 SON-IN-LAW |         0        331 |       331 
       7 STEPDAUGHTER |         0        974 |       974 
            8 STEPSON |         0        891 |       891 
             9 SISTER |         0      1,360 |     1,360 
           10 BROTHER |         0        571 |       571 
     11 SISTER-IN-LAW |         0        205 |       205 
    12 BROTHER-IN-LAW |         0         77 |        77 
            13 MOTHER |         0        115 |       115 
        14 STEPMOTHER |         0          5 |         5 
     15 MOTHER-IN-LAW |         0         35 |        35 
            16 FATHER |         0         14 |        14 
        17 STEPFATHER |         0          3 |         3 
     18 FATHER-IN-LAW |         0          7 |         7 
     19 GRANDDAUGHTER |         0      1,169 |     1,169 
          20 GRANDSON |         0        950 |       950 
             21 NIECE |         0        347 |       347 
            22 NEPHEW |         0        201 |       201 
              23 AUNT |         0         45 |        45 
             24 UNCLE |         0         14 |        14 
            25 COUSIN |         0        182 |       182 
26 STEPDAUGHTER'S SON |         0         30 |        30 
27 STEPSON'S SON/ DAU |         0         12 |        12 
28 DAUGHTER-IN-LAW'S  |         0         55 |        55 
29 SON-IN-LAW'S SON/  |         0         26 |        26 
    30 BOARDER/RENTER |        10          0 |        10 
31 PAID AIDE/ HOUSEKE |       547          0 |       547 
          32 ROOMMATE |        25          0 |        25 
33 EX-WIFE/ EX-HUSBAN |        54          0 |        54 
34 BOYFRIEND/ GIRLFRI |        51          0 |        51 
          35 NEIGHBOR |       189          0 |       189 
            36 FRIEND |     2,803          0 |     2,803 
37 STAFF PERSON AT TH |       367          0 |       367 
         38 CO-WORKER |        18          0 |        18 
39 MINISTER, PRIEST,  |       155          0 |       155 
40 PSYCHIATRIST, PSYC |        41          0 |        41 
    91 OTHER RELATIVE |         0        451 |       451 
 92 OTHER NONRELATIVE |       852          0 |       852 
----------------------+----------------------+----------
                Total |     8,916     29,181 |    38,097 


         R1 OTHR PRSN |     Non-relative
   RELATIONSHIP TO SP |         0          1 |     Total
----------------------+----------------------+----------
    2 SPOUSE/ PARTNER |     3,804          0 |     3,804 
           3 DAUGHTER |    10,386          0 |    10,386 
                4 SON |    10,322          0 |    10,322 
    5 DAUGHTER-IN-LAW |       403          0 |       403 
         6 SON-IN-LAW |       331          0 |       331 
       7 STEPDAUGHTER |       974          0 |       974 
            8 STEPSON |       891          0 |       891 
             9 SISTER |     1,360          0 |     1,360 
           10 BROTHER |       571          0 |       571 
     11 SISTER-IN-LAW |       205          0 |       205 
    12 BROTHER-IN-LAW |        77          0 |        77 
            13 MOTHER |       115          0 |       115 
        14 STEPMOTHER |         5          0 |         5 
     15 MOTHER-IN-LAW |        35          0 |        35 
            16 FATHER |        14          0 |        14 
        17 STEPFATHER |         3          0 |         3 
     18 FATHER-IN-LAW |         7          0 |         7 
     19 GRANDDAUGHTER |     1,169          0 |     1,169 
          20 GRANDSON |       950          0 |       950 
             21 NIECE |       347          0 |       347 
            22 NEPHEW |       201          0 |       201 
              23 AUNT |        45          0 |        45 
             24 UNCLE |        14          0 |        14 
            25 COUSIN |       182          0 |       182 
26 STEPDAUGHTER'S SON |        30          0 |        30 
27 STEPSON'S SON/ DAU |        12          0 |        12 
28 DAUGHTER-IN-LAW'S  |        55          0 |        55 
29 SON-IN-LAW'S SON/  |        26          0 |        26 
    30 BOARDER/RENTER |         0         10 |        10 
31 PAID AIDE/ HOUSEKE |         0        547 |       547 
          32 ROOMMATE |         0         25 |        25 
33 EX-WIFE/ EX-HUSBAN |         0         54 |        54 
34 BOYFRIEND/ GIRLFRI |         0         51 |        51 
          35 NEIGHBOR |         0        189 |       189 
            36 FRIEND |         0      2,803 |     2,803 
37 STAFF PERSON AT TH |         0        367 |       367 
         38 CO-WORKER |         0         18 |        18 
39 MINISTER, PRIEST,  |         0        155 |       155 
40 PSYCHIATRIST, PSYC |         0         41 |        41 
    91 OTHER RELATIVE |       451          0 |       451 
 92 OTHER NONRELATIVE |         0        852 |       852 
----------------------+----------------------+----------
                Total |    32,985      5,112 |    38,097 

(37,944 real changes made)
(3,063 real changes made)
(37,944 real changes made)
(27,270 real changes made)
(37,944 real changes made)
(7,365 real changes made)
(10,211 real changes made)
(9,912 real changes made)
(7,147 real changes made)

         R1 OTHR PRSN |        spouse
   RELATIONSHIP TO SP |         0          1 |     Total
----------------------+----------------------+----------
                   -8 |         3          0 |         3 
                   -1 |       243          0 |       243 
    2 SPOUSE/ PARTNER |         0      6,867 |     6,867 
           3 DAUGHTER |    19,244          0 |    19,244 
                4 SON |    19,064          0 |    19,064 
    5 DAUGHTER-IN-LAW |       906          0 |       906 
         6 SON-IN-LAW |       708          0 |       708 
       7 STEPDAUGHTER |     1,824          0 |     1,824 
            8 STEPSON |     1,684          0 |     1,684 
             9 SISTER |     2,810          0 |     2,810 
           10 BROTHER |     1,211          0 |     1,211 
     11 SISTER-IN-LAW |       465          0 |       465 
    12 BROTHER-IN-LAW |       171          0 |       171 
            13 MOTHER |       233          0 |       233 
        14 STEPMOTHER |        10          0 |        10 
     15 MOTHER-IN-LAW |        78          0 |        78 
            16 FATHER |        32          0 |        32 
        17 STEPFATHER |         6          0 |         6 
     18 FATHER-IN-LAW |        19          0 |        19 
     19 GRANDDAUGHTER |     2,602          0 |     2,602 
          20 GRANDSON |     2,159          0 |     2,159 
             21 NIECE |       787          0 |       787 
            22 NEPHEW |       431          0 |       431 
              23 AUNT |        90          0 |        90 
             24 UNCLE |        28          0 |        28 
            25 COUSIN |       422          0 |       422 
26 STEPDAUGHTER'S SON |        71          0 |        71 
27 STEPSON'S SON/ DAU |        37          0 |        37 
28 DAUGHTER-IN-LAW'S  |       130          0 |       130 
29 SON-IN-LAW'S SON/  |        61          0 |        61 
    30 BOARDER/RENTER |        21          0 |        21 
31 PAID AIDE/ HOUSEKE |     1,426          0 |     1,426 
          32 ROOMMATE |        54          0 |        54 
33 EX-WIFE/ EX-HUSBAN |       139          0 |       139 
34 BOYFRIEND/ GIRLFRI |       116          0 |       116 
          35 NEIGHBOR |       464          0 |       464 
            36 FRIEND |     6,358          0 |     6,358 
37 STAFF PERSON AT TH |     1,014          0 |     1,014 
         38 CO-WORKER |        44          0 |        44 
39 MINISTER, PRIEST,  |       349          0 |       349 
40 PSYCHIATRIST, PSYC |        88          0 |        88 
                   41 |       113          0 |       113 
    91 OTHER RELATIVE |     1,168          0 |     1,168 
 92 OTHER NONRELATIVE |     2,291          0 |     2,291 
----------------------+----------------------+----------
                Total |    69,174      6,867 |    76,041 


         R1 OTHR PRSN |  Non-spouse relative
   RELATIONSHIP TO SP |         0          1 |     Total
----------------------+----------------------+----------
                   -8 |         3          0 |         3 
                   -1 |       243          0 |       243 
    2 SPOUSE/ PARTNER |     6,867          0 |     6,867 
           3 DAUGHTER |         0     19,244 |    19,244 
                4 SON |         0     19,064 |    19,064 
    5 DAUGHTER-IN-LAW |         0        906 |       906 
         6 SON-IN-LAW |         0        708 |       708 
       7 STEPDAUGHTER |         0      1,824 |     1,824 
            8 STEPSON |         0      1,684 |     1,684 
             9 SISTER |         0      2,810 |     2,810 
           10 BROTHER |         0      1,211 |     1,211 
     11 SISTER-IN-LAW |         0        465 |       465 
    12 BROTHER-IN-LAW |         0        171 |       171 
            13 MOTHER |         0        233 |       233 
        14 STEPMOTHER |         0         10 |        10 
     15 MOTHER-IN-LAW |         0         78 |        78 
            16 FATHER |         0         32 |        32 
        17 STEPFATHER |         0          6 |         6 
     18 FATHER-IN-LAW |         0         19 |        19 
     19 GRANDDAUGHTER |         0      2,602 |     2,602 
          20 GRANDSON |         0      2,159 |     2,159 
             21 NIECE |         0        787 |       787 
            22 NEPHEW |         0        431 |       431 
              23 AUNT |         0         90 |        90 
             24 UNCLE |         0         28 |        28 
            25 COUSIN |         0        422 |       422 
26 STEPDAUGHTER'S SON |         0         71 |        71 
27 STEPSON'S SON/ DAU |         0         37 |        37 
28 DAUGHTER-IN-LAW'S  |         0        130 |       130 
29 SON-IN-LAW'S SON/  |         0         61 |        61 
    30 BOARDER/RENTER |        21          0 |        21 
31 PAID AIDE/ HOUSEKE |     1,426          0 |     1,426 
          32 ROOMMATE |        54          0 |        54 
33 EX-WIFE/ EX-HUSBAN |       139          0 |       139 
34 BOYFRIEND/ GIRLFRI |       116          0 |       116 
          35 NEIGHBOR |       464          0 |       464 
            36 FRIEND |     6,358          0 |     6,358 
37 STAFF PERSON AT TH |     1,014          0 |     1,014 
         38 CO-WORKER |        44          0 |        44 
39 MINISTER, PRIEST,  |       349          0 |       349 
40 PSYCHIATRIST, PSYC |        88          0 |        88 
                   41 |       113          0 |       113 
    91 OTHER RELATIVE |         0      1,168 |     1,168 
 92 OTHER NONRELATIVE |     2,291          0 |     2,291 
----------------------+----------------------+----------
                Total |    19,590     56,451 |    76,041 


         R1 OTHR PRSN |     Non-relative
   RELATIONSHIP TO SP |         0          1 |     Total
----------------------+----------------------+----------
                   -8 |         3          0 |         3 
                   -1 |       243          0 |       243 
    2 SPOUSE/ PARTNER |     6,867          0 |     6,867 
           3 DAUGHTER |    19,244          0 |    19,244 
                4 SON |    19,064          0 |    19,064 
    5 DAUGHTER-IN-LAW |       906          0 |       906 
         6 SON-IN-LAW |       708          0 |       708 
       7 STEPDAUGHTER |     1,824          0 |     1,824 
            8 STEPSON |     1,684          0 |     1,684 
             9 SISTER |     2,810          0 |     2,810 
           10 BROTHER |     1,211          0 |     1,211 
     11 SISTER-IN-LAW |       465          0 |       465 
    12 BROTHER-IN-LAW |       171          0 |       171 
            13 MOTHER |       233          0 |       233 
        14 STEPMOTHER |        10          0 |        10 
     15 MOTHER-IN-LAW |        78          0 |        78 
            16 FATHER |        32          0 |        32 
        17 STEPFATHER |         6          0 |         6 
     18 FATHER-IN-LAW |        19          0 |        19 
     19 GRANDDAUGHTER |     2,602          0 |     2,602 
          20 GRANDSON |     2,159          0 |     2,159 
             21 NIECE |       787          0 |       787 
            22 NEPHEW |       431          0 |       431 
              23 AUNT |        90          0 |        90 
             24 UNCLE |        28          0 |        28 
            25 COUSIN |       422          0 |       422 
26 STEPDAUGHTER'S SON |        71          0 |        71 
27 STEPSON'S SON/ DAU |        37          0 |        37 
28 DAUGHTER-IN-LAW'S  |       130          0 |       130 
29 SON-IN-LAW'S SON/  |        61          0 |        61 
    30 BOARDER/RENTER |         0         21 |        21 
31 PAID AIDE/ HOUSEKE |         0      1,426 |     1,426 
          32 ROOMMATE |         0         54 |        54 
33 EX-WIFE/ EX-HUSBAN |         0        139 |       139 
34 BOYFRIEND/ GIRLFRI |         0        116 |       116 
          35 NEIGHBOR |         0        464 |       464 
            36 FRIEND |         0      6,358 |     6,358 
37 STAFF PERSON AT TH |         0      1,014 |     1,014 
         38 CO-WORKER |         0         44 |        44 
39 MINISTER, PRIEST,  |         0        349 |       349 
40 PSYCHIATRIST, PSYC |         0         88 |        88 
                   41 |         0        113 |       113 
    91 OTHER RELATIVE |     1,168          0 |     1,168 
 92 OTHER NONRELATIVE |         0      2,291 |     2,291 
----------------------+----------------------+----------
                Total |    63,564     12,477 |    76,041 

(35,745 real changes made)
(2,440 real changes made)
(35,745 real changes made)
(24,421 real changes made)
(35,745 real changes made)
(8,364 real changes made)
(8,546 real changes made)
(8,352 real changes made)
(7,523 real changes made)

         R1 OTHR PRSN |        spouse
   RELATIONSHIP TO SP |         0          1 |     Total
----------------------+----------------------+----------
                   -8 |         3          0 |         3 
                   -1 |       763          0 |       763 
    2 SPOUSE/ PARTNER |         0      9,307 |     9,307 
           3 DAUGHTER |    26,553          0 |    26,553 
                4 SON |    26,341          0 |    26,341 
    5 DAUGHTER-IN-LAW |     1,415          0 |     1,415 
         6 SON-IN-LAW |     1,094          0 |     1,094 
       7 STEPDAUGHTER |     2,552          0 |     2,552 
            8 STEPSON |     2,373          0 |     2,373 
             9 SISTER |     4,208          0 |     4,208 
           10 BROTHER |     1,888          0 |     1,888 
     11 SISTER-IN-LAW |       746          0 |       746 
    12 BROTHER-IN-LAW |       277          0 |       277 
            13 MOTHER |       347          0 |       347 
        14 STEPMOTHER |        15          0 |        15 
     15 MOTHER-IN-LAW |       125          0 |       125 
            16 FATHER |        48          0 |        48 
        17 STEPFATHER |         9          0 |         9 
     18 FATHER-IN-LAW |        35          0 |        35 
     19 GRANDDAUGHTER |     4,121          0 |     4,121 
          20 GRANDSON |     3,444          0 |     3,444 
             21 NIECE |     1,254          0 |     1,254 
            22 NEPHEW |       687          0 |       687 
              23 AUNT |       140          0 |       140 
             24 UNCLE |        38          0 |        38 
            25 COUSIN |       670          0 |       670 
26 STEPDAUGHTER'S SON |       115          0 |       115 
27 STEPSON'S SON/ DAU |        70          0 |        70 
28 DAUGHTER-IN-LAW'S  |       237          0 |       237 
29 SON-IN-LAW'S SON/  |       105          0 |       105 
    30 BOARDER/RENTER |        32          0 |        32 
31 PAID AIDE/ HOUSEKE |     2,405          0 |     2,405 
          32 ROOMMATE |        80          0 |        80 
33 EX-WIFE/ EX-HUSBAN |       235          0 |       235 
34 BOYFRIEND/ GIRLFRI |       175          0 |       175 
          35 NEIGHBOR |       833          0 |       833 
            36 FRIEND |    10,399          0 |    10,399 
37 STAFF PERSON AT TH |     1,659          0 |     1,659 
         38 CO-WORKER |        71          0 |        71 
39 MINISTER, PRIEST,  |       556          0 |       556 
40 PSYCHIATRIST, PSYC |       136          0 |       136 
                   41 |       202          0 |       202 
    91 OTHER RELATIVE |     1,965          0 |     1,965 
 92 OTHER NONRELATIVE |     4,058          0 |     4,058 
----------------------+----------------------+----------
                Total |   102,479      9,307 |   111,786 


         R1 OTHR PRSN |  Non-spouse relative
   RELATIONSHIP TO SP |         0          1 |     Total
----------------------+----------------------+----------
                   -8 |         3          0 |         3 
                   -1 |       763          0 |       763 
    2 SPOUSE/ PARTNER |     9,307          0 |     9,307 
           3 DAUGHTER |         0     26,553 |    26,553 
                4 SON |         0     26,341 |    26,341 
    5 DAUGHTER-IN-LAW |         0      1,415 |     1,415 
         6 SON-IN-LAW |         0      1,094 |     1,094 
       7 STEPDAUGHTER |         0      2,552 |     2,552 
            8 STEPSON |         0      2,373 |     2,373 
             9 SISTER |         0      4,208 |     4,208 
           10 BROTHER |         0      1,888 |     1,888 
     11 SISTER-IN-LAW |         0        746 |       746 
    12 BROTHER-IN-LAW |         0        277 |       277 
            13 MOTHER |         0        347 |       347 
        14 STEPMOTHER |         0         15 |        15 
     15 MOTHER-IN-LAW |         0        125 |       125 
            16 FATHER |         0         48 |        48 
        17 STEPFATHER |         0          9 |         9 
     18 FATHER-IN-LAW |         0         35 |        35 
     19 GRANDDAUGHTER |         0      4,121 |     4,121 
          20 GRANDSON |         0      3,444 |     3,444 
             21 NIECE |         0      1,254 |     1,254 
            22 NEPHEW |         0        687 |       687 
              23 AUNT |         0        140 |       140 
             24 UNCLE |         0         38 |        38 
            25 COUSIN |         0        670 |       670 
26 STEPDAUGHTER'S SON |         0        115 |       115 
27 STEPSON'S SON/ DAU |         0         70 |        70 
28 DAUGHTER-IN-LAW'S  |         0        237 |       237 
29 SON-IN-LAW'S SON/  |         0        105 |       105 
    30 BOARDER/RENTER |        32          0 |        32 
31 PAID AIDE/ HOUSEKE |     2,405          0 |     2,405 
          32 ROOMMATE |        80          0 |        80 
33 EX-WIFE/ EX-HUSBAN |       235          0 |       235 
34 BOYFRIEND/ GIRLFRI |       175          0 |       175 
          35 NEIGHBOR |       833          0 |       833 
            36 FRIEND |    10,399          0 |    10,399 
37 STAFF PERSON AT TH |     1,659          0 |     1,659 
         38 CO-WORKER |        71          0 |        71 
39 MINISTER, PRIEST,  |       556          0 |       556 
40 PSYCHIATRIST, PSYC |       136          0 |       136 
                   41 |       202          0 |       202 
    91 OTHER RELATIVE |         0      1,965 |     1,965 
 92 OTHER NONRELATIVE |     4,058          0 |     4,058 
----------------------+----------------------+----------
                Total |    30,914     80,872 |   111,786 


         R1 OTHR PRSN |     Non-relative
   RELATIONSHIP TO SP |         0          1 |     Total
----------------------+----------------------+----------
                   -8 |         3          0 |         3 
                   -1 |       763          0 |       763 
    2 SPOUSE/ PARTNER |     9,307          0 |     9,307 
           3 DAUGHTER |    26,553          0 |    26,553 
                4 SON |    26,341          0 |    26,341 
    5 DAUGHTER-IN-LAW |     1,415          0 |     1,415 
         6 SON-IN-LAW |     1,094          0 |     1,094 
       7 STEPDAUGHTER |     2,552          0 |     2,552 
            8 STEPSON |     2,373          0 |     2,373 
             9 SISTER |     4,208          0 |     4,208 
           10 BROTHER |     1,888          0 |     1,888 
     11 SISTER-IN-LAW |       746          0 |       746 
    12 BROTHER-IN-LAW |       277          0 |       277 
            13 MOTHER |       347          0 |       347 
        14 STEPMOTHER |        15          0 |        15 
     15 MOTHER-IN-LAW |       125          0 |       125 
            16 FATHER |        48          0 |        48 
        17 STEPFATHER |         9          0 |         9 
     18 FATHER-IN-LAW |        35          0 |        35 
     19 GRANDDAUGHTER |     4,121          0 |     4,121 
          20 GRANDSON |     3,444          0 |     3,444 
             21 NIECE |     1,254          0 |     1,254 
            22 NEPHEW |       687          0 |       687 
              23 AUNT |       140          0 |       140 
             24 UNCLE |        38          0 |        38 
            25 COUSIN |       670          0 |       670 
26 STEPDAUGHTER'S SON |       115          0 |       115 
27 STEPSON'S SON/ DAU |        70          0 |        70 
28 DAUGHTER-IN-LAW'S  |       237          0 |       237 
29 SON-IN-LAW'S SON/  |       105          0 |       105 
    30 BOARDER/RENTER |         0         32 |        32 
31 PAID AIDE/ HOUSEKE |         0      2,405 |     2,405 
          32 ROOMMATE |         0         80 |        80 
33 EX-WIFE/ EX-HUSBAN |         0        235 |       235 
34 BOYFRIEND/ GIRLFRI |         0        175 |       175 
          35 NEIGHBOR |         0        833 |       833 
            36 FRIEND |         0     10,399 |    10,399 
37 STAFF PERSON AT TH |         0      1,659 |     1,659 
         38 CO-WORKER |         0         71 |        71 
39 MINISTER, PRIEST,  |         0        556 |       556 
40 PSYCHIATRIST, PSYC |         0        136 |       136 
                   41 |         0        202 |       202 
    91 OTHER RELATIVE |     1,965          0 |     1,965 
 92 OTHER NONRELATIVE |         0      4,058 |     4,058 
----------------------+----------------------+----------
                Total |    90,945     20,841 |   111,786 

(33,016 real changes made)
(1,969 real changes made)
(33,016 real changes made)
(21,632 real changes made)
(33,016 real changes made)
(8,600 real changes made)
(7,165 real changes made)
(6,991 real changes made)
(7,476 real changes made)

         R1 OTHR PRSN |        spouse
   RELATIONSHIP TO SP |         0          1 |     Total
----------------------+----------------------+----------
                   -8 |         3          0 |         3 
                   -1 |     1,578          0 |     1,578 
    2 SPOUSE/ PARTNER |         0     11,276 |    11,276 
           3 DAUGHTER |    32,623          0 |    32,623 
                4 SON |    32,381          0 |    32,381 
    5 DAUGHTER-IN-LAW |     1,904          0 |     1,904 
         6 SON-IN-LAW |     1,459          0 |     1,459 
       7 STEPDAUGHTER |     3,158          0 |     3,158 
            8 STEPSON |     2,959          0 |     2,959 
             9 SISTER |     5,544          0 |     5,544 
           10 BROTHER |     2,538          0 |     2,538 
     11 SISTER-IN-LAW |     1,041          0 |     1,041 
    12 BROTHER-IN-LAW |       390          0 |       390 
            13 MOTHER |       449          0 |       449 
        14 STEPMOTHER |        20          0 |        20 
     15 MOTHER-IN-LAW |       168          0 |       168 
            16 FATHER |        62          0 |        62 
        17 STEPFATHER |        13          0 |        13 
     18 FATHER-IN-LAW |        53          0 |        53 
     19 GRANDDAUGHTER |     5,660          0 |     5,660 
          20 GRANDSON |     4,762          0 |     4,762 
             21 NIECE |     1,727          0 |     1,727 
            22 NEPHEW |       936          0 |       936 
              23 AUNT |       191          0 |       191 
             24 UNCLE |        48          0 |        48 
            25 COUSIN |       921          0 |       921 
26 STEPDAUGHTER'S SON |       155          0 |       155 
27 STEPSON'S SON/ DAU |       101          0 |       101 
28 DAUGHTER-IN-LAW'S  |       344          0 |       344 
29 SON-IN-LAW'S SON/  |       143          0 |       143 
    30 BOARDER/RENTER |        43          0 |        43 
31 PAID AIDE/ HOUSEKE |     3,297          0 |     3,297 
          32 ROOMMATE |       110          0 |       110 
33 EX-WIFE/ EX-HUSBAN |       331          0 |       331 
34 BOYFRIEND/ GIRLFRI |       226          0 |       226 
          35 NEIGHBOR |     1,234          0 |     1,234 
            36 FRIEND |    14,633          0 |    14,633 
37 STAFF PERSON AT TH |     2,243          0 |     2,243 
         38 CO-WORKER |        99          0 |        99 
39 MINISTER, PRIEST,  |       762          0 |       762 
40 PSYCHIATRIST, PSYC |       185          0 |       185 
                   41 |       286          0 |       286 
    91 OTHER RELATIVE |     2,754          0 |     2,754 
 92 OTHER NONRELATIVE |     5,992          0 |     5,992 
----------------------+----------------------+----------
                Total |   133,526     11,276 |   144,802 


         R1 OTHR PRSN |  Non-spouse relative
   RELATIONSHIP TO SP |         0          1 |     Total
----------------------+----------------------+----------
                   -8 |         3          0 |         3 
                   -1 |     1,578          0 |     1,578 
    2 SPOUSE/ PARTNER |    11,276          0 |    11,276 
           3 DAUGHTER |         0     32,623 |    32,623 
                4 SON |         0     32,381 |    32,381 
    5 DAUGHTER-IN-LAW |         0      1,904 |     1,904 
         6 SON-IN-LAW |         0      1,459 |     1,459 
       7 STEPDAUGHTER |         0      3,158 |     3,158 
            8 STEPSON |         0      2,959 |     2,959 
             9 SISTER |         0      5,544 |     5,544 
           10 BROTHER |         0      2,538 |     2,538 
     11 SISTER-IN-LAW |         0      1,041 |     1,041 
    12 BROTHER-IN-LAW |         0        390 |       390 
            13 MOTHER |         0        449 |       449 
        14 STEPMOTHER |         0         20 |        20 
     15 MOTHER-IN-LAW |         0        168 |       168 
            16 FATHER |         0         62 |        62 
        17 STEPFATHER |         0         13 |        13 
     18 FATHER-IN-LAW |         0         53 |        53 
     19 GRANDDAUGHTER |         0      5,660 |     5,660 
          20 GRANDSON |         0      4,762 |     4,762 
             21 NIECE |         0      1,727 |     1,727 
            22 NEPHEW |         0        936 |       936 
              23 AUNT |         0        191 |       191 
             24 UNCLE |         0         48 |        48 
            25 COUSIN |         0        921 |       921 
26 STEPDAUGHTER'S SON |         0        155 |       155 
27 STEPSON'S SON/ DAU |         0        101 |       101 
28 DAUGHTER-IN-LAW'S  |         0        344 |       344 
29 SON-IN-LAW'S SON/  |         0        143 |       143 
    30 BOARDER/RENTER |        43          0 |        43 
31 PAID AIDE/ HOUSEKE |     3,297          0 |     3,297 
          32 ROOMMATE |       110          0 |       110 
33 EX-WIFE/ EX-HUSBAN |       331          0 |       331 
34 BOYFRIEND/ GIRLFRI |       226          0 |       226 
          35 NEIGHBOR |     1,234          0 |     1,234 
            36 FRIEND |    14,633          0 |    14,633 
37 STAFF PERSON AT TH |     2,243          0 |     2,243 
         38 CO-WORKER |        99          0 |        99 
39 MINISTER, PRIEST,  |       762          0 |       762 
40 PSYCHIATRIST, PSYC |       185          0 |       185 
                   41 |       286          0 |       286 
    91 OTHER RELATIVE |         0      2,754 |     2,754 
 92 OTHER NONRELATIVE |     5,992          0 |     5,992 
----------------------+----------------------+----------
                Total |    42,298    102,504 |   144,802 


         R1 OTHR PRSN |     Non-relative
   RELATIONSHIP TO SP |         0          1 |     Total
----------------------+----------------------+----------
                   -8 |         3          0 |         3 
                   -1 |     1,578          0 |     1,578 
    2 SPOUSE/ PARTNER |    11,276          0 |    11,276 
           3 DAUGHTER |    32,623          0 |    32,623 
                4 SON |    32,381          0 |    32,381 
    5 DAUGHTER-IN-LAW |     1,904          0 |     1,904 
         6 SON-IN-LAW |     1,459          0 |     1,459 
       7 STEPDAUGHTER |     3,158          0 |     3,158 
            8 STEPSON |     2,959          0 |     2,959 
             9 SISTER |     5,544          0 |     5,544 
           10 BROTHER |     2,538          0 |     2,538 
     11 SISTER-IN-LAW |     1,041          0 |     1,041 
    12 BROTHER-IN-LAW |       390          0 |       390 
            13 MOTHER |       449          0 |       449 
        14 STEPMOTHER |        20          0 |        20 
     15 MOTHER-IN-LAW |       168          0 |       168 
            16 FATHER |        62          0 |        62 
        17 STEPFATHER |        13          0 |        13 
     18 FATHER-IN-LAW |        53          0 |        53 
     19 GRANDDAUGHTER |     5,660          0 |     5,660 
          20 GRANDSON |     4,762          0 |     4,762 
             21 NIECE |     1,727          0 |     1,727 
            22 NEPHEW |       936          0 |       936 
              23 AUNT |       191          0 |       191 
             24 UNCLE |        48          0 |        48 
            25 COUSIN |       921          0 |       921 
26 STEPDAUGHTER'S SON |       155          0 |       155 
27 STEPSON'S SON/ DAU |       101          0 |       101 
28 DAUGHTER-IN-LAW'S  |       344          0 |       344 
29 SON-IN-LAW'S SON/  |       143          0 |       143 
    30 BOARDER/RENTER |         0         43 |        43 
31 PAID AIDE/ HOUSEKE |         0      3,297 |     3,297 
          32 ROOMMATE |         0        110 |       110 
33 EX-WIFE/ EX-HUSBAN |         0        331 |       331 
34 BOYFRIEND/ GIRLFRI |         0        226 |       226 
          35 NEIGHBOR |         0      1,234 |     1,234 
            36 FRIEND |         0     14,633 |    14,633 
37 STAFF PERSON AT TH |         0      2,243 |     2,243 
         38 CO-WORKER |         0         99 |        99 
39 MINISTER, PRIEST,  |         0        762 |       762 
40 PSYCHIATRIST, PSYC |         0        185 |       185 
                   41 |         0        286 |       286 
    91 OTHER RELATIVE |     2,754          0 |     2,754 
 92 OTHER NONRELATIVE |         0      5,992 |     5,992 
----------------------+----------------------+----------
                Total |   115,361     29,441 |   144,802 

(52,285 real changes made)
(3,736 real changes made)
(52,285 real changes made)
(35,336 real changes made)
(52,285 real changes made)
(12,301 real changes made)
(12,241 real changes made)
(11,938 real changes made)
(11,157 real changes made)

         R1 OTHR PRSN |        spouse
   RELATIONSHIP TO SP |         0          1 |     Total
----------------------+----------------------+----------
                   -8 |         3          0 |         3 
                   -1 |     2,490          0 |     2,490 
    2 SPOUSE/ PARTNER |         0     15,012 |    15,012 
           3 DAUGHTER |    43,043          0 |    43,043 
                4 SON |    42,736          0 |    42,736 
    5 DAUGHTER-IN-LAW |     2,602          0 |     2,602 
         6 SON-IN-LAW |     1,998          0 |     1,998 
       7 STEPDAUGHTER |     4,281          0 |     4,281 
            8 STEPSON |     4,003          0 |     4,003 
             9 SISTER |     7,788          0 |     7,788 
           10 BROTHER |     3,595          0 |     3,595 
     11 SISTER-IN-LAW |     1,500          0 |     1,500 
    12 BROTHER-IN-LAW |       569          0 |       569 
            13 MOTHER |       632          0 |       632 
        14 STEPMOTHER |        26          0 |        26 
     15 MOTHER-IN-LAW |       233          0 |       233 
            16 FATHER |        95          0 |        95 
        17 STEPFATHER |        17          0 |        17 
     18 FATHER-IN-LAW |        80          0 |        80 
     19 GRANDDAUGHTER |     7,813          0 |     7,813 
          20 GRANDSON |     6,713          0 |     6,713 
             21 NIECE |     2,377          0 |     2,377 
            22 NEPHEW |     1,265          0 |     1,265 
              23 AUNT |       266          0 |       266 
             24 UNCLE |        62          0 |        62 
            25 COUSIN |     1,299          0 |     1,299 
26 STEPDAUGHTER'S SON |       206          0 |       206 
27 STEPSON'S SON/ DAU |       151          0 |       151 
28 DAUGHTER-IN-LAW'S  |       485          0 |       485 
29 SON-IN-LAW'S SON/  |       198          0 |       198 
    30 BOARDER/RENTER |        69          0 |        69 
31 PAID AIDE/ HOUSEKE |     4,498          0 |     4,498 
          32 ROOMMATE |       146          0 |       146 
33 EX-WIFE/ EX-HUSBAN |       458          0 |       458 
34 BOYFRIEND/ GIRLFRI |       310          0 |       310 
          35 NEIGHBOR |     1,786          0 |     1,786 
            36 FRIEND |    21,035          0 |    21,035 
37 STAFF PERSON AT TH |     2,924          0 |     2,924 
         38 CO-WORKER |       139          0 |       139 
39 MINISTER, PRIEST,  |     1,086          0 |     1,086 
40 PSYCHIATRIST, PSYC |       270          0 |       270 
                   41 |       418          0 |       418 
    91 OTHER RELATIVE |     3,807          0 |     3,807 
 92 OTHER NONRELATIVE |     8,603          0 |     8,603 
----------------------+----------------------+----------
                Total |   182,075     15,012 |   197,087 


         R1 OTHR PRSN |  Non-spouse relative
   RELATIONSHIP TO SP |         0          1 |     Total
----------------------+----------------------+----------
                   -8 |         3          0 |         3 
                   -1 |     2,490          0 |     2,490 
    2 SPOUSE/ PARTNER |    15,012          0 |    15,012 
           3 DAUGHTER |         0     43,043 |    43,043 
                4 SON |         0     42,736 |    42,736 
    5 DAUGHTER-IN-LAW |         0      2,602 |     2,602 
         6 SON-IN-LAW |         0      1,998 |     1,998 
       7 STEPDAUGHTER |         0      4,281 |     4,281 
            8 STEPSON |         0      4,003 |     4,003 
             9 SISTER |         0      7,788 |     7,788 
           10 BROTHER |         0      3,595 |     3,595 
     11 SISTER-IN-LAW |         0      1,500 |     1,500 
    12 BROTHER-IN-LAW |         0        569 |       569 
            13 MOTHER |         0        632 |       632 
        14 STEPMOTHER |         0         26 |        26 
     15 MOTHER-IN-LAW |         0        233 |       233 
            16 FATHER |         0         95 |        95 
        17 STEPFATHER |         0         17 |        17 
     18 FATHER-IN-LAW |         0         80 |        80 
     19 GRANDDAUGHTER |         0      7,813 |     7,813 
          20 GRANDSON |         0      6,713 |     6,713 
             21 NIECE |         0      2,377 |     2,377 
            22 NEPHEW |         0      1,265 |     1,265 
              23 AUNT |         0        266 |       266 
             24 UNCLE |         0         62 |        62 
            25 COUSIN |         0      1,299 |     1,299 
26 STEPDAUGHTER'S SON |         0        206 |       206 
27 STEPSON'S SON/ DAU |         0        151 |       151 
28 DAUGHTER-IN-LAW'S  |         0        485 |       485 
29 SON-IN-LAW'S SON/  |         0        198 |       198 
    30 BOARDER/RENTER |        69          0 |        69 
31 PAID AIDE/ HOUSEKE |     4,498          0 |     4,498 
          32 ROOMMATE |       146          0 |       146 
33 EX-WIFE/ EX-HUSBAN |       458          0 |       458 
34 BOYFRIEND/ GIRLFRI |       310          0 |       310 
          35 NEIGHBOR |     1,786          0 |     1,786 
            36 FRIEND |    21,035          0 |    21,035 
37 STAFF PERSON AT TH |     2,924          0 |     2,924 
         38 CO-WORKER |       139          0 |       139 
39 MINISTER, PRIEST,  |     1,086          0 |     1,086 
40 PSYCHIATRIST, PSYC |       270          0 |       270 
                   41 |       418          0 |       418 
    91 OTHER RELATIVE |         0      3,807 |     3,807 
 92 OTHER NONRELATIVE |     8,603          0 |     8,603 
----------------------+----------------------+----------
                Total |    59,247    137,840 |   197,087 


         R1 OTHR PRSN |     Non-relative
   RELATIONSHIP TO SP |         0          1 |     Total
----------------------+----------------------+----------
                   -8 |         3          0 |         3 
                   -1 |     2,490          0 |     2,490 
    2 SPOUSE/ PARTNER |    15,012          0 |    15,012 
           3 DAUGHTER |    43,043          0 |    43,043 
                4 SON |    42,736          0 |    42,736 
    5 DAUGHTER-IN-LAW |     2,602          0 |     2,602 
         6 SON-IN-LAW |     1,998          0 |     1,998 
       7 STEPDAUGHTER |     4,281          0 |     4,281 
            8 STEPSON |     4,003          0 |     4,003 
             9 SISTER |     7,788          0 |     7,788 
           10 BROTHER |     3,595          0 |     3,595 
     11 SISTER-IN-LAW |     1,500          0 |     1,500 
    12 BROTHER-IN-LAW |       569          0 |       569 
            13 MOTHER |       632          0 |       632 
        14 STEPMOTHER |        26          0 |        26 
     15 MOTHER-IN-LAW |       233          0 |       233 
            16 FATHER |        95          0 |        95 
        17 STEPFATHER |        17          0 |        17 
     18 FATHER-IN-LAW |        80          0 |        80 
     19 GRANDDAUGHTER |     7,813          0 |     7,813 
          20 GRANDSON |     6,713          0 |     6,713 
             21 NIECE |     2,377          0 |     2,377 
            22 NEPHEW |     1,265          0 |     1,265 
              23 AUNT |       266          0 |       266 
             24 UNCLE |        62          0 |        62 
            25 COUSIN |     1,299          0 |     1,299 
26 STEPDAUGHTER'S SON |       206          0 |       206 
27 STEPSON'S SON/ DAU |       151          0 |       151 
28 DAUGHTER-IN-LAW'S  |       485          0 |       485 
29 SON-IN-LAW'S SON/  |       198          0 |       198 
    30 BOARDER/RENTER |         0         69 |        69 
31 PAID AIDE/ HOUSEKE |         0      4,498 |     4,498 
          32 ROOMMATE |         0        146 |       146 
33 EX-WIFE/ EX-HUSBAN |         0        458 |       458 
34 BOYFRIEND/ GIRLFRI |         0        310 |       310 
          35 NEIGHBOR |         0      1,786 |     1,786 
            36 FRIEND |         0     21,035 |    21,035 
37 STAFF PERSON AT TH |         0      2,924 |     2,924 
         38 CO-WORKER |         0        139 |       139 
39 MINISTER, PRIEST,  |         0      1,086 |     1,086 
40 PSYCHIATRIST, PSYC |         0        270 |       270 
                   41 |         0        418 |       418 
    91 OTHER RELATIVE |     3,807          0 |     3,807 
 92 OTHER NONRELATIVE |         0      8,603 |     8,603 
----------------------+----------------------+----------
                Total |   155,345     41,742 |   197,087 

(51,174 real changes made)
(3,191 real changes made)
(51,174 real changes made)
(33,049 real changes made)
(51,174 real changes made)
(13,584 real changes made)
(10,799 real changes made)
(10,530 real changes made)
(11,720 real changes made)

         R1 OTHR PRSN |        spouse
   RELATIONSHIP TO SP |         0          1 |     Total
----------------------+----------------------+----------
                   -8 |         3          0 |         3 
                   -1 |     3,840          0 |     3,840 
    2 SPOUSE/ PARTNER |         0     18,203 |    18,203 
           3 DAUGHTER |    52,128          0 |    52,128 
                4 SON |    51,775          0 |    51,775 
    5 DAUGHTER-IN-LAW |     3,313          0 |     3,313 
         6 SON-IN-LAW |     2,542          0 |     2,542 
       7 STEPDAUGHTER |     5,284          0 |     5,284 
            8 STEPSON |     4,950          0 |     4,950 
             9 SISTER |    10,095          0 |    10,095 
           10 BROTHER |     4,738          0 |     4,738 
     11 SISTER-IN-LAW |     2,013          0 |     2,013 
    12 BROTHER-IN-LAW |       769          0 |       769 
            13 MOTHER |       799          0 |       799 
        14 STEPMOTHER |        33          0 |        33 
     15 MOTHER-IN-LAW |       299          0 |       299 
            16 FATHER |       129          0 |       129 
        17 STEPFATHER |        20          0 |        20 
     18 FATHER-IN-LAW |       111          0 |       111 
     19 GRANDDAUGHTER |    10,026          0 |    10,026 
          20 GRANDSON |     8,730          0 |     8,730 
             21 NIECE |     3,072          0 |     3,072 
            22 NEPHEW |     1,606          0 |     1,606 
              23 AUNT |       347          0 |       347 
             24 UNCLE |        81          0 |        81 
            25 COUSIN |     1,709          0 |     1,709 
26 STEPDAUGHTER'S SON |       268          0 |       268 
27 STEPSON'S SON/ DAU |       191          0 |       191 
28 DAUGHTER-IN-LAW'S  |       655          0 |       655 
29 SON-IN-LAW'S SON/  |       263          0 |       263 
    30 BOARDER/RENTER |        91          0 |        91 
31 PAID AIDE/ HOUSEKE |     5,792          0 |     5,792 
          32 ROOMMATE |       187          0 |       187 
33 EX-WIFE/ EX-HUSBAN |       578          0 |       578 
34 BOYFRIEND/ GIRLFRI |       400          0 |       400 
          35 NEIGHBOR |     2,460          0 |     2,460 
            36 FRIEND |    28,011          0 |    28,011 
37 STAFF PERSON AT TH |     3,661          0 |     3,661 
         38 CO-WORKER |       193          0 |       193 
39 MINISTER, PRIEST,  |     1,430          0 |     1,430 
40 PSYCHIATRIST, PSYC |       369          0 |       369 
                   41 |       517          0 |       517 
    91 OTHER RELATIVE |     4,943          0 |     4,943 
 92 OTHER NONRELATIVE |    11,637          0 |    11,637 
----------------------+----------------------+----------
                Total |   230,058     18,203 |   248,261 


         R1 OTHR PRSN |  Non-spouse relative
   RELATIONSHIP TO SP |         0          1 |     Total
----------------------+----------------------+----------
                   -8 |         3          0 |         3 
                   -1 |     3,840          0 |     3,840 
    2 SPOUSE/ PARTNER |    18,203          0 |    18,203 
           3 DAUGHTER |         0     52,128 |    52,128 
                4 SON |         0     51,775 |    51,775 
    5 DAUGHTER-IN-LAW |         0      3,313 |     3,313 
         6 SON-IN-LAW |         0      2,542 |     2,542 
       7 STEPDAUGHTER |         0      5,284 |     5,284 
            8 STEPSON |         0      4,950 |     4,950 
             9 SISTER |         0     10,095 |    10,095 
           10 BROTHER |         0      4,738 |     4,738 
     11 SISTER-IN-LAW |         0      2,013 |     2,013 
    12 BROTHER-IN-LAW |         0        769 |       769 
            13 MOTHER |         0        799 |       799 
        14 STEPMOTHER |         0         33 |        33 
     15 MOTHER-IN-LAW |         0        299 |       299 
            16 FATHER |         0        129 |       129 
        17 STEPFATHER |         0         20 |        20 
     18 FATHER-IN-LAW |         0        111 |       111 
     19 GRANDDAUGHTER |         0     10,026 |    10,026 
          20 GRANDSON |         0      8,730 |     8,730 
             21 NIECE |         0      3,072 |     3,072 
            22 NEPHEW |         0      1,606 |     1,606 
              23 AUNT |         0        347 |       347 
             24 UNCLE |         0         81 |        81 
            25 COUSIN |         0      1,709 |     1,709 
26 STEPDAUGHTER'S SON |         0        268 |       268 
27 STEPSON'S SON/ DAU |         0        191 |       191 
28 DAUGHTER-IN-LAW'S  |         0        655 |       655 
29 SON-IN-LAW'S SON/  |         0        263 |       263 
    30 BOARDER/RENTER |        91          0 |        91 
31 PAID AIDE/ HOUSEKE |     5,792          0 |     5,792 
          32 ROOMMATE |       187          0 |       187 
33 EX-WIFE/ EX-HUSBAN |       578          0 |       578 
34 BOYFRIEND/ GIRLFRI |       400          0 |       400 
          35 NEIGHBOR |     2,460          0 |     2,460 
            36 FRIEND |    28,011          0 |    28,011 
37 STAFF PERSON AT TH |     3,661          0 |     3,661 
         38 CO-WORKER |       193          0 |       193 
39 MINISTER, PRIEST,  |     1,430          0 |     1,430 
40 PSYCHIATRIST, PSYC |       369          0 |       369 
                   41 |       517          0 |       517 
    91 OTHER RELATIVE |         0      4,943 |     4,943 
 92 OTHER NONRELATIVE |    11,637          0 |    11,637 
----------------------+----------------------+----------
                Total |    77,372    170,889 |   248,261 


         R1 OTHR PRSN |     Non-relative
   RELATIONSHIP TO SP |         0          1 |     Total
----------------------+----------------------+----------
                   -8 |         3          0 |         3 
                   -1 |     3,840          0 |     3,840 
    2 SPOUSE/ PARTNER |    18,203          0 |    18,203 
           3 DAUGHTER |    52,128          0 |    52,128 
                4 SON |    51,775          0 |    51,775 
    5 DAUGHTER-IN-LAW |     3,313          0 |     3,313 
         6 SON-IN-LAW |     2,542          0 |     2,542 
       7 STEPDAUGHTER |     5,284          0 |     5,284 
            8 STEPSON |     4,950          0 |     4,950 
             9 SISTER |    10,095          0 |    10,095 
           10 BROTHER |     4,738          0 |     4,738 
     11 SISTER-IN-LAW |     2,013          0 |     2,013 
    12 BROTHER-IN-LAW |       769          0 |       769 
            13 MOTHER |       799          0 |       799 
        14 STEPMOTHER |        33          0 |        33 
     15 MOTHER-IN-LAW |       299          0 |       299 
            16 FATHER |       129          0 |       129 
        17 STEPFATHER |        20          0 |        20 
     18 FATHER-IN-LAW |       111          0 |       111 
     19 GRANDDAUGHTER |    10,026          0 |    10,026 
          20 GRANDSON |     8,730          0 |     8,730 
             21 NIECE |     3,072          0 |     3,072 
            22 NEPHEW |     1,606          0 |     1,606 
              23 AUNT |       347          0 |       347 
             24 UNCLE |        81          0 |        81 
            25 COUSIN |     1,709          0 |     1,709 
26 STEPDAUGHTER'S SON |       268          0 |       268 
27 STEPSON'S SON/ DAU |       191          0 |       191 
28 DAUGHTER-IN-LAW'S  |       655          0 |       655 
29 SON-IN-LAW'S SON/  |       263          0 |       263 
    30 BOARDER/RENTER |         0         91 |        91 
31 PAID AIDE/ HOUSEKE |         0      5,792 |     5,792 
          32 ROOMMATE |         0        187 |       187 
33 EX-WIFE/ EX-HUSBAN |         0        578 |       578 
34 BOYFRIEND/ GIRLFRI |         0        400 |       400 
          35 NEIGHBOR |         0      2,460 |     2,460 
            36 FRIEND |         0     28,011 |    28,011 
37 STAFF PERSON AT TH |         0      3,661 |     3,661 
         38 CO-WORKER |         0        193 |       193 
39 MINISTER, PRIEST,  |         0      1,430 |     1,430 
40 PSYCHIATRIST, PSYC |         0        369 |       369 
                   41 |         0        517 |       517 
    91 OTHER RELATIVE |     4,943          0 |     4,943 
 92 OTHER NONRELATIVE |         0     11,637 |    11,637 
----------------------+----------------------+----------
                Total |   192,935     55,326 |   248,261 

(49,065 real changes made)
(2,729 real changes made)
(49,065 real changes made)
(30,636 real changes made)
(49,065 real changes made)
(14,305 real changes made)
(9,504 real changes made)
(9,314 real changes made)
(11,818 real changes made)

         R1 OTHR PRSN |        spouse
   RELATIONSHIP TO SP |         0          1 |     Total
----------------------+----------------------+----------
                   -8 |         3          0 |         3 
                   -1 |     5,235          0 |     5,235 
    2 SPOUSE/ PARTNER |         0     20,932 |    20,932 
           3 DAUGHTER |    60,069          0 |    60,069 
                4 SON |    59,708          0 |    59,708 
    5 DAUGHTER-IN-LAW |     3,999          0 |     3,999 
         6 SON-IN-LAW |     3,071          0 |     3,071 
       7 STEPDAUGHTER |     6,161          0 |     6,161 
            8 STEPSON |     5,802          0 |     5,802 
             9 SISTER |    12,368          0 |    12,368 
           10 BROTHER |     5,888          0 |     5,888 
     11 SISTER-IN-LAW |     2,543          0 |     2,543 
    12 BROTHER-IN-LAW |       967          0 |       967 
            13 MOTHER |       960          0 |       960 
        14 STEPMOTHER |        39          0 |        39 
     15 MOTHER-IN-LAW |       369          0 |       369 
            16 FATHER |       162          0 |       162 
        17 STEPFATHER |        25          0 |        25 
     18 FATHER-IN-LAW |       141          0 |       141 
     19 GRANDDAUGHTER |    12,255          0 |    12,255 
          20 GRANDSON |    10,731          0 |    10,731 
             21 NIECE |     3,788          0 |     3,788 
            22 NEPHEW |     1,961          0 |     1,961 
              23 AUNT |       433          0 |       433 
             24 UNCLE |       103          0 |       103 
            25 COUSIN |     2,163          0 |     2,163 
26 STEPDAUGHTER'S SON |       336          0 |       336 
27 STEPSON'S SON/ DAU |       226          0 |       226 
28 DAUGHTER-IN-LAW'S  |       825          0 |       825 
29 SON-IN-LAW'S SON/  |       329          0 |       329 
    30 BOARDER/RENTER |       109          0 |       109 
31 PAID AIDE/ HOUSEKE |     7,114          0 |     7,114 
          32 ROOMMATE |       240          0 |       240 
33 EX-WIFE/ EX-HUSBAN |       710          0 |       710 
34 BOYFRIEND/ GIRLFRI |       492          0 |       492 
          35 NEIGHBOR |     3,220          0 |     3,220 
            36 FRIEND |    35,308          0 |    35,308 
37 STAFF PERSON AT TH |     4,391          0 |     4,391 
         38 CO-WORKER |       263          0 |       263 
39 MINISTER, PRIEST,  |     1,810          0 |     1,810 
40 PSYCHIATRIST, PSYC |       486          0 |       486 
                   41 |       613          0 |       613 
    91 OTHER RELATIVE |     6,103          0 |     6,103 
 92 OTHER NONRELATIVE |    14,875          0 |    14,875 
----------------------+----------------------+----------
                Total |   276,394     20,932 |   297,326 


         R1 OTHR PRSN |  Non-spouse relative
   RELATIONSHIP TO SP |         0          1 |     Total
----------------------+----------------------+----------
                   -8 |         3          0 |         3 
                   -1 |     5,235          0 |     5,235 
    2 SPOUSE/ PARTNER |    20,932          0 |    20,932 
           3 DAUGHTER |         0     60,069 |    60,069 
                4 SON |         0     59,708 |    59,708 
    5 DAUGHTER-IN-LAW |         0      3,999 |     3,999 
         6 SON-IN-LAW |         0      3,071 |     3,071 
       7 STEPDAUGHTER |         0      6,161 |     6,161 
            8 STEPSON |         0      5,802 |     5,802 
             9 SISTER |         0     12,368 |    12,368 
           10 BROTHER |         0      5,888 |     5,888 
     11 SISTER-IN-LAW |         0      2,543 |     2,543 
    12 BROTHER-IN-LAW |         0        967 |       967 
            13 MOTHER |         0        960 |       960 
        14 STEPMOTHER |         0         39 |        39 
     15 MOTHER-IN-LAW |         0        369 |       369 
            16 FATHER |         0        162 |       162 
        17 STEPFATHER |         0         25 |        25 
     18 FATHER-IN-LAW |         0        141 |       141 
     19 GRANDDAUGHTER |         0     12,255 |    12,255 
          20 GRANDSON |         0     10,731 |    10,731 
             21 NIECE |         0      3,788 |     3,788 
            22 NEPHEW |         0      1,961 |     1,961 
              23 AUNT |         0        433 |       433 
             24 UNCLE |         0        103 |       103 
            25 COUSIN |         0      2,163 |     2,163 
26 STEPDAUGHTER'S SON |         0        336 |       336 
27 STEPSON'S SON/ DAU |         0        226 |       226 
28 DAUGHTER-IN-LAW'S  |         0        825 |       825 
29 SON-IN-LAW'S SON/  |         0        329 |       329 
    30 BOARDER/RENTER |       109          0 |       109 
31 PAID AIDE/ HOUSEKE |     7,114          0 |     7,114 
          32 ROOMMATE |       240          0 |       240 
33 EX-WIFE/ EX-HUSBAN |       710          0 |       710 
34 BOYFRIEND/ GIRLFRI |       492          0 |       492 
          35 NEIGHBOR |     3,220          0 |     3,220 
            36 FRIEND |    35,308          0 |    35,308 
37 STAFF PERSON AT TH |     4,391          0 |     4,391 
         38 CO-WORKER |       263          0 |       263 
39 MINISTER, PRIEST,  |     1,810          0 |     1,810 
40 PSYCHIATRIST, PSYC |       486          0 |       486 
                   41 |       613          0 |       613 
    91 OTHER RELATIVE |         0      6,103 |     6,103 
 92 OTHER NONRELATIVE |    14,875          0 |    14,875 
----------------------+----------------------+----------
                Total |    95,801    201,525 |   297,326 


         R1 OTHR PRSN |     Non-relative
   RELATIONSHIP TO SP |         0          1 |     Total
----------------------+----------------------+----------
                   -8 |         3          0 |         3 
                   -1 |     5,235          0 |     5,235 
    2 SPOUSE/ PARTNER |    20,932          0 |    20,932 
           3 DAUGHTER |    60,069          0 |    60,069 
                4 SON |    59,708          0 |    59,708 
    5 DAUGHTER-IN-LAW |     3,999          0 |     3,999 
         6 SON-IN-LAW |     3,071          0 |     3,071 
       7 STEPDAUGHTER |     6,161          0 |     6,161 
            8 STEPSON |     5,802          0 |     5,802 
             9 SISTER |    12,368          0 |    12,368 
           10 BROTHER |     5,888          0 |     5,888 
     11 SISTER-IN-LAW |     2,543          0 |     2,543 
    12 BROTHER-IN-LAW |       967          0 |       967 
            13 MOTHER |       960          0 |       960 
        14 STEPMOTHER |        39          0 |        39 
     15 MOTHER-IN-LAW |       369          0 |       369 
            16 FATHER |       162          0 |       162 
        17 STEPFATHER |        25          0 |        25 
     18 FATHER-IN-LAW |       141          0 |       141 
     19 GRANDDAUGHTER |    12,255          0 |    12,255 
          20 GRANDSON |    10,731          0 |    10,731 
             21 NIECE |     3,788          0 |     3,788 
            22 NEPHEW |     1,961          0 |     1,961 
              23 AUNT |       433          0 |       433 
             24 UNCLE |       103          0 |       103 
            25 COUSIN |     2,163          0 |     2,163 
26 STEPDAUGHTER'S SON |       336          0 |       336 
27 STEPSON'S SON/ DAU |       226          0 |       226 
28 DAUGHTER-IN-LAW'S  |       825          0 |       825 
29 SON-IN-LAW'S SON/  |       329          0 |       329 
    30 BOARDER/RENTER |         0        109 |       109 
31 PAID AIDE/ HOUSEKE |         0      7,114 |     7,114 
          32 ROOMMATE |         0        240 |       240 
33 EX-WIFE/ EX-HUSBAN |         0        710 |       710 
34 BOYFRIEND/ GIRLFRI |         0        492 |       492 
          35 NEIGHBOR |         0      3,220 |     3,220 
            36 FRIEND |         0     35,308 |    35,308 
37 STAFF PERSON AT TH |         0      4,391 |     4,391 
         38 CO-WORKER |         0        263 |       263 
39 MINISTER, PRIEST,  |         0      1,810 |     1,810 
40 PSYCHIATRIST, PSYC |         0        486 |       486 
                   41 |         0        613 |       613 
    91 OTHER RELATIVE |     6,103          0 |     6,103 
 92 OTHER NONRELATIVE |         0     14,875 |    14,875 
----------------------+----------------------+----------
                Total |   227,695     69,631 |   297,326 


. 
. tab spouse wave, missing

           |                      Survey wave
    spouse |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
         0 |    34,293     34,881     33,305     31,047     48,549 |   276,394 
         1 |     3,804      3,063      2,440      1,969      3,736 |    20,932 
-----------+-------------------------------------------------------+----------
     Total |    38,097     37,944     35,745     33,016     52,285 |   297,326 


           |      Survey wave
    spouse |         6          7 |     Total
-----------+----------------------+----------
         0 |    47,983     46,336 |   276,394 
         1 |     3,191      2,729 |    20,932 
-----------+----------------------+----------
     Total |    51,174     49,065 |   297,326 


. tab otherrel wave, missing

Non-spouse |                      Survey wave
  relative |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
         0 |     8,916     10,674     11,324     11,384     16,949 |    95,801 
         1 |    29,181     27,270     24,421     21,632     35,336 |   201,525 
-----------+-------------------------------------------------------+----------
     Total |    38,097     37,944     35,745     33,016     52,285 |   297,326 


Non-spouse |      Survey wave
  relative |         6          7 |     Total
-----------+----------------------+----------
         0 |    18,125     18,429 |    95,801 
         1 |    33,049     30,636 |   201,525 
-----------+----------------------+----------
     Total |    51,174     49,065 |   297,326 


. tab nonrel wave, missing

Non-relati |                      Survey wave
        ve |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
         0 |    32,985     30,579     27,381     24,416     39,984 |   227,695 
         1 |     5,112      7,365      8,364      8,600     12,301 |    69,631 
-----------+-------------------------------------------------------+----------
     Total |    38,097     37,944     35,745     33,016     52,285 |   297,326 


Non-relati |      Survey wave
        ve |         6          7 |     Total
-----------+----------------------+----------
         0 |    37,590     34,760 |   227,695 
         1 |    13,584     14,305 |    69,631 
-----------+----------------------+----------
     Total |    51,174     49,065 |   297,326 


. 
. ********************************************************************
. //generate variables indicating help w/ adls & iadls
. local adl insd bed eat bath toil dres

. local iadl laun shop meal bank meds 

. local nonadl out money tkpl

. 
. gen tkplhlp=.
(297,326 missing values generated)

. forvalues w=1/$w{
  2. replace tkplhlp=tkplhlp1==1 | tkplhlp2==1 if wave==`w'
  3. }
(38,097 real changes made)
(37,944 real changes made)
(35,745 real changes made)
(33,016 real changes made)
(52,285 real changes made)
(51,174 real changes made)
(49,065 real changes made)

. 
. foreach x in `adl' {
  2.         gen op_adl_`x'=0
  3. }

. foreach x in `iadl' {
  2.         gen op_iadl_`x'=0
  3. }

. foreach x in `nonadl' {
  2.         gen op_nonadl_`x'=0
  3. }

. 
. forvalues w=1/$w {
  2. foreach x in `adl' {
  3.         replace op_adl_`x'=1 if `x'hlp==1 & wave==`w'
  4. }
  5. foreach x in `iadl' {
  6.         replace op_iadl_`x'=1 if `x'hlp==1 & wave==`w'
  7. }
  8. foreach x in `nonadl' {
  9.         replace op_nonadl_`x'=1 if `x'hlp==1 & wave==`w'
 10. }
 11. }
(1,146 real changes made)
(725 real changes made)
(631 real changes made)
(966 real changes made)
(496 real changes made)
(1,220 real changes made)
(3,849 real changes made)
(5,406 real changes made)
(4,857 real changes made)
(3,502 real changes made)
(1,582 real changes made)
(1,734 real changes made)
(1,191 real changes made)
(5,478 real changes made)
(1,408 real changes made)
(1,002 real changes made)
(996 real changes made)
(1,465 real changes made)
(858 real changes made)
(1,533 real changes made)
(3,153 real changes made)
(4,307 real changes made)
(4,104 real changes made)
(2,793 real changes made)
(1,315 real changes made)
(1,825 real changes made)
(910 real changes made)
(4,721 real changes made)
(1,277 real changes made)
(987 real changes made)
(1,020 real changes made)
(1,346 real changes made)
(865 real changes made)
(1,494 real changes made)
(2,597 real changes made)
(3,634 real changes made)
(3,441 real changes made)
(2,312 real changes made)
(1,101 real changes made)
(1,646 real changes made)
(772 real changes made)
(4,050 real changes made)
(1,122 real changes made)
(877 real changes made)
(912 real changes made)
(1,106 real changes made)
(687 real changes made)
(1,312 real changes made)
(2,169 real changes made)
(2,980 real changes made)
(2,885 real changes made)
(1,936 real changes made)
(983 real changes made)
(1,433 real changes made)
(731 real changes made)
(3,396 real changes made)
(1,512 real changes made)
(1,084 real changes made)
(999 real changes made)
(1,382 real changes made)
(783 real changes made)
(1,752 real changes made)
(3,928 real changes made)
(5,554 real changes made)
(5,228 real changes made)
(3,393 real changes made)
(1,619 real changes made)
(2,060 real changes made)
(1,210 real changes made)
(5,623 real changes made)
(1,596 real changes made)
(1,259 real changes made)
(1,116 real changes made)
(1,519 real changes made)
(971 real changes made)
(1,856 real changes made)
(3,436 real changes made)
(4,804 real changes made)
(4,590 real changes made)
(2,883 real changes made)
(1,395 real changes made)
(2,108 real changes made)
(1,036 real changes made)
(5,268 real changes made)
(1,363 real changes made)
(1,067 real changes made)
(1,041 real changes made)
(1,345 real changes made)
(747 real changes made)
(1,595 real changes made)
(2,947 real changes made)
(4,145 real changes made)
(3,983 real changes made)
(2,488 real changes made)
(1,224 real changes made)
(1,733 real changes made)
(908 real changes made)
(4,519 real changes made)

. 
. ********************************************************************
. //generate variables indicating help on a regular schedule
. gen regular=.
(297,326 missing values generated)

. forvalues w=1/$w{
  2. replace regular=0 if wave==`w'
  3. replace regular=1 if helpsched==1 & wave==`w'
  4. }
(38,097 real changes made)
(3,198 real changes made)
(37,944 real changes made)
(2,832 real changes made)
(35,745 real changes made)
(2,077 real changes made)
(33,016 real changes made)
(1,713 real changes made)
(52,285 real changes made)
(2,800 real changes made)
(51,174 real changes made)
(2,637 real changes made)
(49,065 real changes made)
(2,113 real changes made)

. tab regular wave, missing

           |                      Survey wave
   regular |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
         0 |    34,899     35,112     33,668     31,303     49,485 |   279,956 
         1 |     3,198      2,832      2,077      1,713      2,800 |    17,370 
-----------+-------------------------------------------------------+----------
     Total |    38,097     37,944     35,745     33,016     52,285 |   297,326 


           |      Survey wave
   regular |         6          7 |     Total
-----------+----------------------+----------
         0 |    48,537     46,952 |   279,956 
         1 |     2,637      2,113 |    17,370 
-----------+----------------------+----------
     Total |    51,174     49,065 |   297,326 


. 
. la def hrsmth -13"-13:Deceased" -12"-12:Zero days/wk" -11"-11:hours missing" /
> //
>  -10"-10:days missing" -9 "-9:days+hours mssing" -1"-1:NA" 1"1:Valid" 9999"999
> 9:<1hr/day",replace

. la val op_ind_hrsmth hrsmth 

. 
. tab op_ind_hrsmth wave

                     |                 Survey wave
       op_ind_hrsmth |         1          2          3          4 |     Total
---------------------+--------------------------------------------+----------
        -13:Deceased |         0      2,287      2,790      2,516 |    16,231 
    -12:Zero days/wk |         0      1,264      1,024        998 |     9,399 
   -11:hours missing |       253        220        324        237 |     1,886 
    -10:days missing |       103          0          0          0 |       103 
-9:days+hours mssing |       729        372        558        547 |     4,199 
               -1:NA |    26,500     25,833     24,542     23,415 |   211,052 
             1:Valid |     9,206      7,502      6,116      4,921 |    49,937 
       9999:<1hr/day |     1,306        466        391        382 |     4,519 
---------------------+--------------------------------------------+----------
               Total |    38,097     37,944     35,745     33,016 |   297,326 


                     |           Survey wave
       op_ind_hrsmth |         5          6          7 |     Total
---------------------+---------------------------------+----------
        -13:Deceased |     2,118      3,143      3,377 |    16,231 
    -12:Zero days/wk |     2,374      1,878      1,861 |     9,399 
   -11:hours missing |       333        292        227 |     1,886 
    -10:days missing |         0          0          0 |       103 
-9:days+hours mssing |     1,007        543        443 |     4,199 
               -1:NA |    37,743     36,863     36,156 |   211,052 
             1:Valid |     7,975      7,801      6,416 |    49,937 
       9999:<1hr/day |       735        654        585 |     4,519 
---------------------+---------------------------------+----------
               Total |    52,285     51,174     49,065 |   297,326 


. 
. tab op_ind_hrsmth yearnotmonth if wave==1 & opishelper_allw==1

                     |     yearnotmonth
       op_ind_hrsmth |         0          1 |     Total
---------------------+----------------------+----------
   -11:hours missing |       242         11 |       253 
    -10:days missing |        91         12 |       103 
-9:days+hours mssing |       638         91 |       729 
             1:Valid |     8,697        509 |     9,206 
       9999:<1hr/day |     1,072        234 |     1,306 
---------------------+----------------------+----------
               Total |    10,740        857 |    11,597 


. tab op_ind_hrsmth yearnotmonth if wave==2 & opishelper_allw==1

                     |     yearnotmonth
       op_ind_hrsmth |         0          1 |     Total
---------------------+----------------------+----------
    -12:Zero days/wk |       965        299 |     1,264 
   -11:hours missing |       209         11 |       220 
-9:days+hours mssing |       334         38 |       372 
             1:Valid |     7,204        298 |     7,502 
       9999:<1hr/day |       428         38 |       466 
---------------------+----------------------+----------
               Total |     9,140        684 |     9,824 


. 
. tab opishelper_allw

opishelper_ |
       allw |      Freq.     Percent        Cum.
------------+-----------------------------------
         -1 |    227,283       76.44       76.44
          1 |     70,043       23.56      100.00
------------+-----------------------------------
      Total |    297,326      100.00

. 
. //generate indicator of imputation category
. //1=impute, 2=recode to zero, 3=recode to small number hrs/day, 4=no imputatio
> n needed
. gen impute_cat=-1

. 
. //wave=1
.         //1=impute
.         replace impute_cat=1 if inlist(op_ind_hrsmth,-11,-10) | ///
>         (op_ind_hrsmth==-9 & yearnotmonth==0) & ishelper==1 & wave==1
(2,627 real changes made)

.         replace impute_cat=1 if op_ind_hrsmth==9999 & (numdayswk==1 | numdaysm
> n==1) ///
>          & yearnotmonth==0 & ishelper==1 & wave==1
(676 real changes made)

.         //2=recode to zero
.         replace impute_cat=2 if op_ind_hrsmth==-9 & yearnotmonth==1 & ishelper
> ==1 & wave==1
(91 real changes made)

.         replace impute_cat=2 if op_ind_hrsmth==9999 & (numdayswk==1 | numdaysm
> n==1) ///
>         & yearnotmonth==1 & ishelper==1 & wave==1
(212 real changes made)

.         //3=set to small number
.         replace impute_cat=3 if op_ind_hrsmth==9999 & ///
>         (numdayswk~=1 & numdaysmn~=1) & ishelper==1 & wave==1
(418 real changes made)

.         //4=imputation not necessary, complete info
.         replace impute_cat=4 if op_ind_hrsmth==1 & ishelper==1 & wave==1
(9,206 real changes made)

. 
. //if wave==2 | wave==3 | wave == 4
.         //1=impute, wave 2,3 criteria
.         replace impute_cat=1 if inlist(op_ind_hrsmth,-11,-9) & opishelper_allw
> ==1 & inrange(wave,2,$w)
(3,470 real changes made)

.         replace impute_cat=1 if op_ind_hrsmth==-12 & yearnotmonth==0 & opishel
> per_allw==1 & inrange(wave,2,$w)
(6,877 real changes made)

.         //2=recode to zero, wave 2, 3
.         replace impute_cat=2 if op_ind_hrsmth==-12 & yearnotmonth==1 & opishel
> per_allw==1 & inrange(wave,2,$w)
(2,522 real changes made)

.         //3=recode to small number
.         replace impute_cat=3 if op_ind_hrsmth==9999 & opishelper_allw==1 & inr
> ange(wave,2,$w)
(3,213 real changes made)

.         //4=imputation not necessary
.         replace impute_cat=4 if op_ind_hrsmth==1 & opishelper_allw==1 & inrang
> e(wave,2,$w)
(40,731 real changes made)

. 
. la def impute_cat -1"N/A, not helper" 1"Impute" 2"Recode to zero" ///
> 3"Recode to small number" 4"No imputation needed"

. la val impute_cat impute_cat

. tab impute_cat wave, missing

                      |                 Survey wave
           impute_cat |         1          2          3          4 |     Total
----------------------+--------------------------------------------+----------
      N/A, not helper |    26,500     28,120     27,332     25,931 |   227,283 
               Impute |     1,670      1,557      1,596      1,451 |    13,650 
       Recode to zero |       303        299        310        331 |     2,825 
Recode to small numbe |       418        466        391        382 |     3,631 
 No imputation needed |     9,206      7,502      6,116      4,921 |    49,937 
----------------------+--------------------------------------------+----------
                Total |    38,097     37,944     35,745     33,016 |   297,326 


                      |           Survey wave
           impute_cat |         5          6          7 |     Total
----------------------+---------------------------------+----------
      N/A, not helper |    39,861     40,006     39,533 |   227,283 
               Impute |     3,140      2,156      2,080 |    13,650 
       Recode to zero |       574        557        451 |     2,825 
Recode to small numbe |       735        654        585 |     3,631 
 No imputation needed |     7,975      7,801      6,416 |    49,937 
----------------------+---------------------------------+----------
                Total |    52,285     51,174     49,065 |   297,326 


. 
. tab impute_cat op_ind_hrsmth if wave==1, missing

                      |                op_ind_hrsmth
           impute_cat | -11:hours  -10:days   -9:days+h      -1:NA |     Total
----------------------+--------------------------------------------+----------
      N/A, not helper |         0          0          0     26,500 |    26,500 
               Impute |       253        103        638          0 |     1,670 
       Recode to zero |         0          0         91          0 |       303 
Recode to small numbe |         0          0          0          0 |       418 
 No imputation needed |         0          0          0          0 |     9,206 
----------------------+--------------------------------------------+----------
                Total |       253        103        729     26,500 |    38,097 


                      |     op_ind_hrsmth
           impute_cat |   1:Valid  9999:<1hr |     Total
----------------------+----------------------+----------
      N/A, not helper |         0          0 |    26,500 
               Impute |         0        676 |     1,670 
       Recode to zero |         0        212 |       303 
Recode to small numbe |         0        418 |       418 
 No imputation needed |     9,206          0 |     9,206 
----------------------+----------------------+----------
                Total |     9,206      1,306 |    38,097 


. tab impute_cat op_ind_hrsmth if wave==2, missing

                      |                op_ind_hrsmth
           impute_cat | -13:Decea  -12:Zero   -11:hours  -9:days+h |     Total
----------------------+--------------------------------------------+----------
      N/A, not helper |     2,287          0          0          0 |    28,120 
               Impute |         0        965        220        372 |     1,557 
       Recode to zero |         0        299          0          0 |       299 
Recode to small numbe |         0          0          0          0 |       466 
 No imputation needed |         0          0          0          0 |     7,502 
----------------------+--------------------------------------------+----------
                Total |     2,287      1,264        220        372 |    37,944 


                      |          op_ind_hrsmth
           impute_cat |     -1:NA    1:Valid  9999:<1hr |     Total
----------------------+---------------------------------+----------
      N/A, not helper |    25,833          0          0 |    28,120 
               Impute |         0          0          0 |     1,557 
       Recode to zero |         0          0          0 |       299 
Recode to small numbe |         0          0        466 |       466 
 No imputation needed |         0      7,502          0 |     7,502 
----------------------+---------------------------------+----------
                Total |    25,833      7,502        466 |    37,944 


. tab impute_cat op_ind_hrsmth if wave==3, missing

                      |                op_ind_hrsmth
           impute_cat | -13:Decea  -12:Zero   -11:hours  -9:days+h |     Total
----------------------+--------------------------------------------+----------
      N/A, not helper |     2,790          0          0          0 |    27,332 
               Impute |         0        714        324        558 |     1,596 
       Recode to zero |         0        310          0          0 |       310 
Recode to small numbe |         0          0          0          0 |       391 
 No imputation needed |         0          0          0          0 |     6,116 
----------------------+--------------------------------------------+----------
                Total |     2,790      1,024        324        558 |    35,745 


                      |          op_ind_hrsmth
           impute_cat |     -1:NA    1:Valid  9999:<1hr |     Total
----------------------+---------------------------------+----------
      N/A, not helper |    24,542          0          0 |    27,332 
               Impute |         0          0          0 |     1,596 
       Recode to zero |         0          0          0 |       310 
Recode to small numbe |         0          0        391 |       391 
 No imputation needed |         0      6,116          0 |     6,116 
----------------------+---------------------------------+----------
                Total |    24,542      6,116        391 |    35,745 


. tab impute_cat op_ind_hrsmth if wave==4, missing

                      |                op_ind_hrsmth
           impute_cat | -13:Decea  -12:Zero   -11:hours  -9:days+h |     Total
----------------------+--------------------------------------------+----------
      N/A, not helper |     2,516          0          0          0 |    25,931 
               Impute |         0        667        237        547 |     1,451 
       Recode to zero |         0        331          0          0 |       331 
Recode to small numbe |         0          0          0          0 |       382 
 No imputation needed |         0          0          0          0 |     4,921 
----------------------+--------------------------------------------+----------
                Total |     2,516        998        237        547 |    33,016 


                      |          op_ind_hrsmth
           impute_cat |     -1:NA    1:Valid  9999:<1hr |     Total
----------------------+---------------------------------+----------
      N/A, not helper |    23,415          0          0 |    25,931 
               Impute |         0          0          0 |     1,451 
       Recode to zero |         0          0          0 |       331 
Recode to small numbe |         0          0        382 |       382 
 No imputation needed |         0      4,921          0 |     4,921 
----------------------+---------------------------------+----------
                Total |    23,415      4,921        382 |    33,016 


. tab impute_cat op_ind_hrsmth if wave==5, missing

                      |                op_ind_hrsmth
           impute_cat | -13:Decea  -12:Zero   -11:hours  -9:days+h |     Total
----------------------+--------------------------------------------+----------
      N/A, not helper |     2,118          0          0          0 |    39,861 
               Impute |         0      1,800        333      1,007 |     3,140 
       Recode to zero |         0        574          0          0 |       574 
Recode to small numbe |         0          0          0          0 |       735 
 No imputation needed |         0          0          0          0 |     7,975 
----------------------+--------------------------------------------+----------
                Total |     2,118      2,374        333      1,007 |    52,285 


                      |          op_ind_hrsmth
           impute_cat |     -1:NA    1:Valid  9999:<1hr |     Total
----------------------+---------------------------------+----------
      N/A, not helper |    37,743          0          0 |    39,861 
               Impute |         0          0          0 |     3,140 
       Recode to zero |         0          0          0 |       574 
Recode to small numbe |         0          0        735 |       735 
 No imputation needed |         0      7,975          0 |     7,975 
----------------------+---------------------------------+----------
                Total |    37,743      7,975        735 |    52,285 


. tab impute_cat op_ind_hrsmth if wave==6, missing

                      |                op_ind_hrsmth
           impute_cat | -13:Decea  -12:Zero   -11:hours  -9:days+h |     Total
----------------------+--------------------------------------------+----------
      N/A, not helper |     3,143          0          0          0 |    40,006 
               Impute |         0      1,321        292        543 |     2,156 
       Recode to zero |         0        557          0          0 |       557 
Recode to small numbe |         0          0          0          0 |       654 
 No imputation needed |         0          0          0          0 |     7,801 
----------------------+--------------------------------------------+----------
                Total |     3,143      1,878        292        543 |    51,174 


                      |          op_ind_hrsmth
           impute_cat |     -1:NA    1:Valid  9999:<1hr |     Total
----------------------+---------------------------------+----------
      N/A, not helper |    36,863          0          0 |    40,006 
               Impute |         0          0          0 |     2,156 
       Recode to zero |         0          0          0 |       557 
Recode to small numbe |         0          0        654 |       654 
 No imputation needed |         0      7,801          0 |     7,801 
----------------------+---------------------------------+----------
                Total |    36,863      7,801        654 |    51,174 


. tab impute_cat op_ind_hrsmth if wave==7, missing

                      |                op_ind_hrsmth
           impute_cat | -13:Decea  -12:Zero   -11:hours  -9:days+h |     Total
----------------------+--------------------------------------------+----------
      N/A, not helper |     3,377          0          0          0 |    39,533 
               Impute |         0      1,410        227        443 |     2,080 
       Recode to zero |         0        451          0          0 |       451 
Recode to small numbe |         0          0          0          0 |       585 
 No imputation needed |         0          0          0          0 |     6,416 
----------------------+--------------------------------------------+----------
                Total |     3,377      1,861        227        443 |    49,065 


                      |          op_ind_hrsmth
           impute_cat |     -1:NA    1:Valid  9999:<1hr |     Total
----------------------+---------------------------------+----------
      N/A, not helper |    36,156          0          0 |    39,533 
               Impute |         0          0          0 |     2,080 
       Recode to zero |         0          0          0 |       451 
Recode to small numbe |         0          0        585 |       585 
 No imputation needed |         0      6,416          0 |     6,416 
----------------------+---------------------------------+----------
                Total |    36,156      6,416        585 |    49,065 


. 
. ******************************************************************** 
. //save separate datasets for each round so can run imputation with weighting
. forvalues w=1/$w{
  2. preserve  
  3. /*keep op* wave numact yearnotmonth disab anfinwgt0 varstrat varunit ///
>  dresid spid justone spouse otherrel nonrel regular oneact impute_cat son ///
>  daughter oth_fam */
. keep if wave==`w'
  4. save R`w'_for_hrs_impute.dta,replace
  5. restore
  6. }
(259,229 observations deleted)
file R1_for_hrs_impute.dta saved
(259,382 observations deleted)
file R2_for_hrs_impute.dta saved
(261,581 observations deleted)
file R3_for_hrs_impute.dta saved
(264,310 observations deleted)
file R4_for_hrs_impute.dta saved
(245,041 observations deleted)
file R5_for_hrs_impute.dta saved
(246,152 observations deleted)
file R6_for_hrs_impute.dta saved
(248,261 observations deleted)
file R7_for_hrs_impute.dta saved

. */
. ********************************************************************
. //implement matching, do separately for each wave
. forvalues w=1/$w{
  2. use R`w'_for_hrs_impute.dta, clear
  3. 
. svyset varunit [pweight=anfinwgt0], strata(varstrat)
  4. 
. //wave 1 imputation... need to check what is different if anything for wave 2
. gen op_hrsmth_i=0
  5. replace op_hrsmth_i=dhrsmth if impute_cat==4  //use actual value
  6. replace op_hrsmth_i=0 if impute_cat==2 //set to zero
  7. replace op_hrsmth_i=(.5*numdayswk*4.3) if impute_cat==3 & helpsched==1 //as
> sign small hours
  8. replace op_hrsmth_i=(.5*numdaysmn) if impute_cat==3 & inlist(helpsched,2,-7
> ,-8)  //assign small hours
  9. 
. //impute where op_ind_hrsmth=-10, missing days per month
. gen op_numdays_i=0
 10. replace op_numdays_i=numdayswk*4.3 if inlist(impute_cat,3,4) & helpsched==1
 11. replace op_numdays_i=numdaysmn if inlist(impute_cat,3,4) & inlist(helpsched
> ,2,-7,-8)
 12. 
. gen ln_opnumdays_i=ln(op_numdays_i) if inlist(impute_cat,3,4)
 13. 
. local adjvars spouse otherrel regular yearnotmonth oneact disab ///
>  outhlp insdhlp bedhlp tkplhlp1 tkplhlp2 launhlp ///
>  shophlp mealhlp bankhlp eathlp bathhlp toilhlp ///
>  dreshlp medshlp moneyhlp dochlp insurhlp
 14. 
. svy: reg ln_opnumdays_i `adjvars' if inlist(impute_cat,3,4)
 15. predict ln_opnumdays_i2 if impute_cat==1 & op_ind_hrsmth==-10
 16. gen op_numdays_i2=exp(ln_opnumdays_i2) if impute_cat==1 & op_ind_hrsmth==-1
> 0
 17. replace op_hrsmth_i= op_numdays_i2*numhrsday if impute_cat==1 & ///
>  op_ind_hrsmth==-10 & numhrsday>=1
 18. replace op_hrsmth_i= op_numdays_i2*.5 if impute_cat==1 & ///
>  op_ind_hrsmth==-10 & numhrsday==0
 19. 
. //impute where op_ind_hrsmth=-11, missing hours per day
. gen op_numhrsday_i=0
 20. replace op_numhrsday_i=.5 if impute_cat==3
 21. replace op_numhrsday_i=numhrsday if impute_cat==4
 22. gen ln_opnumhrsday_i=ln(op_numhrsday_i) if inlist(impute_cat,3,4)
 23. svy: reg ln_opnumhrsday_i `adjvars' if inlist(impute_cat,3,4)
 24. predict ln_opnumhrsday_i2 if impute_cat==1 & op_ind_hrsmth==-11
 25. gen op_numhrsday_i2=exp(ln_opnumhrsday_i2) if impute_cat==1 & op_ind_hrsmth
> ==-11
 26. replace op_hrsmth_i=numdayswk*4.3*op_numhrsday_i2 if impute_cat==1 & ///
>  op_ind_hrsmth==-11 & helpsched==1
 27. replace op_hrsmth_i=numdaysmn*op_numhrsday_i2 if impute_cat==1 & ///
>  op_ind_hrsmth==-11 & inlist(helpsched,2,-7,-8) & numdaysmn>=1
 28. replace op_hrsmth_i=numdayswk*4.3*op_numhrsday_i2 if impute_cat==1 & ///
>  op_ind_hrsmth==-11 & inlist(helpsched,2,-7,-8) & ///
>  numdaysmn<1 & numdayswk>=1 
 29. 
. //impute where op_ind_hrsmth=-9, -12 or 9999, missing hours and days or <1hr/d
> ay
. gen ln_opdhrsmth_i=ln(op_hrsmth_i) if inlist(impute_cat,3,4)
 30. svy: reg ln_opdhrsmth_i `adjvars' if inlist(impute_cat,3,4)
 31. predict ln_opdhrsmth_i2 if impute_cat==1 & inlist(op_ind_hrsmth,-9,-12,9999
> )
 32. gen op_hrsmth_i2=exp(ln_opdhrsmth_i2) if impute_cat==1 & inlist(op_ind_hrsm
> th,-9,-12,9999)
 33. replace op_hrsmth_i=op_hrsmth_i2 if impute_cat==1 & inlist(op_ind_hrsmth,-9
> ,-12,9999)
 34. replace op_hrsmth_i=-1 if ishelper~=1 
 35. 
. //look at imputed hours per month by imputation category
. di "where op_ind_hrsmth==-12"
 36. capture noisily: mean op_hrsmth_i if impute_cat==1 & op_ind_hrsmth==-12 [pw
> eight=anfinwgt0]
 37. di "where op_ind_hrsmth==-11"
 38. mean op_hrsmth_i if impute_cat==1 & op_ind_hrsmth==-11 [pweight=anfinwgt0]
 39. di "where op_ind_hrsmth==-10"
 40. capture noisily: mean op_hrsmth_i if impute_cat==1 & op_ind_hrsmth==-10 [pw
> eight=anfinwgt0]
 41. di "where op_ind_hrsmth==-9"
 42. mean op_hrsmth_i if impute_cat==1 & op_ind_hrsmth==-9 [pweight=anfinwgt0] 
 43. di "where op_ind_hrsmth==9999"
 44. capture noisily: mean op_hrsmth_i if impute_cat==1 & op_ind_hrsmth==9999 [p
> weight=anfinwgt0] 
 45. 
. di "impute_cat==2"
 46. mean op_hrsmth_i if op_hrsmth_i~=-1 & impute_cat==2 [pweight=anfinwgt0]
 47. di "impute_cat==3"
 48. mean op_hrsmth_i if op_hrsmth_i~=-1 & impute_cat==3 [pweight=anfinwgt0]
 49. di "impute_cat==4"
 50. mean op_hrsmth_i if op_hrsmth_i~=-1 & impute_cat==4 [pweight=anfinwgt0]
 51. 
. save R`w'_hrs_imputed_added.dta,replace
 52. 
. }

      pweight: anfinwgt0
          VCE: linearized
  Single unit: missing
     Strata 1: varstrat
         SU 1: varunit
        FPC 1: <zero>
(9,206 real changes made)
(0 real changes made)
(78 real changes made)
(340 real changes made)
(2,921 real changes made)
(6,703 real changes made)
(28,473 missing values generated)
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =        56                 Number of obs     =       9,624
Number of PSUs     =       112                 Population size   =  41,048,905
                                               Design df         =          56
                                               F(  23,     34)   =      312.37
                                               Prob > F          =      0.0000
                                               R-squared         =      0.4322

------------------------------------------------------------------------------
             |             Linearized
ln_opnumda~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      spouse |   .5381677    .046348    11.61   0.000     .4453214     .631014
    otherrel |    .149535   .0315967     4.73   0.000     .0862391    .2128309
     regular |    .831632   .0285802    29.10   0.000      .774379     .888885
yearnotmonth |  -.3761144   .0607903    -6.19   0.000    -.4978919   -.2543369
      oneact |   -.299946   .0357061    -8.40   0.000    -.3714739   -.2284181
       disab |   .1440928   .0308035     4.68   0.000     .0823859    .2057996
      outhlp |   .0318444   .0472518     0.67   0.503    -.0628123    .1265012
     insdhlp |   .0962042   .0550149     1.75   0.086    -.0140039    .2064122
      bedhlp |  -.0000975   .0536042    -0.00   0.999    -.1074795    .1072846
    tkplhlp1 |   .0670854   .0278496     2.41   0.019     .0112959     .122875
    tkplhlp2 |  -.1540346    .033249    -4.63   0.000    -.2206404   -.0874288
     launhlp |   .3127542   .0325358     9.61   0.000     .2475773    .3779312
     shophlp |   .2160253   .0354635     6.09   0.000     .1449833    .2870673
     mealhlp |   .2672827    .033151     8.06   0.000     .2008732    .3336922
     bankhlp |   .0363355   .0297278     1.22   0.227    -.0232164    .0958874
      eathlp |   .0845216   .0557201     1.52   0.135    -.0270992    .1961423
     bathhlp |    .117602    .044507     2.64   0.011     .0284439    .2067602
     toilhlp |   -.118526   .0724795    -1.64   0.108      -.26372     .026668
     dreshlp |   .1345435   .0455844     2.95   0.005      .043227    .2258601
     medshlp |   .1643136   .0409529     4.01   0.000     .0822751    .2463521
    moneyhlp |   .0345251   .0457505     0.75   0.454    -.0571241    .1261744
      dochlp |    .025386   .0271638     0.93   0.354    -.0290296    .0798016
    insurhlp |   .0194013   .0707617     0.27   0.785    -.1223515    .1611541
       _cons |   1.068917   .0475103    22.50   0.000     .9737425    1.164092
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(37,994 missing values generated)
(37,994 missing values generated)
(63 real changes made)
(40 real changes made)
(418 real changes made)
(9,206 real changes made)
(28,473 missing values generated)
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =        56                 Number of obs     =       9,624
Number of PSUs     =       112                 Population size   =  41,048,905
                                               Design df         =          56
                                               F(  23,     34)   =      100.39
                                               Prob > F          =      0.0000
                                               R-squared         =      0.1837

------------------------------------------------------------------------------
             |             Linearized
ln_opnumhr~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      spouse |   .0564317   .0456012     1.24   0.221    -.0349184    .1477819
    otherrel |   .0624205   .0255773     2.44   0.018     .0111831     .113658
     regular |   .3052847   .0329666     9.26   0.000     .2392447    .3713246
yearnotmonth |   .0200923   .0458621     0.44   0.663    -.0717805    .1119651
      oneact |  -.0130288    .034018    -0.38   0.703     -.081175    .0551174
       disab |     .11202   .0278872     4.02   0.000     .0561553    .1678848
      outhlp |   .0449579   .0330294     1.36   0.179     -.021208    .1111238
     insdhlp |   .1500529    .049026     3.06   0.003      .051842    .2482639
      bedhlp |   .2441647   .0611057     4.00   0.000     .1217552    .3665741
    tkplhlp1 |   .0420772   .0230763     1.82   0.074    -.0041503    .0883046
    tkplhlp2 |   .1003105   .0297705     3.37   0.001      .040673     .159948
     launhlp |   .2755963   .0233343    11.81   0.000      .228852    .3223405
     shophlp |   .0844578   .0284647     2.97   0.004     .0274361    .1414794
     mealhlp |   .0811433   .0264363     3.07   0.003      .028185    .1341015
     bankhlp |    .031007   .0263091     1.18   0.244    -.0216965    .0837106
      eathlp |   .0705038   .0564336     1.25   0.217    -.0425462    .1835539
     bathhlp |    .162383   .0469407     3.46   0.001     .0683495    .2564164
     toilhlp |    .196473   .0776547     2.53   0.014     .0409119    .3520341
     dreshlp |   .0401705   .0448144     0.90   0.374    -.0496035    .1299445
     medshlp |   .2475913   .0339665     7.29   0.000     .1795482    .3156344
    moneyhlp |  -.0775432   .0336455    -2.30   0.025    -.1449433   -.0101431
      dochlp |    .104771   .0308297     3.40   0.001     .0430118    .1665303
    insurhlp |   -.157476   .0649034    -2.43   0.018    -.2874931   -.0274589
       _cons |    .309135   .0444415     6.96   0.000      .220108    .3981621
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(37,844 missing values generated)
(37,844 missing values generated)
(60 real changes made)
(184 real changes made)
(9 real changes made)
(28,473 missing values generated)
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =        56                 Number of obs     =       9,624
Number of PSUs     =       112                 Population size   =  41,048,905
                                               Design df         =          56
                                               F(  23,     34)   =      241.30
                                               Prob > F          =      0.0000
                                               R-squared         =      0.4215

------------------------------------------------------------------------------
             |             Linearized
ln_opdhrsm~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      spouse |    .592771   .0662401     8.95   0.000      .460076    .7254659
    otherrel |   .2109474   .0403331     5.23   0.000     .1301506    .2917442
     regular |   1.136243   .0499583    22.74   0.000     1.036165    1.236322
yearnotmonth |  -.3609958   .0824226    -4.38   0.000    -.5261081   -.1958835
      oneact |  -.3134943   .0538532    -5.82   0.000    -.4213753   -.2056133
       disab |    .257884   .0457061     5.64   0.000     .1663236    .3494444
      outhlp |   .0763884   .0587189     1.30   0.199    -.0412396    .1940165
     insdhlp |   .2464405   .0823616     2.99   0.004     .0814503    .4114306
      bedhlp |   .2449405   .0955761     2.56   0.013     .0534785    .4364024
    tkplhlp1 |   .1095892   .0395119     2.77   0.008     .0304374     .188741
    tkplhlp2 |  -.0534629   .0504937    -1.06   0.294     -.154614    .0476882
     launhlp |   .5889723   .0419012    14.06   0.000     .5050342    .6729104
     shophlp |   .3009816   .0476974     6.31   0.000     .2054323    .3965309
     mealhlp |   .3496706   .0464583     7.53   0.000     .2566034    .4427379
     bankhlp |   .0670473   .0457148     1.47   0.148    -.0245305    .1586251
      eathlp |   .1550192   .0795567     1.95   0.056    -.0043521    .3143905
     bathhlp |   .2811085   .0763989     3.68   0.001     .1280632    .4341538
     toilhlp |   .0776095   .1176533     0.66   0.512    -.1580784    .3132975
     dreshlp |   .1752176   .0612364     2.86   0.006     .0525463    .2978889
     medshlp |   .4126512   .0618707     6.67   0.000     .2887093     .536593
    moneyhlp |  -.0438965   .0609966    -0.72   0.475    -.1660875    .0782945
      dochlp |   .1310672   .0449517     2.92   0.005     .0410181    .2211163
    insurhlp |  -.1385553    .112874    -1.23   0.225    -.3646691    .0875584
       _cons |   1.377777   .0681964    20.20   0.000     1.241164    1.514391
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(36,783 missing values generated)
(36,783 missing values generated)
(1,314 real changes made)
(26,500 real changes made)
where op_ind_hrsmth==-12
no observations
where op_ind_hrsmth==-11

Mean estimation                   Number of obs   =        253

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   45.92267   3.138149      39.74233    52.10301
--------------------------------------------------------------
where op_ind_hrsmth==-10

Mean estimation                   Number of obs   =        103

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   8.574615   .9208114       6.74819    10.40104
--------------------------------------------------------------
where op_ind_hrsmth==-9

Mean estimation                   Number of obs   =        638

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   15.02608   .8305304      13.39517    16.65699
--------------------------------------------------------------
where op_ind_hrsmth==9999

Mean estimation                   Number of obs   =        676

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   13.75598    .830141      12.12601    15.38595
--------------------------------------------------------------
impute_cat==2

Mean estimation                   Number of obs   =        303

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |          0  (omitted)
--------------------------------------------------------------
impute_cat==3

Mean estimation                   Number of obs   =        418

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   6.650921   .3211424      6.019661    7.282181
--------------------------------------------------------------
impute_cat==4

Mean estimation                   Number of obs   =      9,206

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   74.28973   1.837924      70.68699    77.89247
--------------------------------------------------------------
file R1_hrs_imputed_added.dta saved

      pweight: anfinwgt0
          VCE: linearized
  Single unit: missing
     Strata 1: varstrat
         SU 1: varunit
        FPC 1: <zero>
(7,502 real changes made)
(0 real changes made)
(85 real changes made)
(381 real changes made)
(2,495 real changes made)
(5,473 real changes made)
(29,977 missing values generated)
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =        56                 Number of obs     =       7,967
Number of PSUs     =       112                 Population size   =  40,549,774
                                               Design df         =          56
                                               F(  23,     34)   =      273.74
                                               Prob > F          =      0.0000
                                               R-squared         =      0.4854

------------------------------------------------------------------------------
             |             Linearized
ln_opnumda~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      spouse |   .6174003   .0449314    13.74   0.000     .5273919    .7074088
    otherrel |   .1256399   .0281721     4.46   0.000     .0692043    .1820754
     regular |   .7145516   .0301197    23.72   0.000     .6542145    .7748887
yearnotmonth |  -.2759256   .0552299    -5.00   0.000    -.3865644   -.1652868
      oneact |  -.3394039   .0378572    -8.97   0.000    -.4152409   -.2635669
       disab |   .1298073    .028996     4.48   0.000     .0717214    .1878932
      outhlp |   .0566786   .0320764     1.77   0.083    -.0075781    .1209353
     insdhlp |   .1523745   .0481907     3.16   0.003     .0558369    .2489121
      bedhlp |  -.0086655   .0582687    -0.15   0.882    -.1253918    .1080607
    tkplhlp1 |  -.0699267   .0312954    -2.23   0.029    -.1326188   -.0072345
    tkplhlp2 |  -.2135425   .0330085    -6.47   0.000    -.2796664   -.1474186
     launhlp |   .2615633   .0287219     9.11   0.000     .2040263    .3191002
     shophlp |   .2055468   .0308275     6.67   0.000     .1437919    .2673017
     mealhlp |   .3148386   .0384666     8.18   0.000     .2377807    .3918965
     bankhlp |   .0851522   .0300027     2.84   0.006     .0250496    .1452549
      eathlp |   .0944416   .0458509     2.06   0.044     .0025912    .1862921
     bathhlp |   .0401069   .0453527     0.88   0.380    -.0507455    .1309593
     toilhlp |  -.0850442   .0587285    -1.45   0.153    -.2026915    .0326031
     dreshlp |   .0546973   .0418169     1.31   0.196    -.0290721    .1384667
     medshlp |   .1557835   .0377292     4.13   0.000     .0802028    .2313642
    moneyhlp |  -.0564254   .0435809    -1.29   0.201    -.1437285    .0308777
      dochlp |   .0519026   .0246118     2.11   0.039     .0025992    .1012059
    insurhlp |  -.0182814   .0799765    -0.23   0.820    -.1784935    .1419307
       _cons |   1.282439   .0424484    30.21   0.000     1.197405    1.367474
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(37,944 missing values generated)
(37,944 missing values generated)
(0 real changes made)
(0 real changes made)
(466 real changes made)
(7,502 real changes made)
(29,976 missing values generated)
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =        56                 Number of obs     =       7,968
Number of PSUs     =       112                 Population size   =  40,556,183
                                               Design df         =          56
                                               F(  23,     34)   =       51.13
                                               Prob > F          =      0.0000
                                               R-squared         =      0.1809

------------------------------------------------------------------------------
             |             Linearized
ln_opnumhr~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      spouse |  -.0258383   .0490153    -0.53   0.600    -.1240277    .0723511
    otherrel |   .0403781   .0306838     1.32   0.194     -.021089    .1018452
     regular |   .2522105   .0316505     7.97   0.000     .1888069    .3156141
yearnotmonth |  -.0881463   .0522804    -1.69   0.097    -.1928764    .0165839
      oneact |  -.0223245   .0364083    -0.61   0.542     -.095259    .0506101
       disab |   .1084354    .036439     2.98   0.004     .0354394    .1814314
      outhlp |   .0850452   .0402367     2.11   0.039     .0044414    .1656489
     insdhlp |    .098705   .0469085     2.10   0.040      .004736    .1926739
      bedhlp |   .2974317   .0750291     3.96   0.000     .1471303    .4477332
    tkplhlp1 |   .0690091   .0352526     1.96   0.055    -.0016104    .1396286
    tkplhlp2 |   .0532661   .0330387     1.61   0.113    -.0129185    .1194507
     launhlp |   .2870727   .0308763     9.30   0.000     .2252201    .3489254
     shophlp |   .0763197   .0324347     2.35   0.022     .0113452    .1412941
     mealhlp |   .0836207   .0212575     3.93   0.000     .0410369    .1262045
     bankhlp |   .0376569   .0317728     1.19   0.241    -.0259917    .1013054
      eathlp |   .0455212   .0600505     0.76   0.452    -.0747744    .1658167
     bathhlp |  -.0131934   .0594477    -0.22   0.825    -.1322815    .1058947
     toilhlp |   .4056612   .0899065     4.51   0.000     .2255569    .5857656
     dreshlp |   .1041839   .0643222     1.62   0.111     -.024669    .2330367
     medshlp |   .1877458   .0442265     4.25   0.000     .0991495    .2763421
    moneyhlp |  -.0967339   .0355409    -2.72   0.009    -.1679308   -.0255369
      dochlp |   .1360582   .0272687     4.99   0.000     .0814325    .1906839
    insurhlp |  -.0653032   .0677158    -0.96   0.339    -.2009542    .0703479
       _cons |   .3997065   .0472892     8.45   0.000     .3049748    .4944383
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(37,724 missing values generated)
(37,724 missing values generated)
(50 real changes made)
(170 real changes made)
(0 real changes made)
(29,976 missing values generated)
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =        56                 Number of obs     =       7,968
Number of PSUs     =       112                 Population size   =  40,556,183
                                               Design df         =          56
                                               F(  23,     34)   =      178.00
                                               Prob > F          =      0.0000
                                               R-squared         =      0.4504

------------------------------------------------------------------------------
             |             Linearized
ln_opdhrsm~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      spouse |   .5911696   .0755809     7.82   0.000     .4397629    .7425764
    otherrel |   .1652982    .041619     3.97   0.000     .0819253    .2486712
     regular |   .9730144   .0447618    21.74   0.000     .8833458    1.062683
yearnotmonth |  -.3642374   .0818792    -4.45   0.000    -.5282611   -.2002136
      oneact |  -.3623332   .0593025    -6.11   0.000    -.4811303    -.243536
       disab |   .2385008   .0527728     4.52   0.000     .1327841    .3442174
      outhlp |    .140161    .051351     2.73   0.008     .0372926    .2430295
     insdhlp |   .2534953   .0660306     3.84   0.000     .1212201    .3857706
      bedhlp |   .2923894   .0947284     3.09   0.003     .1026257    .4821531
    tkplhlp1 |  -.0014302   .0525153    -0.03   0.978     -.106631    .1037707
    tkplhlp2 |  -.1604523   .0475711    -3.37   0.001    -.2557487    -.065156
     launhlp |   .5482365   .0459304    11.94   0.000     .4562268    .6402462
     shophlp |   .2814609   .0499342     5.64   0.000     .1814307    .3814911
     mealhlp |   .3982719   .0492188     8.09   0.000     .2996748     .496869
     bankhlp |   .1234857   .0466837     2.65   0.011     .0299671    .2170043
      eathlp |   .1429649   .0767003     1.86   0.068    -.0106843    .2966142
     bathhlp |   .0256077   .0799294     0.32   0.750    -.1345101    .1857255
     toilhlp |    .311989   .1246332     2.50   0.015     .0623188    .5616592
     dreshlp |   .1574869   .0843045     1.87   0.067    -.0113954    .3263692
     medshlp |   .3424555   .0622914     5.50   0.000     .2176709    .4672402
    moneyhlp |  -.1531767   .0598071    -2.56   0.013    -.2729847   -.0333686
      dochlp |   .1875215   .0399896     4.69   0.000     .1074126    .2676304
    insurhlp |  -.0834532   .1090395    -0.77   0.447    -.3018856    .1349791
       _cons |   1.683443   .0679383    24.78   0.000     1.547346     1.81954
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(36,607 missing values generated)
(36,607 missing values generated)
(1,337 real changes made)
(28,120 real changes made)
where op_ind_hrsmth==-12

Mean estimation                   Number of obs   =        965

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   15.70768   .7069004      14.32043    17.09492
--------------------------------------------------------------
where op_ind_hrsmth==-11

Mean estimation                   Number of obs   =        220

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |    50.0305   3.211043        43.702      56.359
--------------------------------------------------------------
where op_ind_hrsmth==-10
no observations
where op_ind_hrsmth==-9

Mean estimation                   Number of obs   =        372

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   17.59416   1.127487       15.3771    19.81123
--------------------------------------------------------------
where op_ind_hrsmth==9999
no observations
impute_cat==2

Mean estimation                   Number of obs   =        299

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |          0  (omitted)
--------------------------------------------------------------
impute_cat==3

Mean estimation                   Number of obs   =        466

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   4.002155   .2542403      3.502553    4.501757
--------------------------------------------------------------
impute_cat==4

Mean estimation                   Number of obs   =      7,502

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   73.71425   1.905108       69.9797    77.44879
--------------------------------------------------------------
file R2_hrs_imputed_added.dta saved

      pweight: anfinwgt0
          VCE: linearized
  Single unit: missing
     Strata 1: varstrat
         SU 1: varunit
        FPC 1: <zero>
(6,116 real changes made)
(0 real changes made)
(91 real changes made)
(300 real changes made)
(1,782 real changes made)
(4,725 real changes made)
(29,238 missing values generated)
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =        56                 Number of obs     =       6,507
Number of PSUs     =       112                 Population size   =  39,798,563
                                               Design df         =          56
                                               F(  23,     34)   =      256.91
                                               Prob > F          =      0.0000
                                               R-squared         =      0.5006

------------------------------------------------------------------------------
             |             Linearized
ln_opnumda~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      spouse |   .5474741   .0453293    12.08   0.000     .4566686    .6382796
    otherrel |   .0491816   .0337506     1.46   0.151     -.018429    .1167922
     regular |     .61118   .0314532    19.43   0.000     .5481717    .6741883
yearnotmonth |  -.3755535   .0703048    -5.34   0.000    -.5163909   -.2347162
      oneact |  -.3260701   .0416855    -7.82   0.000    -.4095762    -.242564
       disab |   .0996972    .035542     2.81   0.007     .0284979    .1708965
      outhlp |   .0581599   .0388551     1.50   0.140    -.0196762     .135996
     insdhlp |   .1594248   .0706018     2.26   0.028     .0179925    .3008572
      bedhlp |   .0923095   .0757025     1.22   0.228    -.0593407    .2439598
    tkplhlp1 |  -.0281565   .0305808    -0.92   0.361    -.0894172    .0331041
    tkplhlp2 |  -.2677557   .0414643    -6.46   0.000    -.3508186   -.1846928
     launhlp |   .2809537   .0363668     7.73   0.000     .2081023    .3538052
     shophlp |   .2382679   .0368349     6.47   0.000     .1644787     .312057
     mealhlp |   .3632821   .0370363     9.81   0.000     .2890894    .4374747
     bankhlp |   .0836157   .0319022     2.62   0.011      .019708    .1475234
      eathlp |   .1202538   .0505282     2.38   0.021     .0190336     .221474
     bathhlp |   .0327459   .0552101     0.59   0.555    -.0778532     .143345
     toilhlp |   .0115329   .0717873     0.16   0.873    -.1322742    .1553401
     dreshlp |   .0394282   .0554606     0.71   0.480    -.0716727    .1505292
     medshlp |   .1825903   .0411739     4.43   0.000     .1001091    .2650716
    moneyhlp |  -.0477062   .0420952    -1.13   0.262    -.1320329    .0366205
      dochlp |  -.0017881   .0311737    -0.06   0.954    -.0642365    .0606603
    insurhlp |   .1988462   .0766268     2.59   0.012     .0453442    .3523482
       _cons |   1.387046   .0488214    28.41   0.000     1.289245    1.484847
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(35,745 missing values generated)
(35,745 missing values generated)
(0 real changes made)
(0 real changes made)
(391 real changes made)
(6,116 real changes made)
(29,238 missing values generated)
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =        56                 Number of obs     =       6,507
Number of PSUs     =       112                 Population size   =  39,798,563
                                               Design df         =          56
                                               F(  23,     34)   =       44.01
                                               Prob > F          =      0.0000
                                               R-squared         =      0.1698

------------------------------------------------------------------------------
             |             Linearized
ln_opnumhr~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      spouse |  -.0784601   .0560593    -1.40   0.167    -.1907603    .0338401
    otherrel |   .0587035   .0310527     1.89   0.064    -.0035027    .1209096
     regular |   .1339523   .0445764     3.01   0.004      .044655    .2232495
yearnotmonth |  -.1146862   .0646154    -1.77   0.081    -.2441263    .0147539
      oneact |  -.0291444   .0346617    -0.84   0.404    -.0985801    .0402913
       disab |   .0980952   .0255104     3.85   0.000     .0469917    .1491987
      outhlp |   .0672603   .0430111     1.56   0.124    -.0189013    .1534219
     insdhlp |   .0945743   .0764963     1.24   0.221    -.0586662    .2478148
      bedhlp |   .1516865   .0901682     1.68   0.098    -.0289421    .3323151
    tkplhlp1 |   .0449282   .0303858     1.48   0.145    -.0159418    .1057982
    tkplhlp2 |   .1352021   .0373799     3.62   0.001     .0603212    .2100831
     launhlp |   .3123969   .0285702    10.93   0.000     .2551639    .3696298
     shophlp |   .0578082     .03317     1.74   0.087    -.0086394    .1242558
     mealhlp |   .1269939   .0286869     4.43   0.000     .0695271    .1844606
     bankhlp |    .015884   .0285125     0.56   0.580    -.0412335    .0730015
      eathlp |   .1799637   .0710467     2.53   0.014       .03764    .3222874
     bathhlp |   .1845982   .0650902     2.84   0.006     .0542068    .3149896
     toilhlp |   .3482768   .1180198     2.95   0.005     .1118548    .5846988
     dreshlp |  -.0373171   .0722364    -0.52   0.607     -.182024    .1073897
     medshlp |   .1849502   .0568245     3.25   0.002      .071117    .2987833
    moneyhlp |   .0162145   .0418607     0.39   0.700    -.0676425    .1000715
      dochlp |   .1541263    .031081     4.96   0.000     .0918635     .216389
    insurhlp |  -.0343378   .0799739    -0.43   0.669    -.1945448    .1258691
       _cons |   .4266783   .0464004     9.20   0.000     .3337271    .5196295
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(35,421 missing values generated)
(35,421 missing values generated)
(73 real changes made)
(250 real changes made)
(1 real change made)
(29,238 missing values generated)
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =        56                 Number of obs     =       6,507
Number of PSUs     =       112                 Population size   =  39,798,563
                                               Design df         =          56
                                               F(  23,     34)   =      168.19
                                               Prob > F          =      0.0000
                                               R-squared         =      0.4667

------------------------------------------------------------------------------
             |             Linearized
ln_opdhrsm~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      spouse |   .4699376   .0753008     6.24   0.000      .319092    .6207832
    otherrel |   .1082735   .0500123     2.16   0.035     .0080869    .2084602
     regular |   .7525336   .0562962    13.37   0.000     .6397588    .8653084
yearnotmonth |  -.4907115     .09781    -5.02   0.000    -.6866484   -.2947746
      oneact |  -.3552462   .0590125    -6.02   0.000    -.4734625     -.23703
       disab |   .1973663   .0420152     4.70   0.000     .1131998    .2815328
      outhlp |   .1254505   .0595258     2.11   0.040     .0062059    .2446951
     insdhlp |   .2539254   .1109227     2.29   0.026     .0317205    .4761302
      bedhlp |   .2440014   .1196328     2.04   0.046     .0043482    .4836546
    tkplhlp1 |   .0164508    .045814     0.36   0.721    -.0753257    .1082274
    tkplhlp2 |  -.1322632   .0576009    -2.30   0.025    -.2476517   -.0168747
     launhlp |   .5942119   .0523902    11.34   0.000     .4892617    .6991621
     shophlp |    .296414   .0518385     5.72   0.000      .192569    .4002589
     mealhlp |   .4906347   .0492335     9.97   0.000      .392008    .5892613
     bankhlp |   .0980474   .0458533     2.14   0.037     .0061922    .1899026
      eathlp |   .2999311   .0847334     3.54   0.001     .1301898    .4696725
     bathhlp |   .2172211    .083759     2.59   0.012     .0494318    .3850105
     toilhlp |   .3594674     .13085     2.75   0.008     .0973433    .6215915
     dreshlp |   .0019321   .1051864     0.02   0.985    -.2087817    .2126459
     medshlp |   .3653421   .0782816     4.67   0.000     .2085253    .5221589
    moneyhlp |   -.031489   .0563505    -0.56   0.579    -.1443727    .0813947
      dochlp |   .1542615   .0491478     3.14   0.003     .0558067    .2527164
    insurhlp |   .1643042   .1188624     1.38   0.172    -.0738058    .4024141
       _cons |   1.813121    .078581    23.07   0.000     1.655704    1.970538
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(34,473 missing values generated)
(34,473 missing values generated)
(1,272 real changes made)
(27,332 real changes made)
where op_ind_hrsmth==-12

Mean estimation                   Number of obs   =        714

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   14.64018   .7360239      13.19514    16.08521
--------------------------------------------------------------
where op_ind_hrsmth==-11

Mean estimation                   Number of obs   =        324

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   55.27517   3.055636      49.26371    61.28663
--------------------------------------------------------------
where op_ind_hrsmth==-10
no observations
where op_ind_hrsmth==-9

Mean estimation                   Number of obs   =        558

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   18.73445   1.264598      16.25049    21.21841
--------------------------------------------------------------
where op_ind_hrsmth==9999
no observations
impute_cat==2

Mean estimation                   Number of obs   =        310

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |          0  (omitted)
--------------------------------------------------------------
impute_cat==3

Mean estimation                   Number of obs   =        391

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   5.054444   .3159362      4.433293    5.675596
--------------------------------------------------------------
impute_cat==4

Mean estimation                   Number of obs   =      6,116

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   67.19971    1.88129      63.51172     70.8877
--------------------------------------------------------------
file R3_hrs_imputed_added.dta saved

      pweight: anfinwgt0
          VCE: linearized
  Single unit: missing
     Strata 1: varstrat
         SU 1: varunit
        FPC 1: <zero>
(4,921 real changes made)
(0 real changes made)
(75 real changes made)
(307 real changes made)
(1,451 real changes made)
(3,852 real changes made)
(27,713 missing values generated)
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =        56                 Number of obs     =       5,303
Number of PSUs     =       112                 Population size   =  37,609,074
                                               Design df         =          56
                                               F(  23,     34)   =      170.75
                                               Prob > F          =      0.0000
                                               R-squared         =      0.4720

------------------------------------------------------------------------------
             |             Linearized
ln_opnumda~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      spouse |   .5389448   .0489551    11.01   0.000      .440876    .6370135
    otherrel |    .096415   .0306095     3.15   0.003     .0350968    .1577331
     regular |   .5930351   .0343051    17.29   0.000     .5243137    .6617564
yearnotmonth |  -.1442419   .0828231    -1.74   0.087    -.3101564    .0216727
      oneact |  -.2521449   .0432321    -5.83   0.000    -.3387492   -.1655407
       disab |   .1344615   .0363075     3.70   0.000     .0617289    .2071941
      outhlp |   .0362634   .0455839     0.80   0.430    -.0550521    .1275788
     insdhlp |   .1198898   .0662082     1.81   0.076    -.0127412    .2525209
      bedhlp |   .0289062   .0808411     0.36   0.722    -.1330379    .1908503
    tkplhlp1 |   .0042865    .031816     0.13   0.893    -.0594486    .0680216
    tkplhlp2 |  -.2276146   .0409083    -5.56   0.000    -.3095637   -.1456655
     launhlp |   .3163341   .0408879     7.74   0.000     .2344257    .3982425
     shophlp |   .1972409   .0429879     4.59   0.000     .1111259     .283356
     mealhlp |   .4014343   .0369929    10.85   0.000     .3273286      .47554
     bankhlp |   .1075383   .0410596     2.62   0.011      .025286    .1897906
      eathlp |  -.0028902   .0836913    -0.03   0.973    -.1705441    .1647636
     bathhlp |    .057077   .0657812     0.87   0.389    -.0746985    .1888525
     toilhlp |   .1309503   .0844888     1.55   0.127    -.0383011    .3002016
     dreshlp |   .1287687   .0580887     2.22   0.031     .0124031    .2451342
     medshlp |   .1026022   .0405006     2.53   0.014     .0214697    .1837346
    moneyhlp |   .0180766   .0442788     0.41   0.685    -.0706245    .1067777
      dochlp |   .1073062   .0337808     3.18   0.002     .0396351    .1749773
    insurhlp |  -.0738072   .0732966    -1.01   0.318     -.220638    .0730235
       _cons |   1.264653   .0553879    22.83   0.000     1.153697    1.375608
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(33,016 missing values generated)
(33,016 missing values generated)
(0 real changes made)
(0 real changes made)
(382 real changes made)
(4,921 real changes made)
(27,713 missing values generated)
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =        56                 Number of obs     =       5,303
Number of PSUs     =       112                 Population size   =  37,609,074
                                               Design df         =          56
                                               F(  23,     34)   =       30.96
                                               Prob > F          =      0.0000
                                               R-squared         =      0.2142

------------------------------------------------------------------------------
             |             Linearized
ln_opnumhr~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      spouse |  -.1101905   .0513319    -2.15   0.036    -.2130207   -.0073603
    otherrel |   .1213047   .0408604     2.97   0.004     .0394515     .203158
     regular |   .1838924   .0353226     5.21   0.000     .1131329     .254652
yearnotmonth |   -.155088   .0745429    -2.08   0.042    -.3044153   -.0057607
      oneact |   .0035548   .0421986     0.08   0.933    -.0809791    .0880887
       disab |   .0621988   .0335155     1.86   0.069    -.0049407    .1293383
      outhlp |   .0564042     .03924     1.44   0.156     -.022203    .1350115
     insdhlp |  -.0307943   .0646201    -0.48   0.636    -.1602438    .0986553
      bedhlp |   .2828585   .1059707     2.67   0.010     .0705737    .4951432
    tkplhlp1 |   .0483347    .026793     1.80   0.077    -.0053381    .1020076
    tkplhlp2 |   .1109742   .0356256     3.12   0.003     .0396076    .1823407
     launhlp |    .245514   .0359457     6.83   0.000      .173506    .3175219
     shophlp |   .0617318   .0251383     2.46   0.017     .0113737    .1120899
     mealhlp |   .1495413   .0306292     4.88   0.000     .0881837    .2108989
     bankhlp |    .061585   .0291042     2.12   0.039     .0032823    .1198877
      eathlp |   .1811966   .0728149     2.49   0.016     .0353307    .3270624
     bathhlp |   .0864734   .0920411     0.94   0.352    -.0979072    .2708539
     toilhlp |   .3410338   .1026354     3.32   0.002     .1354304    .5466372
     dreshlp |   .2159683   .0722333     2.99   0.004     .0712676     .360669
     medshlp |   .3249501   .0538953     6.03   0.000     .2169848    .4329153
    moneyhlp |   -.091109   .0443013    -2.06   0.044    -.1798552   -.0023628
      dochlp |   .1375804   .0335154     4.10   0.000      .070441    .2047199
    insurhlp |  -.0311579   .0778298    -0.40   0.690    -.1870697    .1247539
       _cons |   .3555255   .0637591     5.58   0.000     .2278006    .4832504
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(32,779 missing values generated)
(32,779 missing values generated)
(55 real changes made)
(182 real changes made)
(0 real changes made)
(27,713 missing values generated)
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =        56                 Number of obs     =       5,303
Number of PSUs     =       112                 Population size   =  37,609,074
                                               Design df         =          56
                                               F(  23,     34)   =      130.75
                                               Prob > F          =      0.0000
                                               R-squared         =      0.4605

------------------------------------------------------------------------------
             |             Linearized
ln_opdhrsm~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      spouse |    .428818   .0785376     5.46   0.000     .2714883    .5861478
    otherrel |   .2178294   .0561204     3.88   0.000     .1054067    .3302521
     regular |    .783394   .0475008    16.49   0.000     .6882385    .8785495
yearnotmonth |  -.2997251   .1275116    -2.35   0.022    -.5551615   -.0442888
      oneact |  -.2486415   .0624875    -3.98   0.000     -.373819    -.123464
       disab |   .1966733   .0486886     4.04   0.000     .0991382    .2942083
      outhlp |   .0926853   .0634405     1.46   0.150    -.0344013    .2197719
     insdhlp |   .0891692   .0933495     0.96   0.344    -.0978322    .2761706
      bedhlp |   .3116923    .127804     2.44   0.018     .0556701    .5677145
    tkplhlp1 |   .0526695   .0443091     1.19   0.240    -.0360924    .1414314
    tkplhlp2 |  -.1165579   .0555297    -2.10   0.040    -.2277972   -.0053186
     launhlp |    .561951   .0625532     8.98   0.000     .4366419    .6872601
     shophlp |    .259002   .0507931     5.10   0.000     .1572512    .3607527
     mealhlp |   .5510027   .0508254    10.84   0.000     .4491872    .6528183
     bankhlp |   .1690593   .0527261     3.21   0.002     .0634362    .2746824
      eathlp |   .1782567   .1231032     1.45   0.153    -.0683486     .424862
     bathhlp |   .1435325   .1318954     1.09   0.281    -.1206858    .4077508
     toilhlp |    .472151   .1410642     3.35   0.001     .1895654    .7547366
     dreshlp |   .3448332   .1050022     3.28   0.002     .1344884     .555178
     medshlp |   .4276202   .0720038     5.94   0.000     .2833792    .5718612
    moneyhlp |  -.0731165   .0667011    -1.10   0.278    -.2067348    .0605018
      dochlp |   .2448772   .0488731     5.01   0.000     .1469726    .3427817
    insurhlp |  -.1049379   .1200768    -0.87   0.386    -.3454807    .1356049
       _cons |   1.620066   .0872828    18.56   0.000     1.445217    1.794914
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(31,802 missing values generated)
(31,802 missing values generated)
(1,214 real changes made)
(25,931 real changes made)
where op_ind_hrsmth==-12

Mean estimation                   Number of obs   =        667

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   13.75362   .7897666      12.20289    15.30435
--------------------------------------------------------------
where op_ind_hrsmth==-11

Mean estimation                   Number of obs   =        237

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |    45.3443   2.922556      39.58667    51.10193
--------------------------------------------------------------
where op_ind_hrsmth==-10
no observations
where op_ind_hrsmth==-9

Mean estimation                   Number of obs   =        547

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   19.83486   1.407003      17.07106    22.59866
--------------------------------------------------------------
where op_ind_hrsmth==9999
no observations
impute_cat==2

Mean estimation                   Number of obs   =        331

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |          0  (omitted)
--------------------------------------------------------------
impute_cat==3

Mean estimation                   Number of obs   =        382

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   4.280268   .2808654      3.728028    4.832509
--------------------------------------------------------------
impute_cat==4

Mean estimation                   Number of obs   =      4,921

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   65.36183   2.050624       61.3417    69.38197
--------------------------------------------------------------
file R4_hrs_imputed_added.dta saved

      pweight: anfinwgt0
          VCE: linearized
  Single unit: missing
     Strata 1: varstrat
         SU 1: varunit
        FPC 1: <zero>
(7,975 real changes made)
(0 real changes made)
(138 real changes made)
(597 real changes made)
(2,256 real changes made)
(6,454 real changes made)
(43,575 missing values generated)
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =        56                 Number of obs     =       8,710
Number of PSUs     =       112                 Population size   =  41,615,766
                                               Design df         =          56
                                               F(  23,     34)   =      187.57
                                               Prob > F          =      0.0000
                                               R-squared         =      0.4558

------------------------------------------------------------------------------
             |             Linearized
ln_opnumda~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      spouse |   .5901718   .0470392    12.55   0.000     .4959409    .6844026
    otherrel |   .0918411   .0315069     2.91   0.005     .0287252    .1549569
     regular |   .6664401   .0354237    18.81   0.000     .5954779    .7374023
yearnotmonth |  -.3519573   .0707579    -4.97   0.000    -.4937024   -.2102122
      oneact |  -.3246226   .0447085    -7.26   0.000    -.4141846   -.2350606
       disab |   .0858568   .0276459     3.11   0.003     .0304754    .1412382
      outhlp |   .1258303   .0365956     3.44   0.001     .0525205      .19914
     insdhlp |    .171046   .0500358     3.42   0.001     .0708122    .2712798
      bedhlp |  -.0309755   .0601449    -0.52   0.609    -.1514602    .0895093
    tkplhlp1 |  -.0348915   .0309127    -1.13   0.264     -.096817    .0270339
    tkplhlp2 |  -.2182365   .0324091    -6.73   0.000    -.2831598   -.1533133
     launhlp |   .2212987   .0289501     7.64   0.000     .1633048    .2792927
     shophlp |   .1886661   .0386028     4.89   0.000     .1113353    .2659969
     mealhlp |   .3633231   .0386587     9.40   0.000     .2858804    .4407657
     bankhlp |   .0741053   .0331238     2.24   0.029     .0077503    .1404603
      eathlp |  -.0494396   .0531744    -0.93   0.356    -.1559608    .0570816
     bathhlp |   .1375993   .0511825     2.69   0.009     .0350684    .2401303
     toilhlp |   .1010186   .0616165     1.64   0.107    -.0224142    .2244513
     dreshlp |  -.0043073   .0541041    -0.08   0.937    -.1126908    .1040762
     medshlp |   .2167914   .0387892     5.59   0.000     .1390872    .2944956
    moneyhlp |  -.0612134   .0492585    -1.24   0.219    -.1598901    .0374632
      dochlp |   .0747689   .0290065     2.58   0.013      .016662    .1328759
    insurhlp |   .0287134   .0779589     0.37   0.714     -.127457    .1848838
       _cons |   1.294865   .0541537    23.91   0.000     1.186382    1.403348
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(52,285 missing values generated)
(52,285 missing values generated)
(0 real changes made)
(0 real changes made)
(735 real changes made)
(7,975 real changes made)
(43,575 missing values generated)
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =        56                 Number of obs     =       8,710
Number of PSUs     =       112                 Population size   =  41,615,766
                                               Design df         =          56
                                               F(  23,     34)   =       55.46
                                               Prob > F          =      0.0000
                                               R-squared         =      0.1760

------------------------------------------------------------------------------
             |             Linearized
ln_opnumhr~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      spouse |  -.0735505   .0346331    -2.12   0.038    -.1429289   -.0041722
    otherrel |   .1056342   .0292972     3.61   0.001     .0469449    .1643234
     regular |   .1784674   .0342604     5.21   0.000     .1098356    .2470993
yearnotmonth |   .0818495   .0551601     1.48   0.143    -.0286493    .1923484
      oneact |  -.0062206   .0309995    -0.20   0.842    -.0683201    .0558789
       disab |   .0916614   .0336252     2.73   0.009      .024302    .1590207
      outhlp |   .1589277   .0406539     3.91   0.000     .0774882    .2403673
     insdhlp |   .1180209   .0754303     1.56   0.123    -.0330843     .269126
      bedhlp |   .1163501   .0701736     1.66   0.103    -.0242244    .2569246
    tkplhlp1 |   .0610301    .029125     2.10   0.041     .0026857    .1193744
    tkplhlp2 |   .0921225   .0317066     2.91   0.005     .0286066    .1556383
     launhlp |   .3608729   .0320747    11.25   0.000     .2966196    .4251263
     shophlp |   .0894899   .0284236     3.15   0.003     .0325506    .1464291
     mealhlp |   .0941647   .0241793     3.89   0.000     .0457278    .1426016
     bankhlp |   .0576135   .0326715     1.76   0.083    -.0078353    .1230624
      eathlp |   .2546369   .0632041     4.03   0.000     .1280239    .3812499
     bathhlp |   .0965305   .0588548     1.64   0.107    -.0213698    .2144308
     toilhlp |   .2220798   .0779605     2.85   0.006     .0659062    .3782534
     dreshlp |  -.0185309   .0526004    -0.35   0.726    -.1239023    .0868404
     medshlp |   .2399484   .0429303     5.59   0.000     .1539487    .3259482
    moneyhlp |  -.1397465   .0390276    -3.58   0.001    -.2179282   -.0615647
      dochlp |   .0841851   .0281952     2.99   0.004     .0277033    .1406668
    insurhlp |   .0482054   .0735328     0.66   0.515    -.0990984    .1955093
       _cons |    .312669   .0405062     7.72   0.000     .2315253    .3938126
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(51,952 missing values generated)
(51,952 missing values generated)
(74 real changes made)
(259 real changes made)
(0 real changes made)
(43,575 missing values generated)
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =        56                 Number of obs     =       8,710
Number of PSUs     =       112                 Population size   =  41,615,766
                                               Design df         =          56
                                               F(  23,     34)   =      154.06
                                               Prob > F          =      0.0000
                                               R-squared         =      0.4288

------------------------------------------------------------------------------
             |             Linearized
ln_opdhrsm~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      spouse |   .5165689    .066226     7.80   0.000     .3839022    .6492356
    otherrel |   .1975234   .0452049     4.37   0.000      .106967    .2880798
     regular |   .8513224   .0532887    15.98   0.000     .7445723    .9580725
yearnotmonth |  -.2701199   .0979108    -2.76   0.008    -.4662588    -.073981
      oneact |   -.330873   .0554253    -5.97   0.000    -.4419033   -.2198428
       disab |   .1775713    .047168     3.76   0.000     .0830824    .2720602
      outhlp |   .2847804   .0601092     4.74   0.000     .1643673    .4051935
     insdhlp |   .2890824   .0984749     2.94   0.005     .0918134    .4863514
      bedhlp |   .0854399   .0911903     0.94   0.353    -.0972361     .268116
    tkplhlp1 |   .0261897   .0457795     0.57   0.570    -.0655176    .1178971
    tkplhlp2 |  -.1261048    .052533    -2.40   0.020    -.2313411   -.0208685
     launhlp |   .5822857   .0475575    12.24   0.000     .4870165    .6775549
     shophlp |   .2781804    .049924     5.57   0.000     .1781706    .3781903
     mealhlp |   .4575489    .048926     9.35   0.000     .3595384    .5555595
     bankhlp |   .1317121   .0441537     2.98   0.004     .0432617    .2201625
      eathlp |   .2052039   .0836094     2.45   0.017     .0377142    .3726936
     bathhlp |   .2341517   .0851049     2.75   0.008      .063666    .4046374
     toilhlp |   .3231762   .1074926     3.01   0.004     .1078428    .5385097
     dreshlp |  -.0228211   .0892808    -0.26   0.799    -.2016721    .1560298
     medshlp |   .4567322    .056811     8.04   0.000     .3429262    .5705382
    moneyhlp |   -.200997   .0727146    -2.76   0.008    -.3466619   -.0553322
      dochlp |   .1589161     .03945     4.03   0.000     .0798883    .2379439
    insurhlp |   .0770341     .10422     0.74   0.463    -.1317435    .2858118
       _cons |   1.607429   .0788843    20.38   0.000     1.449405    1.765453
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(49,478 missing values generated)
(49,478 missing values generated)
(2,807 real changes made)
(39,861 real changes made)
where op_ind_hrsmth==-12

Mean estimation                   Number of obs   =      1,800

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   16.39445    .550631      15.31451    17.47439
--------------------------------------------------------------
where op_ind_hrsmth==-11

Mean estimation                   Number of obs   =        333

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   47.38086   2.702981      42.06373    52.69799
--------------------------------------------------------------
where op_ind_hrsmth==-10
no observations
where op_ind_hrsmth==-9

Mean estimation                   Number of obs   =      1,007

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   20.63111   1.104936      18.46287    22.79936
--------------------------------------------------------------
where op_ind_hrsmth==9999
no observations
impute_cat==2

Mean estimation                   Number of obs   =        574

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |          0  (omitted)
--------------------------------------------------------------
impute_cat==3

Mean estimation                   Number of obs   =        735

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   4.606265   .2427935      4.129613    5.082918
--------------------------------------------------------------
impute_cat==4

Mean estimation                   Number of obs   =      7,975

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   66.99769   1.720874      63.62433    70.37106
--------------------------------------------------------------
file R5_hrs_imputed_added.dta saved

      pweight: anfinwgt0
          VCE: linearized
  Single unit: missing
     Strata 1: varstrat
         SU 1: varunit
        FPC 1: <zero>
(7,801 real changes made)
(0 real changes made)
(120 real changes made)
(534 real changes made)
(2,188 real changes made)
(6,267 real changes made)
(42,719 missing values generated)
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =        56                 Number of obs     =       8,455
Number of PSUs     =       112                 Population size   =  47,201,947
                                               Design df         =          56
                                               F(  23,     34)   =      277.20
                                               Prob > F          =      0.0000
                                               R-squared         =      0.4739

------------------------------------------------------------------------------
             |             Linearized
ln_opnumda~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      spouse |   .5836988   .0489555    11.92   0.000     .4856292    .6817684
    otherrel |   .0912285   .0330304     2.76   0.008     .0250607    .1573963
     regular |   .6535479   .0265101    24.65   0.000     .6004417     .706654
yearnotmonth |  -.3439878   .0631898    -5.44   0.000    -.4705722   -.2174035
      oneact |  -.2759188   .0351823    -7.84   0.000    -.3463975   -.2054401
       disab |   .0762751   .0361666     2.11   0.039     .0038247    .1487254
      outhlp |   .1324174   .0443849     2.98   0.004     .0435036    .2213311
     insdhlp |   .0510626   .0536515     0.95   0.345    -.0564143    .1585394
      bedhlp |   .0631319   .0665301     0.95   0.347    -.0701439    .1964078
    tkplhlp1 |  -.0497547   .0276406    -1.80   0.077    -.1051255    .0056161
    tkplhlp2 |  -.1681828   .0395341    -4.25   0.000    -.2473792   -.0889864
     launhlp |   .3270084   .0332194     9.84   0.000      .260462    .3935549
     shophlp |   .1905923   .0345738     5.51   0.000     .1213327    .2598519
     mealhlp |   .3534543   .0273488    12.92   0.000      .298668    .4082406
     bankhlp |   .0993146    .035277     2.82   0.007     .0286463     .169983
      eathlp |  -.0359025   .0776719    -0.46   0.646    -.1914981     .119693
     bathhlp |   .1949194   .0482308     4.04   0.000     .0983016    .2915372
     toilhlp |   .0027473   .0697207     0.04   0.969    -.1369201    .1424147
     dreshlp |  -.0097648   .0460138    -0.21   0.833    -.1019417     .082412
     medshlp |   .1743252   .0378033     4.61   0.000     .0985962    .2500542
    moneyhlp |  -.0836059   .0462812    -1.81   0.076    -.1763183    .0091064
      dochlp |   .0796669   .0305901     2.60   0.012     .0183876    .1409463
    insurhlp |  -.0144977   .0999017    -0.15   0.885    -.2146249    .1856295
       _cons |    1.30037   .0608231    21.38   0.000     1.178526    1.422213
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(51,174 missing values generated)
(51,174 missing values generated)
(0 real changes made)
(0 real changes made)
(654 real changes made)
(7,801 real changes made)
(42,719 missing values generated)
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =        56                 Number of obs     =       8,455
Number of PSUs     =       112                 Population size   =  47,201,947
                                               Design df         =          56
                                               F(  23,     34)   =       60.61
                                               Prob > F          =      0.0000
                                               R-squared         =      0.1761

------------------------------------------------------------------------------
             |             Linearized
ln_opnumhr~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      spouse |  -.1299766   .0410499    -3.17   0.002    -.2122095   -.0477437
    otherrel |   .1152326   .0311721     3.70   0.000     .0527874    .1776779
     regular |   .1300361    .029995     4.34   0.000      .069949    .1901233
yearnotmonth |  -.0229723   .0771563    -0.30   0.767     -.177535    .1315905
      oneact |  -.0009082   .0315505    -0.03   0.977    -.0641115    .0622951
       disab |   .0843415   .0310525     2.72   0.009      .022136    .1465471
      outhlp |   .1594653   .0456161     3.50   0.001     .0680851    .2508454
     insdhlp |   -.011275   .0704221    -0.16   0.873    -.1523475    .1297974
      bedhlp |    .098848   .0816599     1.21   0.231    -.0647364    .2624324
    tkplhlp1 |   .0166771   .0258651     0.64   0.522    -.0351369    .0684911
    tkplhlp2 |   .1202365     .03971     3.03   0.004     .0406878    .1997852
     launhlp |   .3086816   .0263869    11.70   0.000     .2558222    .3615409
     shophlp |   .0913675   .0290228     3.15   0.003      .033228    .1495071
     mealhlp |   .0897481   .0286585     3.13   0.003     .0323383    .1471578
     bankhlp |   .0541709   .0263996     2.05   0.045     .0012862    .1070555
      eathlp |   .2667489   .0761807     3.50   0.001     .1141406    .4193572
     bathhlp |   .1730348   .0612966     2.82   0.007      .050243    .2958266
     toilhlp |   .4120504   .0888434     4.64   0.000     .2340757    .5900251
     dreshlp |  -.0012076   .0503741    -0.02   0.981    -.1021192    .0997039
     medshlp |   .1952447   .0451671     4.32   0.000      .104764    .2857253
    moneyhlp |  -.1110495   .0399289    -2.78   0.007    -.1910368   -.0310623
      dochlp |   .1519556   .0307164     4.95   0.000     .0904233    .2134878
    insurhlp |  -.1920495   .0620735    -3.09   0.003    -.3163976   -.0677014
       _cons |   .3512299   .0475262     7.39   0.000     .2560236    .4464363
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(50,882 missing values generated)
(50,882 missing values generated)
(64 real changes made)
(228 real changes made)
(0 real changes made)
(42,719 missing values generated)
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =        56                 Number of obs     =       8,455
Number of PSUs     =       112                 Population size   =  47,201,947
                                               Design df         =          56
                                               F(  23,     34)   =      333.81
                                               Prob > F          =      0.0000
                                               R-squared         =      0.4369

------------------------------------------------------------------------------
             |             Linearized
ln_opdhrsm~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      spouse |   .4536604    .073592     6.16   0.000      .306238    .6010829
    otherrel |   .2065249   .0521263     3.96   0.000     .1021034    .3109464
     regular |    .790101   .0390671    20.22   0.000     .7118402    .8683617
yearnotmonth |  -.3670133   .0976008    -3.76   0.000    -.5625312   -.1714954
      oneact |  -.2768939    .045739    -6.05   0.000    -.3685201   -.1852677
       disab |   .1605451   .0484559     3.31   0.002     .0634761     .257614
      outhlp |   .2920174   .0586137     4.98   0.000     .1746001    .4094347
     insdhlp |   .0397509   .0879909     0.45   0.653     -.136516    .2160179
      bedhlp |   .1619602   .1083996     1.49   0.141    -.0551904    .3791108
    tkplhlp1 |  -.0330361   .0360162    -0.92   0.363    -.1051852     .039113
    tkplhlp2 |  -.0478953   .0601322    -0.80   0.429    -.1683546    .0725641
     launhlp |   .6358293   .0475979    13.36   0.000     .5404793    .7311793
     shophlp |   .2820104   .0514042     5.49   0.000     .1790355    .3849853
     mealhlp |   .4432068   .0406994    10.89   0.000     .3616762    .5247375
     bankhlp |   .1534428     .05023     3.05   0.003       .05282    .2540656
      eathlp |   .2308379   .1271797     1.82   0.075    -.0239336    .4856094
     bathhlp |   .3680337   .0732102     5.03   0.000     .2213761    .5146913
     toilhlp |   .4149913   .1158009     3.58   0.001     .1830141    .6469684
     dreshlp |  -.0109794   .0757266    -0.14   0.885    -.1626781    .1407193
     medshlp |   .3694551   .0514916     7.18   0.000     .2663051    .4726052
    moneyhlp |  -.1946445   .0650765    -2.99   0.004    -.3250084   -.0642806
      dochlp |   .2316588   .0406575     5.70   0.000     .1502121    .3131055
    insurhlp |  -.2065758   .1260639    -1.64   0.107    -.4591122    .0459606
       _cons |    1.65155   .0867992    19.03   0.000      1.47767     1.82543
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(49,310 missing values generated)
(49,310 missing values generated)
(1,864 real changes made)
(40,006 real changes made)
where op_ind_hrsmth==-12

Mean estimation                   Number of obs   =      1,321

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   14.60043   .5986056      13.42611    15.77475
--------------------------------------------------------------
where op_ind_hrsmth==-11

Mean estimation                   Number of obs   =        292

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   51.84578   2.788372      46.35785    57.33371
--------------------------------------------------------------
where op_ind_hrsmth==-10
no observations
where op_ind_hrsmth==-9

Mean estimation                   Number of obs   =        543

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   17.20306   1.063947      15.11309    19.29302
--------------------------------------------------------------
where op_ind_hrsmth==9999
no observations
impute_cat==2

Mean estimation                   Number of obs   =        557

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |          0  (omitted)
--------------------------------------------------------------
impute_cat==3

Mean estimation                   Number of obs   =        654

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   4.459655   .2562381      3.956505    4.962805
--------------------------------------------------------------
impute_cat==4

Mean estimation                   Number of obs   =      7,801

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   58.85084   1.502888      55.90478    61.79691
--------------------------------------------------------------
file R6_hrs_imputed_added.dta saved

      pweight: anfinwgt0
          VCE: linearized
  Single unit: missing
     Strata 1: varstrat
         SU 1: varunit
        FPC 1: <zero>
(6,416 real changes made)
(0 real changes made)
(96 real changes made)
(489 real changes made)
(1,691 real changes made)
(5,310 real changes made)
(42,064 missing values generated)
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =        56                 Number of obs     =       7,001
Number of PSUs     =       112                 Population size   =  42,621,876
                                               Design df         =          56
                                               F(  23,     34)   =      203.57
                                               Prob > F          =      0.0000
                                               R-squared         =      0.4637

------------------------------------------------------------------------------
             |             Linearized
ln_opnumda~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      spouse |   .5635864      .0677     8.32   0.000     .4279671    .6992057
    otherrel |   .0944058   .0455103     2.07   0.043     .0032377    .1855738
     regular |   .6532603   .0338177    19.32   0.000     .5855153    .7210052
yearnotmonth |  -.2002975   .0883732    -2.27   0.027    -.3773303   -.0232647
      oneact |  -.3374989   .0452631    -7.46   0.000    -.4281717   -.2468261
       disab |   .0606519   .0371672     1.63   0.108     -.013803    .1351067
      outhlp |   .0814182    .037698     2.16   0.035        .0059    .1569364
     insdhlp |     .07873   .0588365     1.34   0.186    -.0391337    .1965938
      bedhlp |   .1407346   .0772239     1.82   0.074    -.0139634    .2954327
    tkplhlp1 |  -.0408184   .0352763    -1.16   0.252    -.1114853    .0298485
    tkplhlp2 |  -.1926734   .0444185    -4.34   0.000    -.2816543   -.1036925
     launhlp |   .3361018   .0436721     7.70   0.000      .248616    .4235875
     shophlp |   .1795895   .0403436     4.45   0.000     .0987715    .2604075
     mealhlp |   .3269943   .0485472     6.74   0.000     .2297425     .424246
     bankhlp |   .0927658   .0340907     2.72   0.009     .0244738    .1610578
      eathlp |   .0586936   .0728618     0.81   0.424    -.0872661    .2046533
     bathhlp |   .0551923   .0562128     0.98   0.330    -.0574155    .1678001
     toilhlp |  -.0489541   .0759147    -0.64   0.522    -.2010295    .1031212
     dreshlp |   .0159871   .0691059     0.23   0.818    -.1224487    .1544229
     medshlp |     .16885   .0478504     3.53   0.001      .072994    .2647059
    moneyhlp |  -.0710931   .0587285    -1.21   0.231    -.1887404    .0465542
      dochlp |   .1277126   .0327268     3.90   0.000      .062153    .1932722
    insurhlp |   .0323581   .0762354     0.42   0.673    -.1203598    .1850759
       _cons |   1.316157   .0643241    20.46   0.000     1.187301    1.445014
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(49,065 missing values generated)
(49,065 missing values generated)
(0 real changes made)
(0 real changes made)
(585 real changes made)
(6,416 real changes made)
(42,064 missing values generated)
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =        56                 Number of obs     =       7,001
Number of PSUs     =       112                 Population size   =  42,621,876
                                               Design df         =          56
                                               F(  23,     34)   =       46.25
                                               Prob > F          =      0.0000
                                               R-squared         =      0.1811

------------------------------------------------------------------------------
             |             Linearized
ln_opnumhr~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      spouse |  -.1412467   .0397417    -3.55   0.001     -.220859   -.0616345
    otherrel |   .1216883   .0363924     3.34   0.001     .0487856     .194591
     regular |   .1818337   .0307058     5.92   0.000     .1203225    .2433448
yearnotmonth |  -.1308424   .0829174    -1.58   0.120    -.2969459    .0352612
      oneact |  -.0094406   .0348681    -0.27   0.788    -.0792898    .0604087
       disab |   .0605098   .0350284     1.73   0.090    -.0096606    .1306802
      outhlp |   .1178861   .0420143     2.81   0.007     .0337212    .2020509
     insdhlp |    .079577   .0674427     1.18   0.243     -.055527     .214681
      bedhlp |   .3196724    .082246     3.89   0.000     .1549139    .4844309
    tkplhlp1 |   .0303859   .0267467     1.14   0.261    -.0231941    .0839659
    tkplhlp2 |   .0814235   .0452582     1.80   0.077    -.0092395    .1720866
     launhlp |   .2534391   .0351311     7.21   0.000     .1830631    .3238151
     shophlp |   .0903269   .0309555     2.92   0.005     .0283156    .1523381
     mealhlp |   .0864359   .0257691     3.35   0.001     .0348142    .1380577
     bankhlp |   .0190517   .0230262     0.83   0.412    -.0270753    .0651786
      eathlp |   .2925939   .0790944     3.70   0.000     .1341487    .4510392
     bathhlp |   .0464614   .0688463     0.67   0.503    -.0914542    .1843771
     toilhlp |   .3518386   .0949174     3.71   0.000     .1616962     .541981
     dreshlp |   .0290224   .0647881     0.45   0.656    -.1007639    .1588086
     medshlp |   .2036576   .0408037     4.99   0.000      .121918    .2853972
    moneyhlp |  -.0860206   .0376445    -2.29   0.026    -.1614316   -.0106096
      dochlp |   .1452098   .0312997     4.64   0.000      .082509    .2079107
    insurhlp |  -.1063355   .1012683    -1.05   0.298    -.3092004    .0965294
       _cons |   .3715389   .0556928     6.67   0.000     .2599727    .4831051
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(48,838 missing values generated)
(48,838 missing values generated)
(53 real changes made)
(174 real changes made)
(0 real changes made)
(42,064 missing values generated)
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =        56                 Number of obs     =       7,001
Number of PSUs     =       112                 Population size   =  42,621,876
                                               Design df         =          56
                                               F(  23,     34)   =      135.12
                                               Prob > F          =      0.0000
                                               R-squared         =      0.4244

------------------------------------------------------------------------------
             |             Linearized
ln_opdhrsm~i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      spouse |    .422301   .0798742     5.29   0.000     .2622937    .5823083
    otherrel |   .2161649   .0577889     3.74   0.000     .1003997      .33193
     regular |   .8416063   .0505575    16.65   0.000     .7403275     .942885
yearnotmonth |   -.331217   .1512885    -2.19   0.033    -.6342843   -.0281496
      oneact |  -.3469612   .0610246    -5.69   0.000    -.4692081   -.2247142
       disab |   .1211631   .0563262     2.15   0.036     .0083282    .2339981
      outhlp |   .1992923   .0606639     3.29   0.002     .0777678    .3208167
     insdhlp |   .1583852   .0905469     1.75   0.086     -.023002    .3397723
      bedhlp |   .4604492   .0961189     4.79   0.000        .2679    .6529985
    tkplhlp1 |  -.0103986   .0520314    -0.20   0.842    -.1146299    .0938327
    tkplhlp2 |  -.1111845   .0703968    -1.58   0.120    -.2522062    .0298371
     launhlp |   .5896418   .0656108     8.99   0.000     .4582076    .7210759
     shophlp |   .2699544   .0542224     4.98   0.000     .1613339     .378575
     mealhlp |   .4134476   .0514765     8.03   0.000     .3103278    .5165674
     bankhlp |   .1117541   .0452708     2.47   0.017     .0210657    .2024425
      eathlp |   .3513473   .1136319     3.09   0.003     .1237152    .5789794
     bathhlp |    .101589   .0974473     1.04   0.302    -.0936214    .2967995
     toilhlp |   .3028474   .1325251     2.29   0.026     .0373677    .5683271
     dreshlp |   .0451254   .1120079     0.40   0.689    -.1792534    .2695043
     medshlp |   .3725014   .0651229     5.72   0.000     .2420445    .5029583
    moneyhlp |  -.1571025   .0788491    -1.99   0.051    -.3150561    .0008511
      dochlp |   .2729656   .0511643     5.34   0.000     .1704712      .37546
    insurhlp |  -.0742034   .1438664    -0.52   0.608    -.3624024    .2139956
       _cons |   1.687604   .0902892    18.69   0.000     1.506733    1.868475
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(47,212 missing values generated)
(47,212 missing values generated)
(1,853 real changes made)
(39,533 real changes made)
where op_ind_hrsmth==-12

Mean estimation                   Number of obs   =      1,410

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |    15.1476   .5411432      14.08607    16.20914
--------------------------------------------------------------
where op_ind_hrsmth==-11

Mean estimation                   Number of obs   =        227

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   42.59677   3.262759      36.16745    49.02609
--------------------------------------------------------------
where op_ind_hrsmth==-10
no observations
where op_ind_hrsmth==-9

Mean estimation                   Number of obs   =        443

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   17.85096   1.813534      14.28673    21.41518
--------------------------------------------------------------
where op_ind_hrsmth==9999
no observations
impute_cat==2

Mean estimation                   Number of obs   =        451

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |          0  (omitted)
--------------------------------------------------------------
impute_cat==3

Mean estimation                   Number of obs   =        585

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   4.450013   .2537683      3.951603    4.948423
--------------------------------------------------------------
impute_cat==4

Mean estimation                   Number of obs   =      6,416

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 op_hrsmth_i |   60.22063   1.699959      56.88814    63.55312
--------------------------------------------------------------
file R7_hrs_imputed_added.dta saved

. 
. ********************************************************************
. log close
      name:  <unnamed>
       log:  E:\nhats\nhats_code\NHATS data setup\logs\/1a-help_hours_imputation
> _17_Apr_2019.smcl
  log type:  text
 closed on:  17 Apr 2019, 15:33:08
--------------------------------------------------------------------------------
