--------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\nhats\nhats_code\NHATS data setup\logs2_nhats_cleaning.txt
  log type:  text
 opened on:  25 Mar 2016, 14:48:48

. 
. local work "E:\nhats\data\NHATS working data\"

. //local work /Users/rebeccagorges/Documents/data/nhats/working
. 
. cd "`work'"
E:\nhats\data\NHATS working data

. use round_1_to_4.dta

. *********************************************
. tab wave, missing

Survey wave |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,245       31.89       31.89
          2 |      7,075       27.36       59.25
          3 |      5,799       22.43       81.68
          4 |      4,737       18.32      100.00
------------+-----------------------------------
      Total |     25,856      100.00

. 
. *********************************************
. //interview type, varies by wave, use tracker status variables
. 
. tab r3spstat if wave==3

          R3 SUBJECT PERSON INTRVW STAT |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                               11 Ready |         68        1.17        1.17
                             12 Started |          8        0.14        1.31
                               20 Final |      5,407       93.24       94.55
                        24 Not Required |        316        5.45      100.00
----------------------------------------+-----------------------------------
                                  Total |      5,799      100.00

. tab r3status if wave==3

                 R3 OVERALL CASE STATUS |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                            60 Complete |      4,838       83.43       83.43
               61 Complete, NH facility |        213        3.67       87.10
    62 Complete SP Deceased, Proxy Intv |        523        9.02       96.12
        63 Complete SP, FQ not complete |         46        0.79       96.91
       64 Complete FQ, SP not complete  |        179        3.09      100.00
----------------------------------------+-----------------------------------
                                  Total |      5,799      100.00

. 
. gen ivw_type=3

. replace ivw_type=1 if r1spstat==20 & wave==1 
(7609 real changes made)

. 
. foreach w in 2 3 4{
  2.         replace ivw_type=1 if (r`w'spstat==20 & r`w'status!=62) & wave==`w'
  3.         replace ivw_type=2 if (r`w'spstat==20 & r`w'status==62) & wave==`w'
  4. }
(6056 real changes made)
(503 real changes made)
(4884 real changes made)
(523 real changes made)
(4037 real changes made)
(404 real changes made)

. 
. la def ivw_type 1 "Alive, SP interview completed" 2"Died, proxy SP LML interview completed" ///
>         3"SP interview not completed"

. la val ivw_type ivw_type

. tab ivw_type wave, missing

                      |                 Survey wave
             ivw_type |         1          2          3          4 |     Total
----------------------+--------------------------------------------+----------
Alive, SP interview c |     7,609      6,056      4,884      4,037 |    22,586 
Died, proxy SP LML in |         0        503        523        404 |     1,430 
SP interview not comp |       636        516        392        296 |     1,840 
----------------------+--------------------------------------------+----------
                Total |     8,245      7,075      5,799      4,737 |    25,856 


. 
. tab r1status r1spstat if wave==1, missing

      R1 OVERALL CASE |  R1 SUBJECT PERSON INTRVW STAT
               STATUS |  11 Ready   20 Final  24 Not Re |     Total
----------------------+---------------------------------+----------
          60 Complete |         0      7,550          0 |     7,550 
61 Complete, NH facil |         1          0        467 |       468 
63 Complete SP, FQ no |         0         59          0 |        59 
64 Complete FQ, SP no |       168          0          0 |       168 
----------------------+---------------------------------+----------
                Total |       169      7,609        467 |     8,245 


. tab r1dresid r1spstat if wave==1, missing

R1 D RESIDENTIAL CARE |  R1 SUBJECT PERSON INTRVW STAT
               STATUS |  11 Ready   20 Final  24 Not Re |     Total
----------------------+---------------------------------+----------
         1 Community  |         0      7,197          0 |     7,197 
2 Residential Care Re |         0        412          0 |       412 
3 Residential Care Re |       168          0          0 |       168 
4 Nursing Home Reside |         1          0        467 |       468 
----------------------+---------------------------------+----------
                Total |       169      7,609        467 |     8,245 


. //compare to old code, if r1dresid=1 or 2, then include in homebound paper
. //so use ivw type=1 is the same thing for r1
. 
. gen sp_ivw_yes=1 if r1spstat==20 & wave==1
(18247 missing values generated)

. replace sp_ivw_yes=0 if inlist(r1spstat,11,24) & wave==1
(636 real changes made)

. 
. foreach w in 2 3 4{
  2.         tab r`w'status r`w'spstat if wave==`w', missing
  3.         replace sp_ivw_yes=1 if r`w'spstat==20 & wave==`w'
  4.         replace sp_ivw_yes=0 if inlist(r`w'spstat,11,12,24) & wave==`w'
  5. }

      R2 OVERALL CASE |        R2 SUBJECT PERSON INTRVW STAT
               STATUS |  11 Ready  12 Starte   20 Final  24 Not Re |     Total
----------------------+--------------------------------------------+----------
          60 Complete |         0          0      5,992          0 |     5,992 
61 Complete, NH facil |         0          0          0        326 |       326 
62 Complete SP Deceas |         0          0        503          0 |       503 
63 Complete SP, FQ no |         0          0         64          0 |        64 
64 Complete FQ, SP no |        56          1          0        133 |       190 
----------------------+--------------------------------------------+----------
                Total |        56          1      6,559        459 |     7,075 

(6559 real changes made)
(516 real changes made)

      R3 OVERALL CASE |        R3 SUBJECT PERSON INTRVW STAT
               STATUS |  11 Ready  12 Starte   20 Final  24 Not Re |     Total
----------------------+--------------------------------------------+----------
          60 Complete |         0          0      4,838          0 |     4,838 
61 Complete, NH facil |         0          0          0        213 |       213 
62 Complete SP Deceas |         0          0        523          0 |       523 
63 Complete SP, FQ no |         0          0         46          0 |        46 
64 Complete FQ, SP no |        68          8          0        103 |       179 
----------------------+--------------------------------------------+----------
                Total |        68          8      5,407        316 |     5,799 

(5407 real changes made)
(392 real changes made)

      R4 OVERALL CASE |        R4 SUBJECT PERSON INTRVW STAT
               STATUS |  11 Ready  12 Starte   20 Final  24 Not Re |     Total
----------------------+--------------------------------------------+----------
          60 Complete |         0          0      4,007          0 |     4,007 
61 Complete, NH facil |         0          0          0        140 |       140 
62 Complete SP Deceas |         0          0        404          0 |       404 
63 Complete SP, FQ no |         0          0         30          0 |        30 
64 Complete FQ, SP no |        79          6          0         71 |       156 
----------------------+--------------------------------------------+----------
                Total |        79          6      4,441        211 |     4,737 

(4441 real changes made)
(296 real changes made)

. la var sp_ivw_yes "SP interview conducted? yes=1" //note this includes lml interviews

. tab sp_ivw_yes wave, missing

        SP |
 interview |
conducted? |                 Survey wave
     yes=1 |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |       636        516        392        296 |     1,840 
         1 |     7,609      6,559      5,407      4,441 |    24,016 
-----------+--------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737 |    25,856 


. 
. gen lml_ivw_yes = 0

. foreach w in 2 3 4{
  2.         replace lml_ivw_yes=1 if r`w'spstat==20 & r`w'status==62 & wave==`w'
  3. }
(503 real changes made)
(523 real changes made)
(404 real changes made)

. la var lml_ivw_yes "LWL interview? yes=1"

. 
. tab sp_ivw_yes lml_ivw_yes, missing

        SP |
 interview |
conducted? | LWL interview? yes=1
     yes=1 |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,840          0 |     1,840 
         1 |    22,586      1,430 |    24,016 
-----------+----------------------+----------
     Total |    24,426      1,430 |    25,856 


. tab lml_ivw_yes wave, missing

       LWL |
interview? |                 Survey wave
     yes=1 |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |     8,245      6,572      5,276      4,333 |    24,426 
         1 |         0        503        523        404 |     1,430 
-----------+--------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737 |    25,856 


. 
. tab mo2outoft r2status if wave==2, missing

      R2 MO1 OFTEN GO |                 R2 OVERALL CASE STATUS
              OUTSIDE | 60 Comple  61 Comple  62 Comple  63 Comple  64 Comple |     Total
----------------------+-------------------------------------------------------+----------
           -9 Missing |         0          0          0          0        190 |       190 
                -8 DK |         2          0          8          0          0 |        10 
                -7 RF |         1          0          1          0          0 |         2 
      -1 Inapplicable |         0        326        127          0          0 |       453 
1 EVERY DAY (7 DAYS A |     3,753          0         42         38          0 |     3,833 
2 MOST DAYS (5-6 DAYS |       995          0         43          9          0 |     1,047 
3 SOME DAYS (2-4 DAYS |       743          0         78          9          0 |       830 
4 RARELY (ONCE A WEEK |       371          0         88          5          0 |       464 
              5 NEVER |       127          0        116          3          0 |       246 
----------------------+-------------------------------------------------------+----------
                Total |     5,992        326        503         64        190 |     7,075 


. tab mo3outoft r3status if wave==3, missing

      R3 MO1 OFTEN GO |                 R3 OVERALL CASE STATUS
              OUTSIDE | 60 Comple  61 Comple  62 Comple  63 Comple  64 Comple |     Total
----------------------+-------------------------------------------------------+----------
           -9 Missing |         0          0          0          0        179 |       179 
                -8 DK |         5          0         14          0          0 |        19 
                -7 RF |         1          0          0          0          0 |         1 
      -1 Inapplicable |         0        213        117          0          0 |       330 
1 EVERY DAY (7 DAYS A |     2,971          0         38         20          0 |     3,029 
2 MOST DAYS (5-6 DAYS |       816          0         39         10          0 |       865 
3 SOME DAYS (2-4 DAYS |       630          0         87          8          0 |       725 
4 RARELY (ONCE A WEEK |       314          0        130          5          0 |       449 
              5 NEVER |       101          0         98          3          0 |       202 
----------------------+-------------------------------------------------------+----------
                Total |     4,838        213        523         46        179 |     5,799 


. 
. //identify proxy SP interviews
. gen proxy_ivw=.
(25856 missing values generated)

. foreach w in 1 2 3 4{
  2. replace proxy_ivw=1 if is`w'resptype==2
  3. replace proxy_ivw=0 if is`w'resptype==1
  4. }
(583 real changes made)
(7026 real changes made)
(964 real changes made)
(5595 real changes made)
(897 real changes made)
(4510 real changes made)
(722 real changes made)
(3719 real changes made)

. la var proxy_ivw "Interview via proxy"

. tab proxy_ivw wave, missing

 Interview |                 Survey wave
 via proxy |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |     7,026      5,595      4,510      3,719 |    20,850 
         1 |       583        964        897        722 |     3,166 
         . |       636        516        392        296 |     1,840 
-----------+--------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737 |    25,856 


. tab proxy_ivw wave if ivw_type==1, missing

 Interview |                 Survey wave
 via proxy |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |     7,026      5,595      4,510      3,719 |    20,850 
         1 |       583        461        374        318 |     1,736 
-----------+--------------------------------------------+----------
     Total |     7,609      6,056      4,884      4,037 |    22,586 


. tab proxy_ivw wave if ivw_type==2, missing

 Interview |           Survey wave
 via proxy |         2          3          4 |     Total
-----------+---------------------------------+----------
         1 |       503        523        404 |     1,430 
-----------+---------------------------------+----------
     Total |       503        523        404 |     1,430 


. 
. /*missing data convention per user guide
> For our purposes, code all as missing
> The following codes were used at the item level for missing data of different types:
> -7 = Refusal
> -8 = Don’t Know
> -1 = Inapplicable
> -9 = Not Ascertained*/
. local miss -9,-1

. 
. *********************************************
. *********************************************
. //definitions of homebound
. *********************************************
. *********************************************
. //how often go out of the house?
. gen freq_go_out=.
(25856 missing values generated)

. foreach w in 1 2 3 4{
  2.         tab mo`w'outoft, missing
  3.         replace freq_go_out=mo`w'outoft if wave==`w'
  4. }

        R1 MO1 OFTEN GO OUTSIDE |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                     -9 Missing |        168        0.65        0.65
                          -8 DK |          5        0.02        0.67
                          -7 RF |          1        0.00        0.67
                -1 Inapplicable |        468        1.81        2.48
    1 EVERY DAY (7 DAYS A WEEK) |      4,854       18.77       21.26
  2 MOST DAYS (5-6 DAYS A WEEK) |      1,226        4.74       26.00
  3 SOME DAYS (2-4 DAYS A WEEK) |        962        3.72       29.72
 4 RARELY (ONCE A WEEK OR LESS) |        428        1.66       31.37
                        5 NEVER |        133        0.51       31.89
                              . |     17,611       68.11      100.00
--------------------------------+-----------------------------------
                          Total |     25,856      100.00
(8245 real changes made)

       R2 MO1 OFTEN GO OUTSIDE |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
                    -9 Missing |        190        0.73        0.73
                         -8 DK |         10        0.04        0.77
                         -7 RF |          2        0.01        0.78
               -1 Inapplicable |        453        1.75        2.53
   1 EVERY DAY (7 DAYS A WEEK) |      3,833       14.82       17.36
 2 MOST DAYS (5-6 DAYS A WEEK) |      1,047        4.05       21.41
 3 SOME DAYS (2-4 DAYS A WEEK) |        830        3.21       24.62
4 RARELY (ONCE A WEEK OR LESS) |        464        1.79       26.41
                       5 NEVER |        246        0.95       27.36
                             . |     18,781       72.64      100.00
-------------------------------+-----------------------------------
                         Total |     25,856      100.00
(7075 real changes made)

       R3 MO1 OFTEN GO OUTSIDE |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
                    -9 Missing |        179        0.69        0.69
                         -8 DK |         19        0.07        0.77
                         -7 RF |          1        0.00        0.77
               -1 Inapplicable |        330        1.28        2.05
   1 EVERY DAY (7 DAYS A WEEK) |      3,029       11.71       13.76
 2 MOST DAYS (5-6 DAYS A WEEK) |        865        3.35       17.11
 3 SOME DAYS (2-4 DAYS A WEEK) |        725        2.80       19.91
4 RARELY (ONCE A WEEK OR LESS) |        449        1.74       21.65
                       5 NEVER |        202        0.78       22.43
                             . |     20,057       77.57      100.00
-------------------------------+-----------------------------------
                         Total |     25,856      100.00
(5799 real changes made)

       R4 MO1 OFTEN GO OUTSIDE |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
                    -9 Missing |        156        0.60        0.60
                         -8 DK |          6        0.02        0.63
               -1 Inapplicable |        159        0.61        1.24
   1 EVERY DAY (7 DAYS A WEEK) |      2,423        9.37       10.61
 2 MOST DAYS (5-6 DAYS A WEEK) |        773        2.99       13.60
 3 SOME DAYS (2-4 DAYS A WEEK) |        621        2.40       16.00
4 RARELY (ONCE A WEEK OR LESS) |        369        1.43       17.43
                       5 NEVER |        230        0.89       18.32
                             . |     21,119       81.68      100.00
-------------------------------+-----------------------------------
                         Total |     25,856      100.00
(4737 real changes made)

. 
. replace freq_go_out=. if inlist(freq_go_out,`miss')
(2103 real changes made, 2103 to missing)

. la def freq_go_out 1 "Every day" 2 "Most days (5-6/week)" ///
>         3 "Some days (2-4/week)" 4 "Rarely" 5 "Never"

. la val  freq_go_out freq_go_out

. la var freq_go_out "How often go outside"

. tab freq_go_out sp_ivw_yes, missing

                     |     SP interview
                     |   conducted? yes=1
How often go outside |         0          1 |     Total
---------------------+----------------------+----------
                  -8 |         0         40 |        40 
                  -7 |         0          4 |         4 
           Every day |         0     14,139 |    14,139 
Most days (5-6/week) |         0      3,911 |     3,911 
Some days (2-4/week) |         0      3,138 |     3,138 
              Rarely |         0      1,710 |     1,710 
               Never |         0        811 |       811 
                   . |     1,840        263 |     2,103 
---------------------+----------------------+----------
               Total |     1,840     24,016 |    25,856 


. tab freq_go_out sp_ivw_yes if wave==1, missing

                     |     SP interview
                     |   conducted? yes=1
How often go outside |         0          1 |     Total
---------------------+----------------------+----------
                  -8 |         0          5 |         5 
                  -7 |         0          1 |         1 
           Every day |         0      4,854 |     4,854 
Most days (5-6/week) |         0      1,226 |     1,226 
Some days (2-4/week) |         0        962 |       962 
              Rarely |         0        428 |       428 
               Never |         0        133 |       133 
                   . |       636          0 |       636 
---------------------+----------------------+----------
               Total |       636      7,609 |     8,245 


. tab freq_go_out sp_ivw_yes if wave==2 & lml_ivw_yes==0, missing

                     |     SP interview
                     |   conducted? yes=1
How often go outside |         0          1 |     Total
---------------------+----------------------+----------
                  -8 |         0          2 |         2 
                  -7 |         0          1 |         1 
           Every day |         0      3,791 |     3,791 
Most days (5-6/week) |         0      1,004 |     1,004 
Some days (2-4/week) |         0        752 |       752 
              Rarely |         0        376 |       376 
               Never |         0        130 |       130 
                   . |       516          0 |       516 
---------------------+----------------------+----------
               Total |       516      6,056 |     6,572 


. tab freq_go_out sp_ivw_yes if wave==2 & lml_ivw_yes==1, missing

                     |     SP
                     | interview
                     | conducted?
                     |   yes=1
How often go outside |         1 |     Total
---------------------+-----------+----------
                  -8 |         8 |         8 
                  -7 |         1 |         1 
           Every day |        42 |        42 
Most days (5-6/week) |        43 |        43 
Some days (2-4/week) |        78 |        78 
              Rarely |        88 |        88 
               Never |       116 |       116 
                   . |       127 |       127 
---------------------+-----------+----------
               Total |       503 |       503 


. tab freq_go_out sp_ivw_yes if wave==3 & lml_ivw_yes==0, missing

                     |     SP interview
                     |   conducted? yes=1
How often go outside |         0          1 |     Total
---------------------+----------------------+----------
                  -8 |         0          5 |         5 
                  -7 |         0          1 |         1 
           Every day |         0      2,991 |     2,991 
Most days (5-6/week) |         0        826 |       826 
Some days (2-4/week) |         0        638 |       638 
              Rarely |         0        319 |       319 
               Never |         0        104 |       104 
                   . |       392          0 |       392 
---------------------+----------------------+----------
               Total |       392      4,884 |     5,276 


. 
. 
. //MO questions not asked in lml interviews where persons were not alert(PD6)
. //or not mobile(PD7) in last month so lml has more missingless
. tab freq_go_out mo2outoft if wave==2 & lml_ivw_yes==1, missing

                     |                      R2 MO1 OFTEN GO OUTSIDE
How often go outside |     -8 DK      -7 RF  -1 Inappl  1 EVERY D  2 MOST DA  3 SOME DA |     Total
---------------------+------------------------------------------------------------------+----------
                  -8 |         8          0          0          0          0          0 |         8 
                  -7 |         0          1          0          0          0          0 |         1 
           Every day |         0          0          0         42          0          0 |        42 
Most days (5-6/week) |         0          0          0          0         43          0 |        43 
Some days (2-4/week) |         0          0          0          0          0         78 |        78 
              Rarely |         0          0          0          0          0          0 |        88 
               Never |         0          0          0          0          0          0 |       116 
                   . |         0          0        127          0          0          0 |       127 
---------------------+------------------------------------------------------------------+----------
               Total |         8          1        127         42         43         78 |       503 


                     |    R2 MO1 OFTEN GO
                     |        OUTSIDE
How often go outside | 4 RARELY     5 NEVER |     Total
---------------------+----------------------+----------
                  -8 |         0          0 |         8 
                  -7 |         0          0 |         1 
           Every day |         0          0 |        42 
Most days (5-6/week) |         0          0 |        43 
Some days (2-4/week) |         0          0 |        78 
              Rarely |        88          0 |        88 
               Never |         0        116 |       116 
                   . |         0          0 |       127 
---------------------+----------------------+----------
               Total |        88        116 |       503 


. 
. *********************************************
. //Did anyone ever help you - asked if report going outside
. //left missing if report never go outside
. gen help_go_out=.
(25856 missing values generated)

. foreach w in 1 2 3 4{
  2.         tab mo`w'outhlp, missing
  3.         replace help_go_out=1 if mo`w'outhlp==1
  4.         replace help_go_out=0 if mo`w'outhlp==2
  5.         replace help_go_out=-7 if mo`w'outhlp==-7
  6.         replace help_go_out=-8 if mo`w'outhlp==-8
  7. }

 R1 MO6 HELP GO |
        OUTSIDE |      Freq.     Percent        Cum.
----------------+-----------------------------------
     -9 Missing |        168        0.65        0.65
          -8 DK |          1        0.00        0.65
          -7 RF |          1        0.00        0.66
-1 Inapplicable |        601        2.32        2.98
          1 YES |      1,045        4.04        7.02
           2 NO |      6,429       24.86       31.89
              . |     17,611       68.11      100.00
----------------+-----------------------------------
          Total |     25,856      100.00
(1045 real changes made)
(6429 real changes made)
(1 real change made)
(1 real change made)

       R2 MO6 HELP GO |
              OUTSIDE |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        190        0.73        0.73
                -8 DK |         10        0.04        0.77
                -7 RF |          2        0.01        0.78
      -1 Inapplicable |        699        2.70        3.48
                1 YES |      1,041        4.03        7.51
                 2 NO |      5,133       19.85       27.36
                    . |     18,781       72.64      100.00
----------------------+-----------------------------------
                Total |     25,856      100.00
(1041 real changes made)
(5133 real changes made)
(2 real changes made)
(10 real changes made)

       R3 MO6 HELP GO |
              OUTSIDE |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        179        0.69        0.69
                -8 DK |         17        0.07        0.76
                -7 RF |          1        0.00        0.76
      -1 Inapplicable |        532        2.06        2.82
                1 YES |        948        3.67        6.49
                 2 NO |      4,122       15.94       22.43
                    . |     20,057       77.57      100.00
----------------------+-----------------------------------
                Total |     25,856      100.00
(948 real changes made)
(4122 real changes made)
(1 real change made)
(17 real changes made)

       R4 MO6 HELP GO |
              OUTSIDE |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        156        0.60        0.60
                -8 DK |         10        0.04        0.64
      -1 Inapplicable |        389        1.50        2.15
                1 YES |        798        3.09        5.23
                 2 NO |      3,384       13.09       18.32
                    . |     21,119       81.68      100.00
----------------------+-----------------------------------
                Total |     25,856      100.00
(798 real changes made)
(3384 real changes made)
(0 real changes made)
(10 real changes made)

. la var help_go_out "Anyone ever help you leave home?"

. tab help_go_out wave if sp_ivw_yes==1, missing

    Anyone |
 ever help |
 you leave |                 Survey wave
     home? |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
        -8 |         1         10         17         10 |        38 
        -7 |         1          2          1          0 |         4 
         0 |     6,429      5,133      4,122      3,384 |    19,068 
         1 |     1,045      1,041        948        798 |     3,832 
         . |       133        373        319        249 |     1,074 
-----------+--------------------------------------------+----------
     Total |     7,609      6,559      5,407      4,441 |    24,016 


. 
. *********************************************
. //go out of the house on own?
. //only asked if report having help when go outside (help_go_out==1)
. gen out_on_own=.
(25856 missing values generated)

. foreach w in 1 2 3 4{
  2.         tab mo`w'outslf help_go_out if wave==`w', missing
  3.         replace out_on_own=mo`w'outslf if wave==`w'
  4. }

 R1 MO7 LEFT BY |            Anyone ever help you leave home?
       YOURSELF |        -8         -7          0          1          . |     Total
----------------+-------------------------------------------------------+----------
     -9 Missing |         0          0          0          0        168 |       168 
-1 Inapplicable |         1          1      6,429          0        601 |     7,032 
   1 MOST TIMES |         0          0          0        184          0 |       184 
    2 SOMETIMES |         0          0          0        167          0 |       167 
       3 RARELY |         0          0          0        118          0 |       118 
        4 NEVER |         0          0          0        576          0 |       576 
----------------+-------------------------------------------------------+----------
          Total |         1          1      6,429      1,045        769 |     8,245 

(8245 real changes made)

 R2 MO7 LEFT BY |            Anyone ever help you leave home?
       YOURSELF |        -8         -7          0          1          . |     Total
----------------+-------------------------------------------------------+----------
     -9 Missing |         0          0          0          0        190 |       190 
-1 Inapplicable |        10          2      5,133        180        699 |     6,024 
   1 MOST TIMES |         0          0          0        160          0 |       160 
    2 SOMETIMES |         0          0          0        118          0 |       118 
       3 RARELY |         0          0          0        106          0 |       106 
        4 NEVER |         0          0          0        477          0 |       477 
----------------+-------------------------------------------------------+----------
          Total |        10          2      5,133      1,041        889 |     7,075 

(7075 real changes made)

 R3 MO7 LEFT BY |            Anyone ever help you leave home?
       YOURSELF |        -8         -7          0          1          . |     Total
----------------+-------------------------------------------------------+----------
     -9 Missing |         0          0          0          0        179 |       179 
-1 Inapplicable |        17          1      4,122        211        532 |     4,883 
   1 MOST TIMES |         0          0          0        112          0 |       112 
    2 SOMETIMES |         0          0          0        100          0 |       100 
       3 RARELY |         0          0          0         82          0 |        82 
        4 NEVER |         0          0          0        443          0 |       443 
----------------+-------------------------------------------------------+----------
          Total |        17          1      4,122        948        711 |     5,799 

(5799 real changes made)

 R4 MO7 LEFT BY |      Anyone ever help you leave home?
       YOURSELF |        -8          0          1          . |     Total
----------------+--------------------------------------------+----------
     -9 Missing |         0          0          0        156 |       156 
-1 Inapplicable |        10      3,384        176        389 |     3,959 
   1 MOST TIMES |         0          0         98          0 |        98 
    2 SOMETIMES |         0          0         83          0 |        83 
       3 RARELY |         0          0         71          0 |        71 
        4 NEVER |         0          0        370          0 |       370 
----------------+--------------------------------------------+----------
          Total |        10      3,384        798        545 |     4,737 

(4737 real changes made)

. replace out_on_own=. if inlist(out_on_own,`miss')
(22591 real changes made, 22591 to missing)

. replace out_on_own=5 if help_go_out==0
(19068 real changes made)

. replace out_on_own=6 if freq_go_out==5
(811 real changes made)

. la def out_on_own 1"Most times" 2"Sometimes" 3"Rarely" 4"Never"5"NA, reported no help" ///
> 6"NA, never left home"

. la val out_on_own out_on_own

. la var out_on_own "When left house, left by yourself?"

. tab out_on_own wave if sp_ivw_yes==1, missing

    When left house, |                 Survey wave
   left by yourself? |         1          2          3          4 |     Total
---------------------+--------------------------------------------+----------
          Most times |       184        160        112         98 |       554 
           Sometimes |       167        118        100         83 |       468 
              Rarely |       118        106         82         71 |       377 
               Never |       576        477        443        370 |     1,866 
NA, reported no help |     6,429      5,133      4,122      3,384 |    19,068 
 NA, never left home |       133        246        202        230 |       811 
                   . |         2        319        346        205 |       872 
---------------------+--------------------------------------------+----------
               Total |     7,609      6,559      5,407      4,441 |    24,016 


. 
. *********************************************
. //needs help when go outside? gets help and also goes outside on own != never
. gen needshelp=0

. replace needshelp=1 if help_go_out==1& out_on_own~=4
(1966 real changes made)

. la var needshelp "Leaves home but with help"

. tab needshelp wave, missing

    Leaves |
  home but |                 Survey wave
 with help |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |     7,776      6,511      5,294      4,309 |    23,890 
         1 |       469        564        505        428 |     1,966 
-----------+--------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737 |    25,856 


. 
. *********************************************
. //has difficulty? when you used your walker,cane,etc? how much difficulty
. //did you have leaving the house by yourself? 1=none, 2=a little, 3=some, 4=a lot
. //inapplicable if don't report using any device to help, so set to 0 here
. gen hasdifficulty=0

. foreach w in 1 2 3 4{
  2.         tab mo`w'outdif if wave==`w', missing
  3.         replace hasdifficulty=1 if inlist(mo`w'outdif,2,3,4)
  4.         replace hasdifficulty=0 if mo`w'outdif==1
  5.         replace hasdifficulty=-7 if  mo`w'outdif==-7
  6.         replace hasdifficulty=-8 if  mo`w'outdif==-8
  7. 
. }

     R1 MO8 HOW |
      DIFFICULT |      Freq.     Percent        Cum.
----------------+-----------------------------------
     -9 Missing |        168        2.04        2.04
          -8 DK |          2        0.02        2.06
          -7 RF |          2        0.02        2.09
-1 Inapplicable |      1,177       14.28       16.36
         1 NONE |      5,929       71.91       88.27
     2 A LITTLE |        540        6.55       94.82
         3 SOME |        295        3.58       98.40
        4 A LOT |        132        1.60      100.00
----------------+-----------------------------------
          Total |      8,245      100.00
(967 real changes made)
(0 real changes made)
(2 real changes made)
(2 real changes made)

     R2 MO8 HOW |
      DIFFICULT |      Freq.     Percent        Cum.
----------------+-----------------------------------
     -9 Missing |        190        2.69        2.69
          -8 DK |          7        0.10        2.78
          -7 RF |          2        0.03        2.81
-1 Inapplicable |      1,436       20.30       23.11
         1 NONE |      4,679       66.13       89.24
     2 A LITTLE |        468        6.61       95.86
         3 SOME |        209        2.95       98.81
        4 A LOT |         84        1.19      100.00
----------------+-----------------------------------
          Total |      7,075      100.00
(761 real changes made)
(0 real changes made)
(2 real changes made)
(7 real changes made)

     R3 MO8 HOW |
      DIFFICULT |      Freq.     Percent        Cum.
----------------+-----------------------------------
     -9 Missing |        179        3.09        3.09
          -8 DK |          3        0.05        3.14
          -7 RF |          1        0.02        3.16
-1 Inapplicable |      1,283       22.12       25.28
         1 NONE |      3,767       64.96       90.24
     2 A LITTLE |        335        5.78       96.02
         3 SOME |        170        2.93       98.95
        4 A LOT |         61        1.05      100.00
----------------+-----------------------------------
          Total |      5,799      100.00
(566 real changes made)
(0 real changes made)
(1 real change made)
(3 real changes made)

     R4 MO8 HOW |
      DIFFICULT |      Freq.     Percent        Cum.
----------------+-----------------------------------
     -9 Missing |        156        3.29        3.29
          -8 DK |          3        0.06        3.36
-1 Inapplicable |      1,001       21.13       24.49
         1 NONE |      3,062       64.64       89.13
     2 A LITTLE |        300        6.33       95.46
         3 SOME |        160        3.38       98.84
        4 A LOT |         55        1.16      100.00
----------------+-----------------------------------
          Total |      4,737      100.00
(515 real changes made)
(0 real changes made)
(0 real changes made)
(3 real changes made)

. la var hasdifficulty "Leaves home on own but has difficulty"

. tab hasdifficulty wave if sp_ivw_yes==1, missing

    Leaves |
   home on |
   own but |
       has |                 Survey wave
difficulty |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
        -8 |         2          7          3          3 |        15 
        -7 |         2          2          1          0 |         5 
         0 |     6,638      5,789      4,837      3,923 |    21,187 
         1 |       967        761        566        515 |     2,809 
-----------+--------------------------------------------+----------
     Total |     7,609      6,559      5,407      4,441 |    24,016 


. *********************************************
. //needs help or has difficulty going outside?
. gen helpdiff=.
(25856 missing values generated)

. replace helpdiff=0 if needshelp==0 & hasdifficulty==0
(21952 real changes made)

. replace helpdiff=1 if needshelp==1 | hasdifficulty==1
(3888 real changes made)

. la var helpdiff "Either needs help or has difficulty going outside"

. tab helpdiff wave if sp_ivw_yes==1, missing

    Either |
needs help |
    or has |
difficulty |
     going |                 Survey wave
   outside |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |     6,477      5,469      4,514      3,652 |    20,112 
         1 |     1,129      1,083        890        786 |     3,888 
         . |         3          7          3          3 |        16 
-----------+--------------------------------------------+----------
     Total |     7,609      6,559      5,407      4,441 |    24,016 


. *********************************************
. //independent - go out some/most days but are independent
. gen independent=0

. replace independent=1 if help_go_out==0 & hasdifficulty==0
(17137 real changes made)

. la var independent "Independently leaves home"

. tab independent wave if sp_ivw_yes==1, missing

Independen |
tly leaves |                 Survey wave
      home |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |     1,841      1,951      1,671      1,416 |     6,879 
         1 |     5,768      4,608      3,736      3,025 |    17,137 
-----------+--------------------------------------------+----------
     Total |     7,609      6,559      5,407      4,441 |    24,016 


. 
. tab independent helpdiff, missing //no overlap

Independen |     Either needs help or has
tly leaves |     difficulty going outside
      home |         0          1          . |     Total
-----------+---------------------------------+----------
         0 |     4,815      3,888         16 |     8,719 
         1 |    17,137          0          0 |    17,137 
-----------+---------------------------------+----------
     Total |    21,952      3,888         16 |    25,856 


. *********************************************
. /*homebound categories
> 0 = never go out
> 1 = rarely go out
> 2 = go out but never by self
> 3 = go out but need help/have difficulty
> 4 = go out, independent - don't need help or have difficulty
> */
. gen homebound_cat=.
(25856 missing values generated)

. replace homebound_cat=1 if freq_go_out==4 | freq_go_out==5
(2521 real changes made)

. replace homebound_cat=2 if inlist(freq_go_out,3,2,1) & out_on_own==4
(1060 real changes made)

. replace homebound_cat=3 if inlist(freq_go_out,3,2,1) & helpdiff==1
(3285 real changes made)

. replace homebound_cat=4 if inlist(freq_go_out,3,2,1) & independent==1
(16835 real changes made)

. 
. //from technical paper
. replace homebound_cat=3 if spid==10009011 & wave==1
(1 real change made)

. 
. la var homebound_cat "Homebound status, categorical"

. la def hb 1 "Never/Rarely leaves home" 2 "Leaves home but never by self" ///
> 3 "Leaves home but needs help/has difficulty" 4 "Independent, not homebound"

. la val homebound_cat hb

. tab homebound_cat wave if sp_ivw_yes==1, missing

    Homebound status, |                 Survey wave
          categorical |         1          2          3          4 |     Total
----------------------+--------------------------------------------+----------
Never/Rarely leaves h |       561        710        651        599 |     2,521 
Leaves home but never |       342        259        248        211 |     1,060 
Leaves home but needs |     1,019        918        719        630 |     3,286 
Independent, not home |     5,681      4,531      3,649      2,974 |    16,835 
                    . |         6        141        140         27 |       314 
----------------------+--------------------------------------------+----------
                Total |     7,609      6,559      5,407      4,441 |    24,016 


. *********************************************
. /*subcategories for level 4 homeboud category
> independent but go out only rarely
> independent and go out frequently*/
. gen indeplow=0

. replace indeplow=1 if freq_go_out==3 & independent==1
(1386 real changes made)

. la var indeplow "Independent, go out rarely" 

. 
. gen indephigh=0

. replace indephigh=1 if inlist(freq_go_out,2,1) & independent==1
(15449 real changes made)

. la var indephigh "Independent, go out often"

. 
. tab indeplow wave if sp_ivw_yes==1, missing

Independen |
 t, go out |                 Survey wave
    rarely |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |     7,150      6,199      5,096      4,185 |    22,630 
         1 |       459        360        311        256 |     1,386 
-----------+--------------------------------------------+----------
     Total |     7,609      6,559      5,407      4,441 |    24,016 


. tab indephigh wave if sp_ivw_yes==1, missing

Independen |
 t, go out |                 Survey wave
     often |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |     2,387      2,388      2,069      1,723 |     8,567 
         1 |     5,222      4,171      3,338      2,718 |    15,449 
-----------+--------------------------------------------+----------
     Total |     7,609      6,559      5,407      4,441 |    24,016 


. 
. *********************************************
. *********************************************
. //demographic information
. *********************************************
. *********************************************
. //age at interview, note this is missing for wave 3 b/c no wave 3 sensitive data yet
. gen age=.
(25856 missing values generated)

. foreach w in 1 2 3 4 {
  2.         replace age=r`w'dintvwrage if wave==`w'
  3.         sum age if wave==`w', detail
  4.         }       
(8245 real changes made)

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%           66             65
 5%           66             65
10%           68             65       Obs                8245
25%           71             65       Sum of Wgt.        8245

50%           78                      Mean            78.3698
                        Largest       Std. Dev.      8.187231
75%           84            102
90%           90            103       Variance       67.03075
95%           92            105       Skewness       .3186162
99%           97            106       Kurtosis       2.275853
(7075 real changes made)

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -1
 5%           -1             -1
10%           67             -1       Obs                7075
25%           71             -1       Sum of Wgt.        7075

50%           78                      Mean           73.49385
                        Largest       Std. Dev.      22.01883
75%           85            103
90%           90            103       Variance       484.8287
95%           93            106       Skewness      -2.627003
99%           97            107       Kurtosis       9.423245
(5799 real changes made)

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -1
 5%           -1             -1
10%           68             -1       Obs                5799
25%           71             -1       Sum of Wgt.        5799

50%           78                      Mean           72.61976
                        Largest       Std. Dev.      24.35733
75%           85            103
90%           90            103       Variance       593.2795
95%           93            104       Skewness      -2.372214
99%           98            104       Kurtosis       7.620767
(4737 real changes made)

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -1
 5%           -1             -1
10%           69             -1       Obs                4737
25%           72             -1       Sum of Wgt.        4737

50%           79                      Mean           73.64049
                        Largest       Std. Dev.      23.94829
75%           86            103
90%           91            103       Variance       573.5204
95%           94            103       Skewness      -2.468165
99%           98            105       Kurtosis       8.139488

. //for last month of life interviews, use age at death variable
. tab ivw_type if age==-1, missing

                              ivw_type |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
Died, proxy SP LML interview completed |      1,430      100.00      100.00
---------------------------------------+-----------------------------------
                                 Total |      1,430      100.00

. replace age=r2ddeathage if ivw_type==2 & r2dintvwrage==-1
(503 real changes made)

. sum age

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         age |     25856    76.54788    16.96072         -8        107

. //some observations that died still have missing age, so set to missing
. tab ivw_type if inlist(age,-7,-8)

                              ivw_type |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
Died, proxy SP LML interview completed |          4      100.00      100.00
---------------------------------------+-----------------------------------
                                 Total |          4      100.00

. replace age=. if inlist(age,-7,-8)
(4 real changes made, 4 to missing)

. 
. la var age "Age at interview or death"

. sum age if ivw_type==1, detail

                  Age at interview or death
-------------------------------------------------------------
      Percentiles      Smallest
 1%           66             65
 5%           68             65
10%           69             65       Obs               22586
25%           72             65       Sum of Wgt.       22586

50%           78                      Mean           78.70194
                        Largest       Std. Dev.      7.773138
75%           84            105
90%           89            106       Variance       60.42167
95%           92            106       Skewness       .3531147
99%           97            107       Kurtosis        2.37039

. sum age if ivw_type==2, detail

                  Age at interview or death
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -1
 5%           -1             -1
10%           -1             -1       Obs                1426
25%           -1             -1       Sum of Wgt.        1426

50%           -1                      Mean           29.26928
                        Largest       Std. Dev.      41.54942
75%           81            102
90%           91            102       Variance       1726.354
95%           94            103       Skewness       .6702159
99%          100            103       Kurtosis       1.502983

. sum age, detail

                  Age at interview or death
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -1
 5%           66             -1
10%           68             -1       Obs               25852
25%           72             -1       Sum of Wgt.       25852

50%           79                      Mean           76.56092
                        Largest       Std. Dev.      16.92958
75%           85            105
90%           91            106       Variance       286.6106
95%           93            106       Skewness      -3.300648
99%           98            107       Kurtosis        15.9717

. 
. //gender, only asked in round 1
. gen female=.
(25856 missing values generated)

. replace female=1 if r1dgender==2
(4925 real changes made)

. replace female=0 if r1dgender==1
(3320 real changes made)

. 
. la var female "Female"

. la def female 0"Male" 1"Female"

. la val female female

. tab female if wave==1, missing

     Female |      Freq.     Percent        Cum.
------------+-----------------------------------
       Male |      3,320       40.27       40.27
     Female |      4,925       59.73      100.00
------------+-----------------------------------
      Total |      8,245      100.00

. tab rl1dracehisp, missing

       R1 D RACE AND HISPANIC ETHNICITY |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                  1 White, non-hispanic |      5,655       21.87       21.87
                  2 Black, non-hispanic |      1,794        6.94       28.81
 3 Other (Am Indian/Asian/Native Hawaii |        231        0.89       29.70
                             4 Hispanic |        472        1.83       31.53
           5 more than one DKRF primary |          6        0.02       31.55
                                 6 DKRF |         87        0.34       31.89
                                      . |     17,611       68.11      100.00
----------------------------------------+-----------------------------------
                                  Total |     25,856      100.00

. //race, ethnicity
. gen race_cat=rl1dracehisp
(17611 missing values generated)

. replace race_cat=-8 if inlist(rl1dracehisp,5,6)
(93 real changes made)

. label define race 1 "White Non-His" 2 "Black Non-His" 4 "Hispanic" ///
>         3 "Other (Am Indian/Asian/Nat. Hawaii)" -8 "DKRF"

. label values race_cat race

. la var race_cat "Race, categorical"

. tab race_cat if wave==1, missing

                  Race, categorical |      Freq.     Percent        Cum.
------------------------------------+-----------------------------------
                               DKRF |         93        1.13        1.13
                      White Non-His |      5,655       68.59       69.71
                      Black Non-His |      1,794       21.76       91.47
Other (Am Indian/Asian/Nat. Hawaii) |        231        2.80       94.28
                           Hispanic |        472        5.72      100.00
------------------------------------+-----------------------------------
                              Total |      8,245      100.00

. 
. gen white=race_cat==1

. gen black=race_cat==2

. gen hisp=race_cat==4

. gen other_race=race_cat==3

. label var white "White Non-Hisp"

. label var black "Black Non-Hisp"

. label var hisp "Hispanic"

. label var other_race "Other race/ethnicity"

. 
. //education
. generate education=.
(25856 missing values generated)

. replace education=1 if inlist(el1higstschl,1,2,3)
(2047 real changes made)

. replace education=2 if el1higstschl==4
(2069 real changes made)

. replace education=3 if inlist(el1higstschl,5,6,7)
(1818 real changes made)

. replace education=4 if inlist(el1higstschl,8,9)
(1579 real changes made)

. replace education=-7 if el1higstschl == -7
(10 real changes made)

. replace education=-8 if el1higstschl == -8
(86 real changes made)

. 
. la var education "Education level, categorical"

. label define edulbl 1 "<High School" 2 "High School/GED" 3 "Some College" ///
>         4 ">=Bachelors" 5 "DKRF"

. label values education edulbl

. tab education el1higstschl if wave==1, missing

      Education |
         level, |                 R1 EL10 HGHST DGREE SCOOL COMPLD
    categorical | -9 Missin      -8 DK      -7 RF  -1 Inappl   1 NO SCH   2 1ST-8T |     Total
----------------+------------------------------------------------------------------+----------
             -8 |         0         86          0          0          0          0 |        86 
             -7 |         0          0         10          0          0          0 |        10 
   <High School |         0          0          0          0         89        900 |     2,047 
High School/GED |         0          0          0          0          0          0 |     2,069 
   Some College |         0          0          0          0          0          0 |     1,818 
    >=Bachelors |         0          0          0          0          0          0 |     1,579 
              . |       168          0          0        468          0          0 |       636 
----------------+------------------------------------------------------------------+----------
          Total |       168         86         10        468         89        900 |     8,245 


      Education |
         level, |                 R1 EL10 HGHST DGREE SCOOL COMPLD
    categorical |  3 9TH-12   4 HIGH S   5 VOCATI   6 SOME C   7 ASSOCI   8 BACHEL |     Total
----------------+------------------------------------------------------------------+----------
             -8 |         0          0          0          0          0          0 |        86 
             -7 |         0          0          0          0          0          0 |        10 
   <High School |     1,058          0          0          0          0          0 |     2,047 
High School/GED |         0      2,069          0          0          0          0 |     2,069 
   Some College |         0          0        549        942        327          0 |     1,818 
    >=Bachelors |         0          0          0          0          0        863 |     1,579 
              . |         0          0          0          0          0          0 |       636 
----------------+------------------------------------------------------------------+----------
          Total |     1,058      2,069        549        942        327        863 |     8,245 


                |  R1 EL10
                |   HGHST
                |   DGREE
      Education |   SCOOL
         level, |   COMPLD
    categorical |  9 MASTER |     Total
----------------+-----------+----------
             -8 |         0 |        86 
             -7 |         0 |        10 
   <High School |         0 |     2,047 
High School/GED |         0 |     2,069 
   Some College |         0 |     1,818 
    >=Bachelors |       716 |     1,579 
              . |         0 |       636 
----------------+-----------+----------
          Total |       716 |     8,245 


. 
. gen educ_hs_ind=education>=2 if education>0 & education!=.
(18343 missing values generated)

. 
. //income, just wave 1
. sum ia1totinc, detail //this is the actual reported income, only present 40% sample

                    R1 IA50 TOTAL INCOME
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -9             -9
 5%           -8             -9
10%           -8             -9       Obs                8245
25%           -8             -9       Sum of Wgt.        8245

50%         1003                      Mean           25276.52
                        Largest       Std. Dev.      126078.6
75%        27000        4000000
90%        60000        4000000       Variance       1.59e+10
95%        90000        5000000       Skewness       30.27629
99%       200000        5700000       Kurtosis       1121.346

. 
. forvalues i = 1/5{
  2. replace ia1toincim`i'=. if inlist(ia1toincim`i',-9,-1)
  3. sum ia1toincim`i',detail //imputed income variables
  4. gen imputed_inc`i' = ia1toincim`i'
  5. label var imputed_inc`i' "Imputed Income `i'"
  6. }
(636 real changes made, 636 to missing)

                 R1 IA50 IMPUTED TOTAL INC1
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         5000              0
10%         8000              0       Obs                7609
25%        13000              0       Sum of Wgt.        7609

50%        25000                      Mean           48101.73
                        Largest       Std. Dev.      174772.8
75%        50000        5000000
90%        85000        5000000       Variance       3.05e+10
95%       125000        5700000       Skewness       22.64232
99%       280000        5700000       Kurtosis       610.7911
(18247 missing values generated)
(636 real changes made, 636 to missing)

                 R1 IA50 IMPUTED TOTAL INC2
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         5000              0
10%         8000              0       Obs                7609
25%        13000              0       Sum of Wgt.        7609

50%        25000                      Mean           47400.31
                        Largest       Std. Dev.      163813.4
75%        50000        5000000
90%        85000        5000000       Variance       2.68e+10
95%       124000        5700000       Skewness       24.37988
99%       280000        5700000       Kurtosis       720.7381
(18247 missing values generated)
(636 real changes made, 636 to missing)

                 R1 IA50 IMPUTED TOTAL INC3
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         5000              0
10%         8000              0       Obs                7609
25%        13000              0       Sum of Wgt.        7609

50%        25000                      Mean           48033.05
                        Largest       Std. Dev.      174223.1
75%        50000        5000000
90%        85000        5000000       Variance       3.04e+10
95%       120000        5700000       Skewness       22.81822
99%       260000        5700000       Kurtosis       618.2839
(18247 missing values generated)
(636 real changes made, 636 to missing)

                 R1 IA50 IMPUTED TOTAL INC4
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         5000              0
10%         8000              0       Obs                7609
25%        13000              0       Sum of Wgt.        7609

50%        25000                      Mean           48079.98
                        Largest       Std. Dev.      173745.9
75%        50000        5000000
90%        85000        5000000       Variance       3.02e+10
95%       125000        5700000       Skewness       23.20914
99%       280000        5700000       Kurtosis       635.8328
(18247 missing values generated)
(636 real changes made, 636 to missing)

                 R1 IA50 IMPUTED TOTAL INC5
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         5000              0
10%         8008              0       Obs                7609
25%        13000              0       Sum of Wgt.        7609

50%        25000                      Mean           48496.79
                        Largest       Std. Dev.        176243
75%        50000        5000000
90%        86000        5000000       Variance       3.11e+10
95%       126000        5700000       Skewness       22.54756
99%       265000        5700000       Kurtosis       604.0381
(18247 missing values generated)

. 
. egen aveincome=rowmean(ia1toincim1-ia1toincim5)
(18247 missing values generated)

. 
. //use first income imputation to set income categorical variable
. gen income_cat=0 if aveincome<15000 & aveincome!=.
(23867 missing values generated)

. replace income_cat=1 if aveincome>=15000 & aveincome<30000 & aveincome!=.
(2083 real changes made)

. replace income_cat=2 if aveincome>=30000 & aveincome<60000 & aveincome!=.
(2009 real changes made)

. replace income_cat=3 if aveincome>=60000 & aveincome!=.
(1528 real changes made)

. label define income_cat 0 "<15000" 1 "15-29,999" 2 "30-59,999" 3 ">60000"

. label values income_cat income_cat

. tab income_cat, missing

 income_cat |      Freq.     Percent        Cum.
------------+-----------------------------------
     <15000 |      1,989        7.69        7.69
  15-29,999 |      2,083        8.06       15.75
  30-59,999 |      2,009        7.77       23.52
     >60000 |      1,528        5.91       29.43
          . |     18,247       70.57      100.00
------------+-----------------------------------
      Total |     25,856      100.00

. 
. //speak language other than english?
. gen otherlang=rl1spkothlan
(17611 missing values generated)

. replace otherlang=0 if rl1spkothlan==2
(6178 real changes made)

. replace otherlang = 1 if rl1condspanh == 1
(228 real changes made)

. replace otherlang = . if inlist(otherlang,-9,-1)
(636 real changes made, 636 to missing)

. la var otherlang "Speak language other than English?"

. tab otherlang wave, missing

     Speak |
  language |
other than |                 Survey wave
  English? |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
        -8 |        70          0          0          0 |        70 
        -7 |         5          0          0          0 |         5 
         0 |     6,178          0          0          0 |     6,178 
         1 |     1,356          0          0          0 |     1,356 
         . |       636      7,075      5,799      4,737 |    18,247 
-----------+--------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737 |    25,856 


. 
. //fill in gender, race, education, income, etc. for wave 2 interviews
. sort spid wave

. by spid (wave): carryforward female race_cat education income_cat otherlang imputed_inc1 imputed_inc2 
> imputed_inc3 imputed_inc4 imputed_inc5, replace
female:  (17611 real changes made)
race_cat:  (17611 real changes made)
education:  (16276 real changes made)
income_cat:  (16276 real changes made)
otherlang:  (16276 real changes made)
imputed_inc1:  (16276 real changes made)
imputed_inc2:  (16276 real changes made)
imputed_inc3:  (16276 real changes made)
imputed_inc4:  (16276 real changes made)
imputed_inc5:  (16276 real changes made)

. 
. //marital status
. //wave 2,3, use derived variable which is populated if not asked b/c no change 
. gen maritalstat=hh1martlstat if wave==1
(17611 missing values generated)

. foreach w in 2 3 4{
  2.         replace maritalstat=hh`w'dmarstat if wave==`w'
  3. }
(7075 real changes made)
(5799 real changes made)
(4737 real changes made)

. replace maritalstat=-9 if inlist(maritalstat,`miss')
(3103 real changes made)

. 
. la var maritalstat "Marital status"

. label define maritallbl 1 "Married" 2 "Live w/Part" 3 "Separated" ///
>         4 "Divorced" 5 "Widowed" 6 "Never Married" -7 "Refused" -8 "DK"

. la val maritalstat maritallbl

. tab maritalstat wave, missing

      Marital |                 Survey wave
       status |         1          2          3          4 |     Total
--------------+--------------------------------------------+----------
           -9 |       636      1,020        915        700 |     3,271 
           DK |         3          1          2          0 |         6 
      Refused |         6          0          0          0 |         6 
      Married |     3,647      2,804      2,216      1,784 |    10,451 
  Live w/Part |       151        119         88         73 |       431 
    Separated |       128         97         77         69 |       371 
     Divorced |       796        631        510        432 |     2,369 
      Widowed |     2,578      2,160      1,802      1,522 |     8,062 
Never Married |       300        243        189        157 |       889 
--------------+--------------------------------------------+----------
        Total |     8,245      7,075      5,799      4,737 |    25,856 


. 
. *********************************************
. *********************************************
. //Insurance coverage
. *********************************************
. *********************************************
. //medicaid status
. gen medicaid=.
(25856 missing values generated)

. foreach w in 1 2 3 4{
  2.         tab ip`w'cmedicaid if wave==`w' , missing
  3.         replace medicaid=1 if ip`w'cmedicaid==1 & wave==`w'
  4.         replace medicaid=0 if ip`w'cmedicaid==2 & wave==`w'
  5.         replace medicaid=-7 if ip`w'cmedicaid==-7 & wave==`w'
  6.         replace medicaid=-8 if ip`w'cmedicaid==-8 & wave==`w'
  7. }

  R1 IP4 COV BY |
 STATE MEDICAID |
            PRG |      Freq.     Percent        Cum.
----------------+-----------------------------------
     -9 Missing |        168        2.04        2.04
          -8 DK |        191        2.32        4.35
          -7 RF |         16        0.19        4.55
-1 Inapplicable |        468        5.68       10.22
          1 YES |      1,173       14.23       24.45
           2 NO |      6,229       75.55      100.00
----------------+-----------------------------------
          Total |      8,245      100.00
(1173 real changes made)
(6229 real changes made)
(16 real changes made)
(191 real changes made)

  R2 IP4 COV BY STATE |
         MEDICAID PRG |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        190        2.69        2.69
                -8 DK |        117        1.65        4.34
                -7 RF |          6        0.08        4.42
      -1 Inapplicable |        829       11.72       16.14
                1 YES |        986       13.94       30.08
                 2 NO |      4,947       69.92      100.00
----------------------+-----------------------------------
                Total |      7,075      100.00
(986 real changes made)
(4947 real changes made)
(6 real changes made)
(117 real changes made)

  R3 IP4 COV BY STATE |
         MEDICAID PRG |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        179        3.09        3.09
                -8 DK |        200        3.45        6.54
                -7 RF |         21        0.36        6.90
      -1 Inapplicable |        736       12.69       19.59
                1 YES |        740       12.76       32.35
                 2 NO |      3,923       67.65      100.00
----------------------+-----------------------------------
                Total |      5,799      100.00
(740 real changes made)
(3923 real changes made)
(21 real changes made)
(200 real changes made)

  R4 IP4 COV BY STATE |
         MEDICAID PRG |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        156        3.29        3.29
                -8 DK |        206        4.35        7.64
                -7 RF |          4        0.08        7.73
      -1 Inapplicable |        544       11.48       19.21
                1 YES |        615       12.98       32.19
                 2 NO |      3,212       67.81      100.00
----------------------+-----------------------------------
                Total |      4,737      100.00
(615 real changes made)
(3212 real changes made)
(4 real changes made)
(206 real changes made)

. la var medicaid "Medicaid"

. tab medicaid wave,missing

           |                 Survey wave
  Medicaid |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
        -8 |       191        117        200        206 |       714 
        -7 |        16          6         21          4 |        47 
         0 |     6,229      4,947      3,923      3,212 |    18,311 
         1 |     1,173        986        740        615 |     3,514 
         . |       636      1,019        915        700 |     3,270 
-----------+--------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737 |    25,856 


. tab medicaid if wave==1 & ivw_type==1,missing

   Medicaid |      Freq.     Percent        Cum.
------------+-----------------------------------
         -8 |        191        2.51        2.51
         -7 |         16        0.21        2.72
          0 |      6,229       81.86       84.58
          1 |      1,173       15.42      100.00
------------+-----------------------------------
      Total |      7,609      100.00

. //medigap status
. gen medigap=.
(25856 missing values generated)

. foreach w in 1 2 3 4{
  2.         tab ip`w'mgapmedsp if wave==`w' , missing
  3.         replace medigap=1 if ip`w'mgapmedsp==1 & wave==`w'
  4.         replace medigap=0 if ip`w'mgapmedsp==2 & wave==`w'
  5.         replace medigap=-7 if ip`w'mgapmedsp==-7 & wave==`w'
  6.         replace medigap=-8 if ip`w'mgapmedsp==-8 & wave==`w'
  7. }

 R1 IP3 MEDIGAP |
    OR MEDICARE |
           SUPP |      Freq.     Percent        Cum.
----------------+-----------------------------------
     -9 Missing |        168        2.04        2.04
          -8 DK |        255        3.09        5.13
          -7 RF |         21        0.25        5.39
-1 Inapplicable |        468        5.68       11.06
          1 YES |      4,207       51.02       62.09
           2 NO |      3,126       37.91      100.00
----------------+-----------------------------------
          Total |      8,245      100.00
(4207 real changes made)
(3126 real changes made)
(21 real changes made)
(255 real changes made)

    R2 IP3 MEDIGAP OR |
        MEDICARE SUPP |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        190        2.69        2.69
                -8 DK |        176        2.49        5.17
                -7 RF |          9        0.13        5.30
      -1 Inapplicable |        829       11.72       17.02
                1 YES |      3,697       52.25       69.27
                 2 NO |      2,174       30.73      100.00
----------------------+-----------------------------------
                Total |      7,075      100.00
(3697 real changes made)
(2174 real changes made)
(9 real changes made)
(176 real changes made)

    R3 IP3 MEDIGAP OR |
        MEDICARE SUPP |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        179        3.09        3.09
                -8 DK |        247        4.26        7.35
                -7 RF |         22        0.38        7.73
      -1 Inapplicable |        736       12.69       20.42
                1 YES |      2,966       51.15       71.56
                 2 NO |      1,649       28.44      100.00
----------------------+-----------------------------------
                Total |      5,799      100.00
(2966 real changes made)
(1649 real changes made)
(22 real changes made)
(247 real changes made)

    R4 IP3 MEDIGAP OR |
        MEDICARE SUPP |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        156        3.29        3.29
                -8 DK |        275        5.81        9.10
                -7 RF |          4        0.08        9.18
      -1 Inapplicable |        544       11.48       20.67
                1 YES |      2,483       52.42       73.08
                 2 NO |      1,275       26.92      100.00
----------------------+-----------------------------------
                Total |      4,737      100.00
(2483 real changes made)
(1275 real changes made)
(4 real changes made)
(275 real changes made)

. la var medigap "Medigap"

. tab medigap wave,missing

           |                 Survey wave
   Medigap |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
        -8 |       255        176        247        275 |       953 
        -7 |        21          9         22          4 |        56 
         0 |     3,126      2,174      1,649      1,275 |     8,224 
         1 |     4,207      3,697      2,966      2,483 |    13,353 
         . |       636      1,019        915        700 |     3,270 
-----------+--------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737 |    25,856 


. 
. //medicare part d
. gen mc_partd=.
(25856 missing values generated)

. foreach w in 1 2 3 4{
  2.         tab ip`w'covmedcad if wave==`w' , missing
  3.         replace mc_partd=1 if ip`w'covmedcad==1 & wave==`w'
  4.         replace mc_partd=0 if ip`w'covmedcad==2 & wave==`w'
  5.         replace mc_partd=-7 if ip`w'covmedcad==-7 & wave==`w'
  6.         replace mc_partd=-8 if ip`w'covmedcad==-8 & wave==`w'
  7. }

  R1 IP1 COVERD |
    BY MEDICARE |
         PART D |      Freq.     Percent        Cum.
----------------+-----------------------------------
     -9 Missing |        168        2.04        2.04
          -8 DK |        335        4.06        6.10
          -7 RF |         23        0.28        6.38
-1 Inapplicable |        468        5.68       12.06
          1 YES |      4,575       55.49       67.54
           2 NO |      2,676       32.46      100.00
----------------+-----------------------------------
          Total |      8,245      100.00
(4575 real changes made)
(2676 real changes made)
(23 real changes made)
(335 real changes made)

     R2 IP1 COVERD BY |
      MEDICARE PART D |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        190        2.69        2.69
                -8 DK |        252        3.56        6.25
                -7 RF |          5        0.07        6.32
      -1 Inapplicable |        829       11.72       18.04
                1 YES |      3,938       55.66       73.70
                 2 NO |      1,861       26.30      100.00
----------------------+-----------------------------------
                Total |      7,075      100.00
(3938 real changes made)
(1861 real changes made)
(5 real changes made)
(252 real changes made)

     R3 IP1 COVERD BY |
      MEDICARE PART D |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        179        3.09        3.09
                -8 DK |        314        5.41        8.50
                -7 RF |         21        0.36        8.86
      -1 Inapplicable |        736       12.69       21.56
                1 YES |      3,155       54.41       75.96
                 2 NO |      1,394       24.04      100.00
----------------------+-----------------------------------
                Total |      5,799      100.00
(3155 real changes made)
(1394 real changes made)
(21 real changes made)
(314 real changes made)

     R4 IP1 COVERD BY |
      MEDICARE PART D |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        156        3.29        3.29
                -8 DK |        346        7.30       10.60
                -7 RF |          6        0.13       10.72
      -1 Inapplicable |        544       11.48       22.21
                1 YES |      2,606       55.01       77.22
                 2 NO |      1,079       22.78      100.00
----------------------+-----------------------------------
                Total |      4,737      100.00
(2606 real changes made)
(1079 real changes made)
(6 real changes made)
(346 real changes made)

. la var mc_partd "Medicare Part D"

. tab mc_partd wave,missing

  Medicare |                 Survey wave
    Part D |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
        -8 |       335        252        314        346 |     1,247 
        -7 |        23          5         21          6 |        55 
         0 |     2,676      1,861      1,394      1,079 |     7,010 
         1 |     4,575      3,938      3,155      2,606 |    14,274 
         . |       636      1,019        915        700 |     3,270 
-----------+--------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737 |    25,856 


. 
. //tricare - va insurance
. gen tricare=.
(25856 missing values generated)

. foreach w in 1 2 3 4{
  2.         tab ip`w'covtricar if wave==`w' , missing
  3.         replace tricare=1 if ip`w'covtricar==1 & wave==`w'
  4.         replace tricare=0 if ip`w'covtricar==2 & wave==`w'
  5.         replace tricare=-7 if ip`w'covtricar==-7 & wave==`w'
  6.         replace tricare=-8 if ip`w'covtricar==-8 & wave==`w'
  7. }

 R1 IP5 COVERED |
     BY TRICARE |      Freq.     Percent        Cum.
----------------+-----------------------------------
     -9 Missing |        168        2.04        2.04
          -8 DK |        127        1.54        3.58
          -7 RF |         16        0.19        3.77
-1 Inapplicable |        468        5.68        9.45
          1 YES |        413        5.01       14.46
           2 NO |      7,053       85.54      100.00
----------------+-----------------------------------
          Total |      8,245      100.00
(413 real changes made)
(7053 real changes made)
(16 real changes made)
(127 real changes made)

    R2 IP5 COVERED BY |
              TRICARE |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        190        2.69        2.69
                -8 DK |         65        0.92        3.60
                -7 RF |          5        0.07        3.67
      -1 Inapplicable |        829       11.72       15.39
                1 YES |        350        4.95       20.34
                 2 NO |      5,636       79.66      100.00
----------------------+-----------------------------------
                Total |      7,075      100.00
(350 real changes made)
(5636 real changes made)
(5 real changes made)
(65 real changes made)

    R3 IP5 COVERED BY |
              TRICARE |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        179        3.09        3.09
                -8 DK |        151        2.60        5.69
                -7 RF |         21        0.36        6.05
      -1 Inapplicable |        736       12.69       18.74
                1 YES |        284        4.90       23.64
                 2 NO |      4,428       76.36      100.00
----------------------+-----------------------------------
                Total |      5,799      100.00
(284 real changes made)
(4428 real changes made)
(21 real changes made)
(151 real changes made)

    R4 IP5 COVERED BY |
              TRICARE |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        156        3.29        3.29
                -8 DK |        165        3.48        6.78
                -7 RF |          3        0.06        6.84
      -1 Inapplicable |        544       11.48       18.32
                1 YES |        238        5.02       23.35
                 2 NO |      3,631       76.65      100.00
----------------------+-----------------------------------
                Total |      4,737      100.00
(238 real changes made)
(3631 real changes made)
(3 real changes made)
(165 real changes made)

. la var tricare "Tricare - veterans insurance"

. tab tricare wave,missing

 Tricare - |
  veterans |                 Survey wave
 insurance |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
        -8 |       127         65        151        165 |       508 
        -7 |        16          5         21          3 |        45 
         0 |     7,053      5,636      4,428      3,631 |    20,748 
         1 |       413        350        284        238 |     1,285 
         . |       636      1,019        915        700 |     3,270 
-----------+--------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737 |    25,856 


. 
. //long term care nursing home insurance, private
. gen private_ltc=.
(25856 missing values generated)

. foreach w in 1 2 3 4{
  2.         tab ip`w'nginsnurs if wave==`w' , missing
  3.         replace private_ltc=1 if ip`w'nginsnurs==1 & wave==`w'
  4.         replace private_ltc=0 if ip`w'nginsnurs==2 & wave==`w'
  5.         replace private_ltc=-7 if ip`w'nginsnurs==-7 & wave==`w'
  6.         replace private_ltc=-8 if ip`w'nginsnurs==-8 & wave==`w'
  7. }

  R1 IP6 NONGOV |
  INSR FOR NURS |
           HOME |      Freq.     Percent        Cum.
----------------+-----------------------------------
     -9 Missing |        168        2.04        2.04
          -8 DK |        472        5.72        7.76
          -7 RF |         21        0.25        8.02
-1 Inapplicable |        468        5.68       13.69
          1 YES |      1,179       14.30       27.99
           2 NO |      5,937       72.01      100.00
----------------+-----------------------------------
          Total |      8,245      100.00
(1179 real changes made)
(5937 real changes made)
(21 real changes made)
(472 real changes made)

   R2 IP6 NONGOV INSR |
        FOR NURS HOME |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        190        2.69        2.69
                -8 DK |        291        4.11        6.80
                -7 RF |         10        0.14        6.94
      -1 Inapplicable |      1,824       25.78       32.72
                1 YES |        329        4.65       37.37
                 2 NO |      4,431       62.63      100.00
----------------------+-----------------------------------
                Total |      7,075      100.00
(329 real changes made)
(4431 real changes made)
(10 real changes made)
(291 real changes made)

   R3 IP6 NONGOV INSR |
        FOR NURS HOME |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        179        3.09        3.09
                -8 DK |        334        5.76        8.85
                -7 RF |         18        0.31        9.16
      -1 Inapplicable |      1,723       29.71       38.87
                1 YES |        180        3.10       41.97
                 2 NO |      3,365       58.03      100.00
----------------------+-----------------------------------
                Total |      5,799      100.00
(180 real changes made)
(3365 real changes made)
(18 real changes made)
(334 real changes made)

   R4 IP6 NONGOV INSR |
        FOR NURS HOME |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        156        3.29        3.29
                -8 DK |        356        7.52       10.81
                -7 RF |          3        0.06       10.87
      -1 Inapplicable |      1,443       30.46       41.33
                1 YES |        147        3.10       44.44
                 2 NO |      2,632       55.56      100.00
----------------------+-----------------------------------
                Total |      4,737      100.00
(147 real changes made)
(2632 real changes made)
(3 real changes made)
(356 real changes made)

. la var private_ltc "Private nursing home insurance"

. tab private_ltc wave,missing

   Private |
   nursing |
      home |                 Survey wave
 insurance |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
        -8 |       472        291        334        356 |     1,453 
        -7 |        21         10         18          3 |        52 
         0 |     5,937      4,431      3,365      2,632 |    16,365 
         1 |     1,179        329        180        147 |     1,835 
         . |       636      2,014      1,902      1,599 |     6,151 
-----------+--------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737 |    25,856 


. 
. //if report nh insurance in prev wave, asked to verify still have it curr wave
. foreach w in 2 3 4{
  2. tab ip`w'nginslast if wave==`w' & ip`w'nginsnurs==-1, missing
  3. replace private_ltc=1 if ip`w'nginslast==1 & ip`w'nginsnurs==-1 & wave==`w'
  4. replace private_ltc=0 if ip`w'nginslast==2 & ip`w'nginsnurs==-1 & wave==`w'
  5. replace private_ltc=-7 if ip`w'nginslast==-7 & ip`w'nginsnurs==-1 & wave==`w'
  6. replace private_ltc=-8 if ip`w'nginslast==-8 & ip`w'nginsnurs==-1 & wave==`w'
  7. }

     R2 IP5A HAVE LTC INS FROM LAST INT |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                  -8 DK |         14        0.77        0.77
                                  -7 RF |          2        0.11        0.88
                        -1 Inapplicable |        829       45.45       46.33
                                  1 YES |        931       51.04       97.37
                                   2 NO |         48        2.63      100.00
----------------------------------------+-----------------------------------
                                  Total |      1,824      100.00
(931 real changes made)
(48 real changes made)
(2 real changes made)
(14 real changes made)

     R3 IP5A HAVE LTC INS FROM LAST INT |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                  -8 DK |         44        2.55        2.55
                                  -7 RF |          3        0.17        2.73
                        -1 Inapplicable |        736       42.72       45.44
                                  1 YES |        892       51.77       97.21
                                   2 NO |         48        2.79      100.00
----------------------------------------+-----------------------------------
                                  Total |      1,723      100.00
(892 real changes made)
(48 real changes made)
(3 real changes made)
(44 real changes made)

     R4 IP5A HAVE LTC INS FROM LAST INT |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                  -8 DK |         40        2.77        2.77
                                  -7 RF |          1        0.07        2.84
                        -1 Inapplicable |        544       37.70       40.54
                                  1 YES |        810       56.13       96.67
                                   2 NO |         48        3.33      100.00
----------------------------------------+-----------------------------------
                                  Total |      1,443      100.00
(810 real changes made)
(48 real changes made)
(1 real change made)
(40 real changes made)

. tab private_ltc wave,missing

   Private |
   nursing |
      home |                 Survey wave
 insurance |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
        -8 |       472        305        378        396 |     1,551 
        -7 |        21         12         21          4 |        58 
         0 |     5,937      4,479      3,413      2,680 |    16,509 
         1 |     1,179      1,260      1,072        957 |     4,468 
         . |       636      1,019        915        700 |     3,270 
-----------+--------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737 |    25,856 


. 
. *********************************************
. *********************************************
. //Residence information
. *********************************************
. *********************************************
. //residence physical structure variable only in wave 1
. tab re1resistrct if wave==1, missing

       R1 RE1 RESIDNCE PHYSICAL STRCTUR |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                             -9 Missing |        168        2.04        2.04
                        -1 Inapplicable |        468        5.68        7.71
 1 FREE-STANDING (DETACHED) SINGLE HOUS |      5,483       66.50       74.21
 2 SINGLE HOUSE BUT ATTACHED TO OTHERS  |        615        7.46       81.67
               3 MOBILE HOME OR TRAILER |        344        4.17       85.85
             4 MULTI-UNIT (2+) BUILDING |      1,110       13.46       99.31
                     91 OTHER (SPECIFY) |         57        0.69      100.00
----------------------------------------+-----------------------------------
                                  Total |      8,245      100.00

. tab re1resistrct ht1placedesc if wave==1, missing

      R1 RE1 RESIDNCE |                   R1 HT3 PLACE BEST DESCRIPTION
     PHYSICAL STRCTUR | -9 Missin  -1 Inappl   1 PRIVAT   2 A GROU   3 ASSIST   4 RELIGI |     Total
----------------------+------------------------------------------------------------------+----------
           -9 Missing |       168          0          0          0          0          0 |       168 
      -1 Inapplicable |         0        468          0          0          0          0 |       468 
 1 FREE-STANDING (DET |         0          0      5,450         10         14          1 |     5,483 
 2 SINGLE HOUSE BUT A |         0          0        587          5          8          1 |       615 
 3 MOBILE HOME OR TRA |         0        344          0          0          0          0 |       344 
 4 MULTI-UNIT (2+) BU |         0      1,110          0          0          0          0 |     1,110 
   91 OTHER (SPECIFY) |         0         57          0          0          0          0 |        57 
----------------------+------------------------------------------------------------------+----------
                Total |       168      1,979      6,037         15         22          2 |     8,245 


                      |   R1 HT3
                      | PLACE BEST
                      | DESCRIPTIO
      R1 RE1 RESIDNCE |     N
     PHYSICAL STRCTUR | 91 OTHER  |     Total
----------------------+-----------+----------
           -9 Missing |         0 |       168 
      -1 Inapplicable |         0 |       468 
 1 FREE-STANDING (DET |         8 |     5,483 
 2 SINGLE HOUSE BUT A |        14 |       615 
 3 MOBILE HOME OR TRA |         0 |       344 
 4 MULTI-UNIT (2+) BU |         0 |     1,110 
   91 OTHER (SPECIFY) |         0 |        57 
----------------------+-----------+----------
                Total |        22 |     8,245 


. //derived variable in waves 2, 3
. tab re2dresistrct if wave==2, missing

         R2 D RESIDNCE PHYSICAL STRCTUR |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                        -1 Inapplicable |      1,019       14.40       14.40
1 FREE-STANDING (DETACHED) SINGLE HOUSE |      4,315       60.99       75.39
2 SINGLE HOUSE BUT ATTACHED TO OTHERS ( |        475        6.71       82.11
               3 MOBILE HOME OR TRAILER |        281        3.97       86.08
             4 MULTI-UNIT (2+) BUILDING |        916       12.95       99.02
                     91 OTHER (SPECIFY) |         69        0.98      100.00
----------------------------------------+-----------------------------------
                                  Total |      7,075      100.00

. //per user guide, need to fix this variable since incorrectly coded for 71 obs
. replace re2dresistrct = re2newstrct if inlist(re2spadrsnew,1,3) & inlist(re2newstrct,1,2,3,4,91)
(71 real changes made)

. 
. tab re3dresistrct if wave==3, missing

         R3 D RESIDNCE PHYSICAL STRCTUR |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                        -1 Inapplicable |        915       15.78       15.78
1 FREE-STANDING (DETACHED) SINGLE HOUSE |      3,470       59.84       75.62
2 SINGLE HOUSE BUT ATTACHED TO OTHERS ( |        383        6.60       82.22
               3 MOBILE HOME OR TRAILER |        234        4.04       86.26
             4 MULTI-UNIT (2+) BUILDING |        737       12.71       98.97
                     91 OTHER (SPECIFY) |         60        1.03      100.00
----------------------------------------+-----------------------------------
                                  Total |      5,799      100.00

. 
. //housing type in each wave, however missing if same residence as prior wave
. foreach w in 1 2 3{
  2. tab ht`w'placedesc if wave==`w', missing
  3. }

          R1 HT3 PLACE BEST DESCRIPTION |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                             -9 Missing |        168        2.04        2.04
                        -1 Inapplicable |      1,979       24.00       26.04
                    1 PRIVATE RESIDENCE |      6,037       73.22       99.26
 2 A GROUP HOME, BOARD AND CARE, OR SUP |         15        0.18       99.44
 3 ASSISTED LIVING FACILITY OR CONTINUI |         22        0.27       99.71
             4 RELIGIOUS GROUP QUARTERS |          2        0.02       99.73
                     91 OTHER (SPECIFY) |         22        0.27      100.00
----------------------------------------+-----------------------------------
                                  Total |      8,245      100.00

          R2 HT3 PLACE BEST DESCRIPTION |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                             -9 Missing |        190        2.69        2.69
                        -1 Inapplicable |      6,718       94.95       97.64
                    1 PRIVATE RESIDENCE |        150        2.12       99.76
2 A GROUP HOME, BOARD AND CARE, OR SUPE |          4        0.06       99.82
3 ASSISTED LIVING FACILITY OR CONTINUIN |          8        0.11       99.93
                     91 OTHER (SPECIFY) |          5        0.07      100.00
----------------------------------------+-----------------------------------
                                  Total |      7,075      100.00

          R3 HT3 PLACE BEST DESCRIPTION |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                             -9 Missing |        179        3.09        3.09
                        -1 Inapplicable |      5,489       94.65       97.74
                    1 PRIVATE RESIDENCE |        118        2.03       99.78
2 A GROUP HOME, BOARD AND CARE, OR SUPE |          5        0.09       99.86
3 ASSISTED LIVING FACILITY OR CONTINUIN |          5        0.09       99.95
                     91 OTHER (SPECIFY) |          3        0.05      100.00
----------------------------------------+-----------------------------------
                                  Total |      5,799      100.00

. 
. //if missing housing type in waves 2,3, backfill with wave 1 info
. //get indicators for moving in waves 2 or 3
. tab re2dadrscorr, missing

  R2 D RE4F ADDRESS SAME DIFF CORRECTED |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                             -9 Missing |        190        0.73        0.73
                        -1 Inapplicable |        326        1.26        2.00
                    1 YES, SAME ADDRESS |      6,041       23.36       25.36
                2 NO, DIFFERENT ADDRESS |        470        1.82       27.18
3 YES, SAME ADDRESS WITH MINOR CORRECTI |         48        0.19       27.36
                                      . |     18,781       72.64      100.00
----------------------------------------+-----------------------------------
                                  Total |     25,856      100.00

. 
. gen w2_moved=1 if re2dadrscorr==2
(25386 missing values generated)

. replace w2_moved=0 if re2dadrscorr==1 | re2dadrscorr==3
(6089 real changes made)

. tab w2_moved

   w2_moved |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,089       92.83       92.83
          1 |        470        7.17      100.00
------------+-----------------------------------
      Total |      6,559      100.00

. 
. tab re3spadrsnew, missing

        R3 RE4F SP ADDRESS SAME OR DIFF |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                             -9 Missing |        179        0.69        0.69
                        -1 Inapplicable |        213        0.82        1.52
                    1 YES, SAME ADDRESS |      5,022       19.42       20.94
                2 NO, DIFFERENT ADDRESS |        346        1.34       22.28
3 YES, SAME ADDRESS WITH MINOR CORRECTI |         39        0.15       22.43
                                      . |     20,057       77.57      100.00
----------------------------------------+-----------------------------------
                                  Total |     25,856      100.00

. gen w3_moved=1 if re3spadrsnew==2
(25510 missing values generated)

. replace w3_moved=0 if re3spadrsnew==1 | re3spadrsnew==3
(5061 real changes made)

. tab w3_moved

   w3_moved |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,061       93.60       93.60
          1 |        346        6.40      100.00
------------+-----------------------------------
      Total |      5,407      100.00

. 
. gen w4_moved=1 if re4spadrsnew==2
(25554 missing values generated)

. replace w4_moved=0 if re4spadrsnew==1 | re4spadrsnew==3
(4139 real changes made)

. tab w4_moved

   w4_moved |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,139       93.20       93.20
          1 |        302        6.80      100.00
------------+-----------------------------------
      Total |      4,441      100.00

. 
. gen ht_new=.
(25856 missing values generated)

. foreach w in 1 2 3 4{
  2. replace ht_new=ht`w'placedesc if wave==`w'
  3. }
(8245 real changes made)
(7075 real changes made)
(5799 real changes made)
(4737 real changes made)

. 
. foreach w in 2 3 4{
  2. replace ht_new=. if ht`w'placedesc==-1 & w`w'_moved==0
  3. }
(6089 real changes made, 6089 to missing)
(5060 real changes made, 5060 to missing)
(4139 real changes made, 4139 to missing)

. 
. tab ht_new wave, missing

           |                 Survey wave
    ht_new |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
        -9 |       168        190        179        156 |       693 
        -1 |     1,979        629        429        326 |     3,363 
         1 |     6,037        150        118        108 |     6,413 
         2 |        15          4          5          2 |        26 
         3 |        22          8          5          6 |        41 
         4 |         2          0          0          0 |         2 
        91 |        22          5          3          0 |        30 
         . |         0      6,089      5,060      4,139 |    15,288 
-----------+--------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737 |    25,856 


. 
. sort spid wave

. by spid (wave): carryforward ht_new, replace
ht_new:  (15288 real changes made)

. 
. tab ht_new wave, missing

           |                 Survey wave
    ht_new |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
        -9 |       168        214        215        213 |       810 
        -1 |     1,979      1,861      1,507      1,175 |     6,522 
         1 |     6,037      4,943      4,019      3,298 |    18,297 
         2 |        15         15         17         14 |        61 
         3 |        22         21         20         23 |        86 
         4 |         2          2          2          2 |         8 
        91 |        22         19         19         12 |        72 
-----------+--------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737 |    25,856 


. 
. //most residence information from wave 1
. //used derived variables wave 2,3
. gen residence=.
(25856 missing values generated)

. replace residence=re1resistrct if wave==1
(8245 real changes made)

. replace residence=re2dresistrct if wave==2
(7075 real changes made)

. replace residence=re3dresistrct if wave==3
(5799 real changes made)

. replace residence=re4dresistrct if wave==4
(4737 real changes made)

. replace residence=3 if inlist(residence,4,91)
(3691 real changes made)

. 
. tab residence wave

           |                 Survey wave
 residence |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
        -9 |       168          0          0          0 |       168 
        -1 |       468      1,019        915        428 |     2,830 
         1 |     5,483      4,309      3,470      3,019 |    16,281 
         2 |       615        483        383        342 |     1,823 
         3 |     1,511      1,264      1,031        948 |     4,754 
-----------+--------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737 |    25,856 


. 
. //now overwrite with the new housing type description as done in orig code
. replace residence=1 if ht_new==1
(2189 real changes made)

. replace residence=2 if inlist(ht_new,2,3,4,91)
(131 real changes made)

. replace residence=. if inlist(residence,-9,-1)
(2523 real changes made, 2523 to missing)

. tab residence wave, missing

           |                 Survey wave
 residence |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         1 |     6,037      4,971      4,038      3,312 |    18,358 
         2 |        61         76         73         66 |       276 
         3 |     1,511      1,244      1,013        931 |     4,699 
         . |       636        784        675        428 |     2,523 
-----------+--------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737 |    25,856 


. 
. label define residlbl 1 "Private Res." 2 "Group Home/Facility" ///
>         3 "Mobile Home/Multi-Unit"

. label values residence residlbl

. tab residence if wave==1, missing

             residence |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
          Private Res. |      6,037       73.22       73.22
   Group Home/Facility |         61        0.74       73.96
Mobile Home/Multi-Unit |      1,511       18.33       92.29
                     . |        636        7.71      100.00
-----------------------+-----------------------------------
                 Total |      8,245      100.00

. tab residence if wave==2, missing

             residence |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
          Private Res. |      4,971       70.26       70.26
   Group Home/Facility |         76        1.07       71.34
Mobile Home/Multi-Unit |      1,244       17.58       88.92
                     . |        784       11.08      100.00
-----------------------+-----------------------------------
                 Total |      7,075      100.00

. tab residence if wave==3, missing

             residence |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
          Private Res. |      4,038       69.63       69.63
   Group Home/Facility |         73        1.26       70.89
Mobile Home/Multi-Unit |      1,013       17.47       88.36
                     . |        675       11.64      100.00
-----------------------+-----------------------------------
                 Total |      5,799      100.00

. tab residence if wave==4, missing

             residence |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
          Private Res. |      3,312       69.92       69.92
   Group Home/Facility |         66        1.39       71.31
Mobile Home/Multi-Unit |        931       19.65       90.96
                     . |        428        9.04      100.00
-----------------------+-----------------------------------
                 Total |      4,737      100.00

. 
. 
. ***********************************************************
. //living arrangement, NHATS derived variable
. gen livearrang=.
(25856 missing values generated)

. foreach w in 1 2 3 4{
  2. tab hh`w'dlvngarrg if wave==`w' & ivw_type==1, missing
  3. replace livearrang=hh`w'dlvngarrg if wave==`w'
  4. replace livearrang=1 if (hh`w'dlvngarrg==-9 & hh`w'dhshldnum==1)  & wave==`w'
  5. replace livearrang=-7 if hh`w'dlvngarrg == -7 & wave == `w'
  6. replace livearrang=-8 if hh`w'dlvngarrg == -8 & wave == `w'
  7. }

                R1 D LIVING ARRANGEMENT |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                            -9 Missing  |         31        0.41        0.41
                               1 Alone  |      2,474       32.51       32.92
2 With spouse/partner only [spouse/part |      3,050       40.08       73.01
  3 With spouse/partner and with others |        688        9.04       82.05
                    4 With others only  |      1,366       17.95      100.00
----------------------------------------+-----------------------------------
                                  Total |      7,609      100.00
(8245 real changes made)
(31 real changes made)
(0 real changes made)
(0 real changes made)

                R2 D LIVING ARRANGEMENT |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                1 Alone |      1,972       32.56       32.56
2 With spouse/partner only (spouse/part |      2,285       37.73       70.29
  3 With spouse/partner and with others |        574        9.48       79.77
                     4 With others only |      1,225       20.23      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,056      100.00
(7075 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

                R3 D LIVING ARRANGEMENT |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                1 Alone |      1,757       35.97       35.97
2 With spouse/partner only (spouse/part |      1,754       35.91       71.89
  3 With spouse/partner and with others |        433        8.87       80.75
                     4 With others only |        940       19.25      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,884      100.00
(5799 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

                R4 D LIVING ARRANGEMENT |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                1 Alone |      1,479       36.64       36.64
2 With spouse/partner only (spouse/part |      1,433       35.50       72.13
  3 With spouse/partner and with others |        354        8.77       80.90
                     4 With others only |        771       19.10      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,037      100.00
(4737 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. replace livearrang=. if livearrang==-1 
(3270 real changes made, 3270 to missing)

. 
. la var livearrang "Living arrangmeent, categorical"

. la def livearrang 1 "Alone" 2 "With spouse/partner" ///
>         3"With spouse/partner + others" 4 "With others"

. la val livearrang livearrang

. tab livearrang wave if ivw_type==1, missing

  Living arrangmeent, |                 Survey wave
          categorical |         1          2          3          4 |     Total
----------------------+--------------------------------------------+----------
                Alone |     2,505      1,972      1,757      1,479 |     7,713 
  With spouse/partner |     3,050      2,285      1,754      1,433 |     8,522 
With spouse/partner + |       688        574        433        354 |     2,049 
          With others |     1,366      1,225        940        771 |     4,302 
----------------------+--------------------------------------------+----------
                Total |     7,609      6,056      4,884      4,037 |    22,586 


. 
. //live alone?
. gen livealone=1 if livearrang==1
(18143 missing values generated)

. replace livealone=0 if inlist(livearrang,2,3,4)
(14873 real changes made)

. la var livealone "Lives alone"

. tab livealone livearrang, missing

     Lives |            Living arrangmeent, categorical
     alone |     Alone  With spou  With spou  With othe          . |     Total
-----------+-------------------------------------------------------+----------
         0 |         0      8,522      2,049      4,302          0 |    14,873 
         1 |     7,713          0          0          0          0 |     7,713 
         . |         0          0          0          0      3,270 |     3,270 
-----------+-------------------------------------------------------+----------
     Total |     7,713      8,522      2,049      4,302      3,270 |    25,856 


. 
. save round_1_4_cleanv1.dta, replace
file round_1_4_cleanv1.dta saved

. local ivars age female race_cat education  income_cat otherlang maritalstat medicaid medigap mc_partd 
> tricare private_ltc w2_moved w3_moved ht_new residence livearrang livealone

. foreach w in `ivars'{
  2. 
. tab `w'
  3. 
. 
. }

     Age at |
  interview |
   or death |      Freq.     Percent        Cum.
------------+-----------------------------------
         -1 |        927        3.59        3.59
         65 |         77        0.30        3.88
         66 |        411        1.59        5.47
         67 |        626        2.42        7.89
         68 |        875        3.38       11.28
         69 |      1,028        3.98       15.26
         70 |      1,013        3.92       19.17
         71 |      1,031        3.99       23.16
         72 |      1,020        3.95       27.11
         73 |        990        3.83       30.94
         74 |        987        3.82       34.76
         75 |        919        3.55       38.31
         76 |      1,011        3.91       42.22
         77 |        989        3.83       46.05
         78 |        945        3.66       49.70
         79 |        978        3.78       53.49
         80 |        985        3.81       57.30
         81 |        999        3.86       61.16
         82 |      1,027        3.97       65.13
         83 |      1,015        3.93       69.06
         84 |      1,001        3.87       72.93
         85 |        887        3.43       76.36
         86 |        873        3.38       79.74
         87 |        760        2.94       82.68
         88 |        700        2.71       85.39
         89 |        631        2.44       87.83
         90 |        550        2.13       89.95
         91 |        522        2.02       91.97
         92 |        476        1.84       93.81
         93 |        428        1.66       95.47
         94 |        330        1.28       96.75
         95 |        234        0.91       97.65
         96 |        181        0.70       98.35
         97 |        135        0.52       98.87
         98 |         89        0.34       99.22
         99 |         75        0.29       99.51
        100 |         54        0.21       99.72
        101 |         31        0.12       99.84
        102 |         23        0.09       99.93
        103 |         12        0.05       99.97
        104 |          2        0.01       99.98
        105 |          2        0.01       99.99
        106 |          2        0.01      100.00
        107 |          1        0.00      100.00
------------+-----------------------------------
      Total |     25,852      100.00

     Female |      Freq.     Percent        Cum.
------------+-----------------------------------
       Male |     10,343       40.00       40.00
     Female |     15,513       60.00      100.00
------------+-----------------------------------
      Total |     25,856      100.00

                  Race, categorical |      Freq.     Percent        Cum.
------------------------------------+-----------------------------------
                               DKRF |        242        0.94        0.94
                      White Non-His |     18,025       69.71       70.65
                      Black Non-His |      5,521       21.35       92.00
Other (Am Indian/Asian/Nat. Hawaii) |        670        2.59       94.59
                           Hispanic |      1,398        5.41      100.00
------------------------------------+-----------------------------------
                              Total |     25,856      100.00

      Education |
         level, |
    categorical |      Freq.     Percent        Cum.
----------------+-----------------------------------
             -8 |        214        0.90        0.90
             -7 |         32        0.13        1.03
   <High School |      6,238       26.12       27.15
High School/GED |      6,387       26.74       53.89
   Some College |      5,732       24.00       77.89
    >=Bachelors |      5,282       22.11      100.00
----------------+-----------------------------------
          Total |     23,885      100.00

 income_cat |      Freq.     Percent        Cum.
------------+-----------------------------------
     <15000 |      6,128       25.66       25.66
  15-29,999 |      6,488       27.16       52.82
  30-59,999 |      6,220       26.04       78.86
     >60000 |      5,049       21.14      100.00
------------+-----------------------------------
      Total |     23,885      100.00

      Speak |
   language |
 other than |
   English? |      Freq.     Percent        Cum.
------------+-----------------------------------
         -8 |        176        0.74        0.74
         -7 |         12        0.05        0.79
          0 |     19,576       81.96       82.75
          1 |      4,121       17.25      100.00
------------+-----------------------------------
      Total |     23,885      100.00

      Marital |
       status |      Freq.     Percent        Cum.
--------------+-----------------------------------
           -9 |      3,271       12.65       12.65
           DK |          6        0.02       12.67
      Refused |          6        0.02       12.70
      Married |     10,451       40.42       53.12
  Live w/Part |        431        1.67       54.78
    Separated |        371        1.43       56.22
     Divorced |      2,369        9.16       65.38
      Widowed |      8,062       31.18       96.56
Never Married |        889        3.44      100.00
--------------+-----------------------------------
        Total |     25,856      100.00

   Medicaid |      Freq.     Percent        Cum.
------------+-----------------------------------
         -8 |        714        3.16        3.16
         -7 |         47        0.21        3.37
          0 |     18,311       81.07       84.44
          1 |      3,514       15.56      100.00
------------+-----------------------------------
      Total |     22,586      100.00

    Medigap |      Freq.     Percent        Cum.
------------+-----------------------------------
         -8 |        953        4.22        4.22
         -7 |         56        0.25        4.47
          0 |      8,224       36.41       40.88
          1 |     13,353       59.12      100.00
------------+-----------------------------------
      Total |     22,586      100.00

   Medicare |
     Part D |      Freq.     Percent        Cum.
------------+-----------------------------------
         -8 |      1,247        5.52        5.52
         -7 |         55        0.24        5.76
          0 |      7,010       31.04       36.80
          1 |     14,274       63.20      100.00
------------+-----------------------------------
      Total |     22,586      100.00

  Tricare - |
   veterans |
  insurance |      Freq.     Percent        Cum.
------------+-----------------------------------
         -8 |        508        2.25        2.25
         -7 |         45        0.20        2.45
          0 |     20,748       91.86       94.31
          1 |      1,285        5.69      100.00
------------+-----------------------------------
      Total |     22,586      100.00

    Private |
    nursing |
       home |
  insurance |      Freq.     Percent        Cum.
------------+-----------------------------------
         -8 |      1,551        6.87        6.87
         -7 |         58        0.26        7.12
          0 |     16,509       73.09       80.22
          1 |      4,468       19.78      100.00
------------+-----------------------------------
      Total |     22,586      100.00

   w2_moved |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,089       92.83       92.83
          1 |        470        7.17      100.00
------------+-----------------------------------
      Total |      6,559      100.00

   w3_moved |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,061       93.60       93.60
          1 |        346        6.40      100.00
------------+-----------------------------------
      Total |      5,407      100.00

     ht_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         -9 |        810        3.13        3.13
         -1 |      6,522       25.22       28.36
          1 |     18,297       70.77       99.12
          2 |         61        0.24       99.36
          3 |         86        0.33       99.69
          4 |          8        0.03       99.72
         91 |         72        0.28      100.00
------------+-----------------------------------
      Total |     25,856      100.00

             residence |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
          Private Res. |     18,358       78.68       78.68
   Group Home/Facility |        276        1.18       79.86
Mobile Home/Multi-Unit |      4,699       20.14      100.00
-----------------------+-----------------------------------
                 Total |     23,333      100.00

         Living arrangmeent, |
                 categorical |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                       Alone |      7,713       34.15       34.15
         With spouse/partner |      8,522       37.73       71.88
With spouse/partner + others |      2,049        9.07       80.95
                 With others |      4,302       19.05      100.00
-----------------------------+-----------------------------------
                       Total |     22,586      100.00

Lives alone |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,873       65.85       65.85
          1 |      7,713       34.15      100.00
------------+-----------------------------------
      Total |     22,586      100.00

. 
. 
. 
. 
. *********************************************
. log close
      name:  <unnamed>
       log:  E:\nhats\nhats_code\NHATS data setup\logs2_nhats_cleaning.txt
  log type:  text
 closed on:  25 Mar 2016, 14:48:53
--------------------------------------------------------------------------------------------------------
