--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\nhats\nhats_code\NHATS data setup\logs`name'.smcl
  log type:  text
 opened on:  15 Feb 2019, 11:12:45

. 
. 
. 
. *********************************************
. 
. //Does not need to change, unless get new metro file. 
. 
. //7/13/17--add in metro/nonmetro var
. use "E:\nhats\data\NHATS Public\NHATS_Round_1_6_MetNonmet_STATA\NHATS_Round_1_
> 6_MetNonmet.dta", clear

. forvalues w=1/6 {
  2. gen metro_ind`w'=r`w'd==1 if inrange(r`w'd,1,2)
  3. }
(4,182 missing values generated)
(5,352 missing values generated)
(6,628 missing values generated)
(7,690 missing values generated)
(4,093 missing values generated)
(5,151 missing values generated)

. reshape long metro_ind, i(spid) j(wave)
(note: j = 1 2 3 4 5 6)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                    12427   ->   74562
Number of variables                  13   ->       9
j variable (6 values)                     ->   wave
xij variables:
   metro_ind1 metro_ind2 ... metro_ind6   ->   metro_ind
-----------------------------------------------------------------------------

. label var metro_ind "Lives in metropolitan area"

. note metro_ind: From metro non-metro file, r(wave)dmetnomet raw variable. 

. 
. label define metro_ind  0 "Non-Metro" 1 "Metro" 

. label values metro_ind metro_ind

. 
. tempfile metro

. save `metro'
file C:\Users\husaim03\AppData\Local\Temp\9\ST_264314_000001.tmp saved

. 
. cd "${work}"
E:\nhats\data\NHATS working data

. 
. use round_1_$w_clean_helper_added.dta

. merge 1:1 spid wave using `metro', keep(match master) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                         6,312
        from master                     6,312  
        from using                          0  

    matched                            41,466  
    -----------------------------------------

. 
. 
. //1/28/2019-Advance Care Planning based off of Ornstein instructions
. 
end of do-file

. tab eoltalk

   R2 EP1 TALK END OF |
            LIFE CARE |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        190        2.69        2.69
                -8 DK |         15        0.21        2.90
                -7 RF |          7        0.10        3.00
      -1 Inapplicable |      4,870       68.83       71.83
                1 YES |      1,156       16.34       88.17
                 2 NO |        837       11.83      100.00
----------------------+-----------------------------------
                Total |      7,075      100.00

. do "C:\Users\husaim03\AppData\Local\Temp\9\STD264314_000000.tmp"

. 
. gen no_acp=0

. replace no_acp=1 if inlist(ep2eoltalk, 2, -8, -7) & inlist(ep2poweratty, 2, -7
> , -8) & inlist(ep2livngwill, 2, -7, -8)
ep2eoltalk not found
r(111);

end of do-file

r(111);

. do "C:\Users\husaim03\AppData\Local\Temp\9\STD264314_000000.tmp"

. replace no_acp=1 if inlist(eoltalk, 2, -8, -7) & inlist(poweratty, 2, -7, -8) 
> & inlist(livngwill, 2, -7, -8)
(580 real changes made)

. replace no_acp=. if inlist(eoltalk, -1, -9, .) | inlist(poweratty, -1, -9, .) 
> | inlist(livngwill, -1, -9, .) 
(45,763 real changes made, 45,763 to missing)

. note no_acp: Only in Rd2. no_acp=1 if eoltalk=2,-7,-8 & poweratty=2,-7,-8 & li
> vingwill=2,-7,-8. 

. 
end of do-file

. note no_Acp
variable no_Acp not found
r(111);

. note no_acp

no_acp:
  1.  Only in Rd2. no_acp=1 if eoltalk=2,-7,-8 & poweratty=2,-7,-8 &
      livingwill=2,-7,-8.

