--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\nhats\nhats_code\NHATS data setup\logs1a-help_hours_imputation-L
> OG.txt
  log type:  text
 opened on:   5 Feb 2019, 09:23:57

. 
. //PC file paths
. local r1raw "E:\nhats\data\NHATS Public\round_1\"

. local r2raw "E:\nhats\data\NHATS Public\round_2\"

. local r3raw "E:\nhats\data\NHATS Public\round_3\"

. local r4raw "E:\nhats\data\NHATS PUBLIC\round_4\"

. local r5raw "E:\nhats\data\NHATS PUBLIC\round_5\"

. local r6raw "E:\nhats\data\NHATS Public\round_6\"

. local r7raw "E:\nhats\data\NHATS Public\round_7\"

. local work "E:\nhats\data\NHATS working data\"

. local r1s "E:\nhats\data\NHATS Sensitive\r1_sensitive\"

. local r2s "E:\nhats\data\NHATS Sensitive\r2_sensitive\"

. local r3s "E:\nhats\data\NHATS Sensitive\r3_sensitive\"

. local r4s "E:\nhats\data\NHATS Sensitive\r4_sensitive\"

. local r5s "E:\nhats\data\NHATS Sensitive\r5_sensitive\"

. local r6s "E:\nhats\data\NHATS Sensitive\r6_sensitive\"

. local r7s "E:\nhats\data\NHATS Sensitive\r7_sensitive\"

. 
. /* //Rebecca mac file paths
> local r1raw /Users/rebeccagorges/Documents/data/nhats/round_1/
> local r2raw /Users/rebeccagorges/Documents/data/nhats/round_2/
> local r3raw /Users/rebeccagorges/Documents/data/nhats/round_3/
> local work /Users/rebeccagorges/Documents/data/nhats/working
> local r1s /Users/rebeccagorges/Documents/data/nhats/r1_sensitive/
> local r2s /Users/rebeccagorges/Documents/data/nhats/r2_sensitive/ 
>  */
.  
. cd "`work'"
E:\nhats\data\NHATS working data

. 
. **User note: This section can be commented out after run one time to set up da
> tasets
. ********************************************************************
. //combine op and sp data files
. 
. //round 1
. use "`r1raw'NHATS_Round_1_OP_File_v2.dta", clear

. sort spid opid 

. 
. merge m:1 spid using round_1_1.dta //bring in sorted sp ivw dataset

    Result                           # of obs.
    -----------------------------------------
    not matched                           667
        from master                         0  (_merge==1)
        from using                        667  (_merge==2)

    matched                            38,097  (_merge==3)
    -----------------------------------------

. keep if _merge==3 //drop obs with no OP entries
(667 observations deleted)

. save R1_OPSPlinked.dta, replace
file R1_OPSPlinked.dta saved

. 
. //round 2
. use "`r2raw'NHATS_Round_2_OP_File_v2.dta", clear

. sort spid opid

. 
. merge m:1 spid using round_2_1.dta //bring in sorted sp ivw dataset
(label r1dresid already defined)
(label r2dresid already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                           465
        from master                         0  (_merge==1)
        from using                        465  (_merge==2)

    matched                            37,944  (_merge==3)
    -----------------------------------------

. keep if _merge==3 //drop obs with no OP entries
(465 observations deleted)

. save R2_OPSPlinked.dta, replace
file R2_OPSPlinked.dta saved

. 
. //round 3
. use "`r3raw'NHATS_Round_3_OP_File.dta", clear

. sort spid opid

. 
. merge m:1 spid using round_3_1.dta //bring in sorted sp ivw dataset
(label r1dresid already defined)
(label r2dresid already defined)
(label r3dresid already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                           317
        from master                         0  (_merge==1)
        from using                        317  (_merge==2)

    matched                            35,745  (_merge==3)
    -----------------------------------------

. keep if _merge==3 //drop obs with no OP entries
(317 observations deleted)

. save R3_OPSPlinked.dta, replace
file R3_OPSPlinked.dta saved

. 
. //round 4
. use "`r4raw'NHATS_Round_4_OP_File.dta", clear

. sort spid opid

. 
. merge m:1 spid using round_4_1.dta //bring in sorted sp ivw dataset
(label r1dresid already defined)
(label r2dresid already defined)
(label r3dresid already defined)
(label r4dresid already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                           211
        from master                         0  (_merge==1)
        from using                        211  (_merge==2)

    matched                            33,016  (_merge==3)
    -----------------------------------------

. keep if _merge==3 //drop obs with no OP entries
(211 observations deleted)

. save R4_OPSPlinked.dta, replace
file R4_OPSPlinked.dta saved

. 
. //round 5
. use "`r5raw'NHATS_Round_5_OP_File.dta", clear

. sort spid opid

. 
. merge m:1 spid using round_5_1.dta //bring in sorted sp ivw dataset
(label r1dresid already defined)
(label r2dresid already defined)
(label r3dresid already defined)
(label r4dresid already defined)
(label r5dresid already defined)
(label r5dcontnew already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                           394
        from master                         0  (_merge==1)
        from using                        394  (_merge==2)

    matched                            52,285  (_merge==3)
    -----------------------------------------

. keep if _merge==3 //drop obs with no OP entries
(394 observations deleted)

. save R5_OPSPlinked.dta, replace
file R5_OPSPlinked.dta saved

. 
. //round 6
. use "`r6raw'NHATS_Round_6_OP_File.dta", clear

. sort spid opid

. 
. merge m:1 spid using round_6_1.dta //bring in sorted sp ivw dataset
(label r1dresid already defined)
(label r2dresid already defined)
(label r3dresid already defined)
(label r4dresid already defined)
(label r5dresid already defined)
(label r6dresid already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                           284
        from master                         0  (_merge==1)
        from using                        284  (_merge==2)

    matched                            51,174  (_merge==3)
    -----------------------------------------

. keep if _merge==3 //drop obs with no OP entries
(284 observations deleted)

. save R6_OPSPlinked.dta, replace
file R6_OPSPlinked.dta saved

. 
. //round 7
. use "`r7raw'NHATS_Round_7_OP_File.dta", clear

. sort spid opid

. 
. merge m:1 spid using round_7_1.dta //bring in sorted sp ivw dataset
(label r5dcontnew already defined)
(label r1dresid already defined)
(label r2dresid already defined)
(label r3dresid already defined)
(label r4dresid already defined)
(label r5dresid already defined)
(label r6dresid already defined)
(label r7dresid already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                           189
        from master                         0  (_merge==1)
        from using                        189  (_merge==2)

    matched                            49,065  (_merge==3)
    -----------------------------------------

. keep if _merge==3 //drop obs with no OP entries
(189 observations deleted)

. save R7_OPSPlinked.dta, replace
file R7_OPSPlinked.dta saved

. 
. foreach w in 1 2 3 4 5 6 7{
  2.         use R`w'_OPSPlinked.dta
  3.         
. //now create limited datasets for each wave with only needed variables
. local keeplist spid op* wave  w`w'anfinwgt0 w`w'varstrat w`w'varunit r`w'dresi
> d ///
>  mo`w'douthelp mo`w'dinsdhelp mo`w'dbedhelp sc`w'deathelp sc`w'dbathhelp ///
>  sc`w'dtoilhelp sc`w'ddreshelp ha`w'dlaunreas ha`w'dshopreas ha`w'dmealreas //
> /
>  ha`w'dbankreas mc`w'dmedsreas w`w'an2011wgt0 w`w'tr2011wgt0 w`w'tran
  4.  
.         capture keep `keeplist'
  5.         save R`w'_OPSPltd.dta, replace
  6. }
file R1_OPSPltd.dta saved
file R2_OPSPltd.dta saved
file R3_OPSPltd.dta saved
file R4_OPSPltd.dta saved
file R5_OPSPltd.dta saved
file R6_OPSPltd.dta saved
file R7_OPSPltd.dta saved

. 
. ********************************************************************
. //merge into single file for initial setup
. use R1_OPSPltd.dta, clear

. append using R2_OPSPltd.dta
(label r1dresid already defined)
(label op1proxy already defined)
(label op1relatnshp already defined)
(label op1gender already defined)
(label op1spouprtnr already defined)
(label op1leveledu already defined)
(label op1prsninhh already defined)
(label op1childinhh already defined)
(label op1dage already defined)
(label op1chnotinhh already defined)
(label op1martlstat already defined)
(label op1numchldrn already defined)
(label op1anychdu18 already defined)
(label op1numchdu18 already defined)
(label op1soclntwrk already defined)
(label op1dcatgryag already defined)
(label op1dsocwrkfl already defined)
(label op1outhlp already defined)
(label op1insdhlp already defined)
(label op1bedhlp already defined)
(label op1tkplhlp1 already defined)
(label op1tkplhlp2 already defined)
(label op1launhlp already defined)
(label op1shophlp already defined)
(label op1mealhlp already defined)
(label op1bankhlp already defined)
(label op1moneyhlp already defined)
(label op1eathlp already defined)
(label op1bathhlp already defined)
(label op1toilhlp already defined)
(label op1dreshlp already defined)
(label op1medshlp already defined)
(label op1dochlp already defined)
(label op1dochlpmst already defined)
(label op1insurhlp already defined)
(label op1spcaredfr already defined)
(label op1chhlpfin already defined)
(label op1hlpchfin already defined)
(label op1ishelper already defined)
(label op1helpsched already defined)
(label op1numdayswk already defined)
(label op1numdaysmn already defined)
(label op1numhrsday already defined)
(label op1paidhelpr already defined)
(label op1sppayshlp already defined)
(label op1govpayhlp already defined)
(label op1inspayhlp already defined)
(label op1othpayhlp already defined)
(label op1payunit already defined)
(label op1hourlypay already defined)
(label op1weeklypay already defined)
(label op1monthlypy already defined)
(label op1progmpaid already defined)
(label op1dhrsmth already defined)
(label op1contctflg already defined)
(label op1dflmiss already defined)
(label op1dmissadd already defined)
(label op1dprobdup already defined)
(label _merge already defined)

. append using R3_OPSPltd.dta
(label r2dresid already defined)
(label r1dresid already defined)
(label op2proxy already defined)
(label op2relatnshp already defined)
(label op2drelatfl already defined)
(label op2dgender already defined)
(label op2prsninhh already defined)
(label op2dage already defined)
(label op2dagefl already defined)
(label op2dgenderfl already defined)
(label op2spouprtnr already defined)
(label op2nwspouprt already defined)
(label op2eduspo already defined)
(label op2leveledu already defined)
(label op2childinhh already defined)
(label op2reasgone already defined)
(label op2dspoudec already defined)
(label op2ddeceased already defined)
(label op2chnotinhh already defined)
(label op2educhild already defined)
(label op2martlstat already defined)
(label op2numchldrn already defined)
(label op2anychdu18 already defined)
(label op2numchdu18 already defined)
(label op2dchilddec already defined)
(label op2soclntwrk already defined)
(label op2dsocwrkfl already defined)
(label op2outhlp already defined)
(label op2insdhlp already defined)
(label op2bedhlp already defined)
(label op2tkplhlp1 already defined)
(label op2tkplhlp2 already defined)
(label op2launhlp already defined)
(label op2shophlp already defined)
(label op2mealhlp already defined)
(label op2bankhlp already defined)
(label op2moneyhlp already defined)
(label op2eathlp already defined)
(label op2bathhlp already defined)
(label op2toilhlp already defined)
(label op2dreshlp already defined)
(label op2medshlp already defined)
(label op2dochlp already defined)
(label op2dochlpmst already defined)
(label op2insurhlp already defined)
(label op2spcaredfr already defined)
(label op2chhlpfin already defined)
(label op2hlpchfin already defined)
(label op2ishelper already defined)
(label op2helpsched already defined)
(label op2numdayswk already defined)
(label op2numdaysmn already defined)
(label op2numhrsday already defined)
(label op2paidhelpr already defined)
(label op2sppayshlp already defined)
(label op2govpayhlp already defined)
(label op2inspayhlp already defined)
(label op2othpayhlp already defined)
(label op2payunit already defined)
(label op2hourlypay already defined)
(label op2weeklypay already defined)
(label op2monthlypy already defined)
(label op2progmpaid already defined)
(label op2dhrsmth already defined)
(label op2contctflg already defined)
(label op2dflmiss already defined)
(label op2dmissadd already defined)
(label op2dprobdup already defined)
(label op2ddiffop already defined)
(label op1proxy already defined)
(label op1relatnshp already defined)
(label op1gender already defined)
(label op1spouprtnr already defined)
(label op1leveledu already defined)
(label op1prsninhh already defined)
(label op1childinhh already defined)
(label op1dage already defined)
(label op1chnotinhh already defined)
(label op1martlstat already defined)
(label op1numchldrn already defined)
(label op1anychdu18 already defined)
(label op1numchdu18 already defined)
(label op1soclntwrk already defined)
(label op1dcatgryag already defined)
(label op1dsocwrkfl already defined)
(label op1outhlp already defined)
(label op1insdhlp already defined)
(label op1bedhlp already defined)
(label op1tkplhlp1 already defined)
(label op1tkplhlp2 already defined)
(label op1launhlp already defined)
(label op1shophlp already defined)
(label op1mealhlp already defined)
(label op1bankhlp already defined)
(label op1moneyhlp already defined)
(label op1eathlp already defined)
(label op1bathhlp already defined)
(label op1toilhlp already defined)
(label op1dreshlp already defined)
(label op1medshlp already defined)
(label op1dochlp already defined)
(label op1dochlpmst already defined)
(label op1insurhlp already defined)
(label op1spcaredfr already defined)
(label op1chhlpfin already defined)
(label op1hlpchfin already defined)
(label op1ishelper already defined)
(label op1helpsched already defined)
(label op1numdayswk already defined)
(label op1numdaysmn already defined)
(label op1numhrsday already defined)
(label op1paidhelpr already defined)
(label op1sppayshlp already defined)
(label op1govpayhlp already defined)
(label op1inspayhlp already defined)
(label op1othpayhlp already defined)
(label op1payunit already defined)
(label op1hourlypay already defined)
(label op1weeklypay already defined)
(label op1monthlypy already defined)
(label op1progmpaid already defined)
(label op1dhrsmth already defined)
(label op1contctflg already defined)
(label op1dflmiss already defined)
(label op1dmissadd already defined)
(label op1dprobdup already defined)
(label pa1dv2favact already defined)
(label fl1dneverdrv already defined)
(label rl1dracehisp already defined)
(label r1dgender already defined)
(label _merge already defined)

. append using R4_OPSPltd.dta
(label r3dresid already defined)
(label r2dresid already defined)
(label r1dresid already defined)
(label op3proxy already defined)
(label op3relatnshp already defined)
(label op3drelatfl already defined)
(label op3drelflro already defined)
(label op3dgender already defined)
(label op3prsninhh already defined)
(label op3dage already defined)
(label op3dagefl already defined)
(label op3dageflro already defined)
(label op3dgenderfl already defined)
(label op3dgenderflro already defined)
(label op3spouprtnr already defined)
(label op3nwspouprt already defined)
(label op3eduspo already defined)
(label op3leveledu already defined)
(label op3childinhh already defined)
(label op3reasgone already defined)
(label op3dspoudec already defined)
(label op3ddeceased already defined)
(label op3chnotinhh already defined)
(label op3educhild already defined)
(label op3martlstat already defined)
(label op3numchldrn already defined)
(label op3anychdu18 already defined)
(label op3numchdu18 already defined)
(label op3dchilddec already defined)
(label op3dchldedit already defined)
(label op3soclntwrk already defined)
(label op3dsocwrkfl already defined)
(label op3outhlp already defined)
(label op3insdhlp already defined)
(label op3bedhlp already defined)
(label op3tkplhlp1 already defined)
(label op3tkplhlp2 already defined)
(label op3launhlp already defined)
(label op3shophlp already defined)
(label op3mealhlp already defined)
(label op3bankhlp already defined)
(label op3moneyhlp already defined)
(label op3eathlp already defined)
(label op3bathhlp already defined)
(label op3toilhlp already defined)
(label op3dreshlp already defined)
(label op3medshlp already defined)
(label op3dochlp already defined)
(label op3dochlpmst already defined)
(label op3insurhlp already defined)
(label op3spcaredfr already defined)
(label op3chhlpfin already defined)
(label op3hlpchfin already defined)
(label op3ishelper already defined)
(label op3helpsched already defined)
(label op3numdayswk already defined)
(label op3numdaysmn already defined)
(label op3numhrsday already defined)
(label op3paidhelpr already defined)
(label op3sppayshlp already defined)
(label op3govpayhlp already defined)
(label op3inspayhlp already defined)
(label op3othpayhlp already defined)
(label op3payunit already defined)
(label op3hourlypay already defined)
(label op3weeklypay already defined)
(label op3monthlypy already defined)
(label op3progmpaid already defined)
(label op3dhrsmth already defined)
(label op3contctflg already defined)
(label op3dflmiss already defined)
(label op3dmissadd already defined)
(label op3dprobdup already defined)
(label op3ddiffop already defined)
(label op2proxy already defined)
(label op2relatnshp already defined)
(label op2drelatfl already defined)
(label op2dgender already defined)
(label op2prsninhh already defined)
(label op2dage already defined)
(label op2dagefl already defined)
(label op2dgenderfl already defined)
(label op2spouprtnr already defined)
(label op2nwspouprt already defined)
(label op2eduspo already defined)
(label op2leveledu already defined)
(label op2childinhh already defined)
(label op2reasgone already defined)
(label op2dspoudec already defined)
(label op2ddeceased already defined)
(label op2chnotinhh already defined)
(label op2educhild already defined)
(label op2martlstat already defined)
(label op2numchldrn already defined)
(label op2anychdu18 already defined)
(label op2numchdu18 already defined)
(label op2dchilddec already defined)
(label op2soclntwrk already defined)
(label op2dsocwrkfl already defined)
(label op2outhlp already defined)
(label op2insdhlp already defined)
(label op2bedhlp already defined)
(label op2tkplhlp1 already defined)
(label op2tkplhlp2 already defined)
(label op2launhlp already defined)
(label op2shophlp already defined)
(label op2mealhlp already defined)
(label op2bankhlp already defined)
(label op2moneyhlp already defined)
(label op2eathlp already defined)
(label op2bathhlp already defined)
(label op2toilhlp already defined)
(label op2dreshlp already defined)
(label op2medshlp already defined)
(label op2dochlp already defined)
(label op2dochlpmst already defined)
(label op2insurhlp already defined)
(label op2spcaredfr already defined)
(label op2chhlpfin already defined)
(label op2hlpchfin already defined)
(label op2ishelper already defined)
(label op2helpsched already defined)
(label op2numdayswk already defined)
(label op2numdaysmn already defined)
(label op2numhrsday already defined)
(label op2paidhelpr already defined)
(label op2sppayshlp already defined)
(label op2govpayhlp already defined)
(label op2inspayhlp already defined)
(label op2othpayhlp already defined)
(label op2payunit already defined)
(label op2hourlypay already defined)
(label op2weeklypay already defined)
(label op2monthlypy already defined)
(label op2progmpaid already defined)
(label op2dhrsmth already defined)
(label op2contctflg already defined)
(label op2dflmiss already defined)
(label op2dmissadd already defined)
(label op2dprobdup already defined)
(label op2ddiffop already defined)
(label op1proxy already defined)
(label op1relatnshp already defined)
(label op1gender already defined)
(label op1spouprtnr already defined)
(label op1leveledu already defined)
(label op1prsninhh already defined)
(label op1childinhh already defined)
(label op1dage already defined)
(label op1chnotinhh already defined)
(label op1martlstat already defined)
(label op1numchldrn already defined)
(label op1anychdu18 already defined)
(label op1numchdu18 already defined)
(label op1soclntwrk already defined)
(label op1dcatgryag already defined)
(label op1dsocwrkfl already defined)
(label op1outhlp already defined)
(label op1insdhlp already defined)
(label op1bedhlp already defined)
(label op1tkplhlp1 already defined)
(label op1tkplhlp2 already defined)
(label op1launhlp already defined)
(label op1shophlp already defined)
(label op1mealhlp already defined)
(label op1bankhlp already defined)
(label op1moneyhlp already defined)
(label op1eathlp already defined)
(label op1bathhlp already defined)
(label op1toilhlp already defined)
(label op1dreshlp already defined)
(label op1medshlp already defined)
(label op1dochlp already defined)
(label op1dochlpmst already defined)
(label op1insurhlp already defined)
(label op1spcaredfr already defined)
(label op1chhlpfin already defined)
(label op1hlpchfin already defined)
(label op1ishelper already defined)
(label op1helpsched already defined)
(label op1numdayswk already defined)
(label op1numdaysmn already defined)
(label op1numhrsday already defined)
(label op1paidhelpr already defined)
(label op1sppayshlp already defined)
(label op1govpayhlp already defined)
(label op1inspayhlp already defined)
(label op1othpayhlp already defined)
(label op1payunit already defined)
(label op1hourlypay already defined)
(label op1weeklypay already defined)
(label op1monthlypy already defined)
(label op1progmpaid already defined)
(label op1dhrsmth already defined)
(label op1contctflg already defined)
(label op1dflmiss already defined)
(label op1dmissadd already defined)
(label op1dprobdup already defined)
(label pa1dv2favact already defined)
(label fl1dneverdrv already defined)
(label rl1dracehisp already defined)
(label r1dgender already defined)
(label _merge already defined)

. append using R5_OPSPltd.dta
(label r4dresid already defined)
(label r3dresid already defined)
(label r2dresid already defined)
(label r1dresid already defined)
(label op4proxy already defined)
(label op4relatnshp already defined)
(label op4drelatfl already defined)
(label op4drelflro already defined)
(label op4dgender already defined)
(label op4prsninhh already defined)
(label op4dage already defined)
(label op4dagefl already defined)
(label op4dageflro already defined)
(label op4dgenderfl already defined)
(label op4dgenderflro already defined)
(label op4spouprtnr already defined)
(label op4nwspouprt already defined)
(label op4eduspo already defined)
(label op4leveledu already defined)
(label op4childinhh already defined)
(label op4reasgone already defined)
(label op4dspoudec already defined)
(label op4ddeceased already defined)
(label op4chnotinhh already defined)
(label op4educhild already defined)
(label op4martlstat already defined)
(label op4numchldrn already defined)
(label op4anychdu18 already defined)
(label op4numchdu18 already defined)
(label op4dchilddec already defined)
(label op4dchldedit already defined)
(label op4soclntwrk already defined)
(label op4dsocwrkfl already defined)
(label op4outhlp already defined)
(label op4insdhlp already defined)
(label op4bedhlp already defined)
(label op4tkplhlp1 already defined)
(label op4tkplhlp2 already defined)
(label op4launhlp already defined)
(label op4shophlp already defined)
(label op4mealhlp already defined)
(label op4bankhlp already defined)
(label op4moneyhlp already defined)
(label op4eathlp already defined)
(label op4bathhlp already defined)
(label op4toilhlp already defined)
(label op4dreshlp already defined)
(label op4medshlp already defined)
(label op4dochlp already defined)
(label op4dochlpmst already defined)
(label op4insurhlp already defined)
(label op4spcaredfr already defined)
(label op4chhlpfin already defined)
(label op4hlpchfin already defined)
(label op4ishelper already defined)
(label op4helpsched already defined)
(label op4numdayswk already defined)
(label op4numdaysmn already defined)
(label op4numhrsday already defined)
(label op4paidhelpr already defined)
(label op4sppayshlp already defined)
(label op4govpayhlp already defined)
(label op4inspayhlp already defined)
(label op4othpayhlp already defined)
(label op4payunit already defined)
(label op4hourlypay already defined)
(label op4weeklypay already defined)
(label op4monthlypy already defined)
(label op4progmpaid already defined)
(label op4dhrsmth already defined)
(label op4contctflg already defined)
(label op4dflmiss already defined)
(label op4dmissadd already defined)
(label op4dprobdup already defined)
(label op4ddiffop already defined)
(label op3proxy already defined)
(label op3relatnshp already defined)
(label op3drelatfl already defined)
(label op3drelflro already defined)
(label op3dgender already defined)
(label op3prsninhh already defined)
(label op3dage already defined)
(label op3dagefl already defined)
(label op3dageflro already defined)
(label op3dgenderfl already defined)
(label op3dgenderflro already defined)
(label op3spouprtnr already defined)
(label op3nwspouprt already defined)
(label op3eduspo already defined)
(label op3leveledu already defined)
(label op3childinhh already defined)
(label op3reasgone already defined)
(label op3dspoudec already defined)
(label op3ddeceased already defined)
(label op3chnotinhh already defined)
(label op3educhild already defined)
(label op3martlstat already defined)
(label op3numchldrn already defined)
(label op3anychdu18 already defined)
(label op3numchdu18 already defined)
(label op3dchilddec already defined)
(label op3dchldedit already defined)
(label op3soclntwrk already defined)
(label op3dsocwrkfl already defined)
(label op3outhlp already defined)
(label op3insdhlp already defined)
(label op3bedhlp already defined)
(label op3tkplhlp1 already defined)
(label op3tkplhlp2 already defined)
(label op3launhlp already defined)
(label op3shophlp already defined)
(label op3mealhlp already defined)
(label op3bankhlp already defined)
(label op3moneyhlp already defined)
(label op3eathlp already defined)
(label op3bathhlp already defined)
(label op3toilhlp already defined)
(label op3dreshlp already defined)
(label op3medshlp already defined)
(label op3dochlp already defined)
(label op3dochlpmst already defined)
(label op3insurhlp already defined)
(label op3spcaredfr already defined)
(label op3chhlpfin already defined)
(label op3hlpchfin already defined)
(label op3ishelper already defined)
(label op3helpsched already defined)
(label op3numdayswk already defined)
(label op3numdaysmn already defined)
(label op3numhrsday already defined)
(label op3paidhelpr already defined)
(label op3sppayshlp already defined)
(label op3govpayhlp already defined)
(label op3inspayhlp already defined)
(label op3othpayhlp already defined)
(label op3payunit already defined)
(label op3hourlypay already defined)
(label op3weeklypay already defined)
(label op3monthlypy already defined)
(label op3progmpaid already defined)
(label op3dhrsmth already defined)
(label op3contctflg already defined)
(label op3dflmiss already defined)
(label op3dmissadd already defined)
(label op3dprobdup already defined)
(label op3ddiffop already defined)
(label op2proxy already defined)
(label op2relatnshp already defined)
(label op2drelatfl already defined)
(label op2dgender already defined)
(label op2prsninhh already defined)
(label op2dage already defined)
(label op2dagefl already defined)
(label op2dgenderfl already defined)
(label op2spouprtnr already defined)
(label op2nwspouprt already defined)
(label op2eduspo already defined)
(label op2leveledu already defined)
(label op2childinhh already defined)
(label op2reasgone already defined)
(label op2dspoudec already defined)
(label op2ddeceased already defined)
(label op2chnotinhh already defined)
(label op2educhild already defined)
(label op2martlstat already defined)
(label op2numchldrn already defined)
(label op2anychdu18 already defined)
(label op2numchdu18 already defined)
(label op2dchilddec already defined)
(label op2soclntwrk already defined)
(label op2dsocwrkfl already defined)
(label op2outhlp already defined)
(label op2insdhlp already defined)
(label op2bedhlp already defined)
(label op2tkplhlp1 already defined)
(label op2tkplhlp2 already defined)
(label op2launhlp already defined)
(label op2shophlp already defined)
(label op2mealhlp already defined)
(label op2bankhlp already defined)
(label op2moneyhlp already defined)
(label op2eathlp already defined)
(label op2bathhlp already defined)
(label op2toilhlp already defined)
(label op2dreshlp already defined)
(label op2medshlp already defined)
(label op2dochlp already defined)
(label op2dochlpmst already defined)
(label op2insurhlp already defined)
(label op2spcaredfr already defined)
(label op2chhlpfin already defined)
(label op2hlpchfin already defined)
(label op2ishelper already defined)
(label op2helpsched already defined)
(label op2numdayswk already defined)
(label op2numdaysmn already defined)
(label op2numhrsday already defined)
(label op2paidhelpr already defined)
(label op2sppayshlp already defined)
(label op2govpayhlp already defined)
(label op2inspayhlp already defined)
(label op2othpayhlp already defined)
(label op2payunit already defined)
(label op2hourlypay already defined)
(label op2weeklypay already defined)
(label op2monthlypy already defined)
(label op2progmpaid already defined)
(label op2dhrsmth already defined)
(label op2contctflg already defined)
(label op2dflmiss already defined)
(label op2dmissadd already defined)
(label op2dprobdup already defined)
(label op2ddiffop already defined)
(label op1proxy already defined)
(label op1relatnshp already defined)
(label op1gender already defined)
(label op1spouprtnr already defined)
(label op1leveledu already defined)
(label op1prsninhh already defined)
(label op1childinhh already defined)
(label op1dage already defined)
(label op1chnotinhh already defined)
(label op1martlstat already defined)
(label op1numchldrn already defined)
(label op1anychdu18 already defined)
(label op1numchdu18 already defined)
(label op1soclntwrk already defined)
(label op1dcatgryag already defined)
(label op1dsocwrkfl already defined)
(label op1outhlp already defined)
(label op1insdhlp already defined)
(label op1bedhlp already defined)
(label op1tkplhlp1 already defined)
(label op1tkplhlp2 already defined)
(label op1launhlp already defined)
(label op1shophlp already defined)
(label op1mealhlp already defined)
(label op1bankhlp already defined)
(label op1moneyhlp already defined)
(label op1eathlp already defined)
(label op1bathhlp already defined)
(label op1toilhlp already defined)
(label op1dreshlp already defined)
(label op1medshlp already defined)
(label op1dochlp already defined)
(label op1dochlpmst already defined)
(label op1insurhlp already defined)
(label op1spcaredfr already defined)
(label op1chhlpfin already defined)
(label op1hlpchfin already defined)
(label op1ishelper already defined)
(label op1helpsched already defined)
(label op1numdayswk already defined)
(label op1numdaysmn already defined)
(label op1numhrsday already defined)
(label op1paidhelpr already defined)
(label op1sppayshlp already defined)
(label op1govpayhlp already defined)
(label op1inspayhlp already defined)
(label op1othpayhlp already defined)
(label op1payunit already defined)
(label op1hourlypay already defined)
(label op1weeklypay already defined)
(label op1monthlypy already defined)
(label op1progmpaid already defined)
(label op1dhrsmth already defined)
(label op1contctflg already defined)
(label op1dflmiss already defined)
(label op1dmissadd already defined)
(label op1dprobdup already defined)
(label pa1dv2favact already defined)
(label _merge already defined)

. append using R6_OPSPltd.dta
(label r5dresid already defined)
(label r4dresid already defined)
(label r3dresid already defined)
(label r2dresid already defined)
(label r1dresid already defined)
(label op5proxy already defined)
(label op5relatnshp already defined)
(label op5drelatfl already defined)
(label op5drelflro already defined)
(label op5dgender already defined)
(label op5prsninhh already defined)
(label op5dage already defined)
(label op5dagefl already defined)
(label op5dageflro already defined)
(label op5dgenderfl already defined)
(label op5dgenderflro already defined)
(label op5spouprtnr already defined)
(label op5nwspouprt already defined)
(label op5eduspo already defined)
(label op5leveledu already defined)
(label op5childinhh already defined)
(label op5reasgone already defined)
(label op5dspoudec already defined)
(label op5ddeceased already defined)
(label op5chnotinhh already defined)
(label op5educhild already defined)
(label op5martlstat already defined)
(label op5numchldrn already defined)
(label op5anychdu18 already defined)
(label op5numchdu18 already defined)
(label op5dchldedit already defined)
(label op5soclntwrk already defined)
(label op5dsocwrkfl already defined)
(label op5outhlp already defined)
(label op5insdhlp already defined)
(label op5bedhlp already defined)
(label op5tkplhlp1 already defined)
(label op5tkplhlp2 already defined)
(label op5launhlp already defined)
(label op5shophlp already defined)
(label op5mealhlp already defined)
(label op5bankhlp already defined)
(label op5moneyhlp already defined)
(label op5eathlp already defined)
(label op5bathhlp already defined)
(label op5toilhlp already defined)
(label op5dreshlp already defined)
(label op5medshlp already defined)
(label op5dochlp already defined)
(label op5dochlpmst already defined)
(label op5insurhlp already defined)
(label op5spcaredfr already defined)
(label op5chhlpfin already defined)
(label op5hlpchfin already defined)
(label op5ishelper already defined)
(label op5helpsched already defined)
(label op5numdayswk already defined)
(label op5numdaysmn already defined)
(label op5numhrsday already defined)
(label op5paidhelpr already defined)
(label op5sppayshlp already defined)
(label op5govpayhlp already defined)
(label op5inspayhlp already defined)
(label op5othpayhlp already defined)
(label op5payunit already defined)
(label op5hourlypay already defined)
(label op5weeklypay already defined)
(label op5monthlypy already defined)
(label op5progmpaid already defined)
(label op5dhrsmth already defined)
(label op5contctflg already defined)
(label op5dflmiss already defined)
(label op5dmissadd already defined)
(label op5dprobdup already defined)
(label op5ddiffop already defined)
(label op4proxy already defined)
(label op4relatnshp already defined)
(label op4drelatfl already defined)
(label op4drelflro already defined)
(label op4dgender already defined)
(label op4prsninhh already defined)
(label op4dage already defined)
(label op4dagefl already defined)
(label op4dageflro already defined)
(label op4dgenderfl already defined)
(label op4dgenderflro already defined)
(label op4spouprtnr already defined)
(label op4nwspouprt already defined)
(label op4eduspo already defined)
(label op4leveledu already defined)
(label op4childinhh already defined)
(label op4reasgone already defined)
(label op4dspoudec already defined)
(label op4ddeceased already defined)
(label op4chnotinhh already defined)
(label op4educhild already defined)
(label op4martlstat already defined)
(label op4numchldrn already defined)
(label op4anychdu18 already defined)
(label op4numchdu18 already defined)
(label op4dchilddec already defined)
(label op4dchldedit already defined)
(label op4soclntwrk already defined)
(label op4dsocwrkfl already defined)
(label op4outhlp already defined)
(label op4insdhlp already defined)
(label op4bedhlp already defined)
(label op4tkplhlp1 already defined)
(label op4tkplhlp2 already defined)
(label op4launhlp already defined)
(label op4shophlp already defined)
(label op4mealhlp already defined)
(label op4bankhlp already defined)
(label op4moneyhlp already defined)
(label op4eathlp already defined)
(label op4bathhlp already defined)
(label op4toilhlp already defined)
(label op4dreshlp already defined)
(label op4medshlp already defined)
(label op4dochlp already defined)
(label op4dochlpmst already defined)
(label op4insurhlp already defined)
(label op4spcaredfr already defined)
(label op4chhlpfin already defined)
(label op4hlpchfin already defined)
(label op4ishelper already defined)
(label op4helpsched already defined)
(label op4numdayswk already defined)
(label op4numdaysmn already defined)
(label op4numhrsday already defined)
(label op4paidhelpr already defined)
(label op4sppayshlp already defined)
(label op4govpayhlp already defined)
(label op4inspayhlp already defined)
(label op4othpayhlp already defined)
(label op4payunit already defined)
(label op4hourlypay already defined)
(label op4weeklypay already defined)
(label op4monthlypy already defined)
(label op4progmpaid already defined)
(label op4dhrsmth already defined)
(label op4contctflg already defined)
(label op4dflmiss already defined)
(label op4dmissadd already defined)
(label op4dprobdup already defined)
(label op4ddiffop already defined)
(label op3proxy already defined)
(label op3relatnshp already defined)
(label op3drelatfl already defined)
(label op3drelflro already defined)
(label op3dgender already defined)
(label op3prsninhh already defined)
(label op3dage already defined)
(label op3dagefl already defined)
(label op3dageflro already defined)
(label op3dgenderfl already defined)
(label op3dgenderflro already defined)
(label op3spouprtnr already defined)
(label op3nwspouprt already defined)
(label op3eduspo already defined)
(label op3leveledu already defined)
(label op3childinhh already defined)
(label op3reasgone already defined)
(label op3dspoudec already defined)
(label op3ddeceased already defined)
(label op3chnotinhh already defined)
(label op3educhild already defined)
(label op3martlstat already defined)
(label op3numchldrn already defined)
(label op3anychdu18 already defined)
(label op3numchdu18 already defined)
(label op3dchilddec already defined)
(label op3dchldedit already defined)
(label op3soclntwrk already defined)
(label op3dsocwrkfl already defined)
(label op3outhlp already defined)
(label op3insdhlp already defined)
(label op3bedhlp already defined)
(label op3tkplhlp1 already defined)
(label op3tkplhlp2 already defined)
(label op3launhlp already defined)
(label op3shophlp already defined)
(label op3mealhlp already defined)
(label op3bankhlp already defined)
(label op3moneyhlp already defined)
(label op3eathlp already defined)
(label op3bathhlp already defined)
(label op3toilhlp already defined)
(label op3dreshlp already defined)
(label op3medshlp already defined)
(label op3dochlp already defined)
(label op3dochlpmst already defined)
(label op3insurhlp already defined)
(label op3spcaredfr already defined)
(label op3chhlpfin already defined)
(label op3hlpchfin already defined)
(label op3ishelper already defined)
(label op3helpsched already defined)
(label op3numdayswk already defined)
(label op3numdaysmn already defined)
(label op3numhrsday already defined)
(label op3paidhelpr already defined)
(label op3sppayshlp already defined)
(label op3govpayhlp already defined)
(label op3inspayhlp already defined)
(label op3othpayhlp already defined)
(label op3payunit already defined)
(label op3hourlypay already defined)
(label op3weeklypay already defined)
(label op3monthlypy already defined)
(label op3progmpaid already defined)
(label op3dhrsmth already defined)
(label op3contctflg already defined)
(label op3dflmiss already defined)
(label op3dmissadd already defined)
(label op3dprobdup already defined)
(label op3ddiffop already defined)
(label op2proxy already defined)
(label op2relatnshp already defined)
(label op2drelatfl already defined)
(label op2dgender already defined)
(label op2prsninhh already defined)
(label op2dage already defined)
(label op2dagefl already defined)
(label op2dgenderfl already defined)
(label op2spouprtnr already defined)
(label op2nwspouprt already defined)
(label op2eduspo already defined)
(label op2leveledu already defined)
(label op2childinhh already defined)
(label op2reasgone already defined)
(label op2dspoudec already defined)
(label op2ddeceased already defined)
(label op2chnotinhh already defined)
(label op2educhild already defined)
(label op2martlstat already defined)
(label op2numchldrn already defined)
(label op2anychdu18 already defined)
(label op2numchdu18 already defined)
(label op2dchilddec already defined)
(label op2soclntwrk already defined)
(label op2dsocwrkfl already defined)
(label op2outhlp already defined)
(label op2insdhlp already defined)
(label op2bedhlp already defined)
(label op2tkplhlp1 already defined)
(label op2tkplhlp2 already defined)
(label op2launhlp already defined)
(label op2shophlp already defined)
(label op2mealhlp already defined)
(label op2bankhlp already defined)
(label op2moneyhlp already defined)
(label op2eathlp already defined)
(label op2bathhlp already defined)
(label op2toilhlp already defined)
(label op2dreshlp already defined)
(label op2medshlp already defined)
(label op2dochlp already defined)
(label op2dochlpmst already defined)
(label op2insurhlp already defined)
(label op2spcaredfr already defined)
(label op2chhlpfin already defined)
(label op2hlpchfin already defined)
(label op2ishelper already defined)
(label op2helpsched already defined)
(label op2numdayswk already defined)
(label op2numdaysmn already defined)
(label op2numhrsday already defined)
(label op2paidhelpr already defined)
(label op2sppayshlp already defined)
(label op2govpayhlp already defined)
(label op2inspayhlp already defined)
(label op2othpayhlp already defined)
(label op2payunit already defined)
(label op2hourlypay already defined)
(label op2weeklypay already defined)
(label op2monthlypy already defined)
(label op2progmpaid already defined)
(label op2dhrsmth already defined)
(label op2contctflg already defined)
(label op2dflmiss already defined)
(label op2dmissadd already defined)
(label op2dprobdup already defined)
(label op2ddiffop already defined)
(label op1proxy already defined)
(label op1relatnshp already defined)
(label op1gender already defined)
(label op1spouprtnr already defined)
(label op1leveledu already defined)
(label op1prsninhh already defined)
(label op1childinhh already defined)
(label op1dage already defined)
(label op1chnotinhh already defined)
(label op1martlstat already defined)
(label op1numchldrn already defined)
(label op1anychdu18 already defined)
(label op1numchdu18 already defined)
(label op1soclntwrk already defined)
(label op1dcatgryag already defined)
(label op1dsocwrkfl already defined)
(label op1outhlp already defined)
(label op1insdhlp already defined)
(label op1bedhlp already defined)
(label op1tkplhlp1 already defined)
(label op1tkplhlp2 already defined)
(label op1launhlp already defined)
(label op1shophlp already defined)
(label op1mealhlp already defined)
(label op1bankhlp already defined)
(label op1moneyhlp already defined)
(label op1eathlp already defined)
(label op1bathhlp already defined)
(label op1toilhlp already defined)
(label op1dreshlp already defined)
(label op1medshlp already defined)
(label op1dochlp already defined)
(label op1dochlpmst already defined)
(label op1insurhlp already defined)
(label op1spcaredfr already defined)
(label op1chhlpfin already defined)
(label op1hlpchfin already defined)
(label op1ishelper already defined)
(label op1helpsched already defined)
(label op1numdayswk already defined)
(label op1numdaysmn already defined)
(label op1numhrsday already defined)
(label op1paidhelpr already defined)
(label op1sppayshlp already defined)
(label op1govpayhlp already defined)
(label op1inspayhlp already defined)
(label op1othpayhlp already defined)
(label op1payunit already defined)
(label op1hourlypay already defined)
(label op1weeklypay already defined)
(label op1monthlypy already defined)
(label op1progmpaid already defined)
(label op1dhrsmth already defined)
(label op1contctflg already defined)
(label op1dflmiss already defined)
(label op1dmissadd already defined)
(label op1dprobdup already defined)
(label pa5dfavact already defined)
(label fl5dneverdrv already defined)
(label rl5dracehisp already defined)
(label r5dgender already defined)
(label _merge already defined)

. append using R7_OPSPltd.dta
(label r6dresid already defined)
(label r5dresid already defined)
(label r4dresid already defined)
(label r3dresid already defined)
(label r2dresid already defined)
(label r1dresid already defined)
(label r5dcontnew already defined)
(label op6proxy already defined)
(label op6relatnshp already defined)
(label op6drelatfl already defined)
(label op6drelflro already defined)
(label op6dgender already defined)
(label op6prsninhh already defined)
(label op6dage already defined)
(label op6dagefl already defined)
(label op6dageflro already defined)
(label op6dgenderfl already defined)
(label op6dgenderflro already defined)
(label op6spouprtnr already defined)
(label op6nwspouprt already defined)
(label op6eduspo already defined)
(label op6leveledu already defined)
(label op6childinhh already defined)
(label op6reasgone already defined)
(label op6dspoudec already defined)
(label op6ddeceased already defined)
(label op6chnotinhh already defined)
(label op6educhild already defined)
(label op6martlstat already defined)
(label op6numchldrn already defined)
(label op6anychdu18 already defined)
(label op6numchdu18 already defined)
(label op6dchldedit already defined)
(label op6soclntwrk already defined)
(label op6dcatgryag already defined)
(label op6dsocwrkfl already defined)
(label op6outhlp already defined)
(label op6insdhlp already defined)
(label op6bedhlp already defined)
(label op6tkplhlp1 already defined)
(label op6tkplhlp2 already defined)
(label op6launhlp already defined)
(label op6shophlp already defined)
(label op6mealhlp already defined)
(label op6bankhlp already defined)
(label op6moneyhlp already defined)
(label op6eathlp already defined)
(label op6bathhlp already defined)
(label op6toilhlp already defined)
(label op6dreshlp already defined)
(label op6medshlp already defined)
(label op6dochlp already defined)
(label op6dochlpmst already defined)
(label op6insurhlp already defined)
(label op6spcaredfr already defined)
(label op6chhlpfin already defined)
(label op6hlpchfin already defined)
(label op6ishelper already defined)
(label op6helpsched already defined)
(label op6numdayswk already defined)
(label op6numdaysmn already defined)
(label op6numhrsday already defined)
(label op6paidhelpr already defined)
(label op6sppayshlp already defined)
(label op6govpayhlp already defined)
(label op6inspayhlp already defined)
(label op6othpayhlp already defined)
(label op6payunit already defined)
(label op6hourlypay already defined)
(label op6weeklypay already defined)
(label op6monthlypy already defined)
(label op6progmpaid already defined)
(label op6dhrsmth already defined)
(label op6contctflg already defined)
(label op6dflmiss already defined)
(label op6dmissadd already defined)
(label op6dprobdup already defined)
(label op6ddiffop already defined)
(label op5proxy already defined)
(label op5relatnshp already defined)
(label op5drelatfl already defined)
(label op5drelflro already defined)
(label op5dgender already defined)
(label op5prsninhh already defined)
(label op5dage already defined)
(label op5dagefl already defined)
(label op5dageflro already defined)
(label op5dgenderfl already defined)
(label op5dgenderflro already defined)
(label op5spouprtnr already defined)
(label op5nwspouprt already defined)
(label op5eduspo already defined)
(label op5leveledu already defined)
(label op5childinhh already defined)
(label op5reasgone already defined)
(label op5dspoudec already defined)
(label op5ddeceased already defined)
(label op5chnotinhh already defined)
(label op5educhild already defined)
(label op5martlstat already defined)
(label op5numchldrn already defined)
(label op5anychdu18 already defined)
(label op5numchdu18 already defined)
(label op5dchldedit already defined)
(label op5soclntwrk already defined)
(label op5dsocwrkfl already defined)
(label op5outhlp already defined)
(label op5insdhlp already defined)
(label op5bedhlp already defined)
(label op5tkplhlp1 already defined)
(label op5tkplhlp2 already defined)
(label op5launhlp already defined)
(label op5shophlp already defined)
(label op5mealhlp already defined)
(label op5bankhlp already defined)
(label op5moneyhlp already defined)
(label op5eathlp already defined)
(label op5bathhlp already defined)
(label op5toilhlp already defined)
(label op5dreshlp already defined)
(label op5medshlp already defined)
(label op5dochlp already defined)
(label op5dochlpmst already defined)
(label op5insurhlp already defined)
(label op5spcaredfr already defined)
(label op5chhlpfin already defined)
(label op5hlpchfin already defined)
(label op5ishelper already defined)
(label op5helpsched already defined)
(label op5numdayswk already defined)
(label op5numdaysmn already defined)
(label op5numhrsday already defined)
(label op5paidhelpr already defined)
(label op5sppayshlp already defined)
(label op5govpayhlp already defined)
(label op5inspayhlp already defined)
(label op5othpayhlp already defined)
(label op5payunit already defined)
(label op5hourlypay already defined)
(label op5weeklypay already defined)
(label op5monthlypy already defined)
(label op5progmpaid already defined)
(label op5dhrsmth already defined)
(label op5contctflg already defined)
(label op5dflmiss already defined)
(label op5dmissadd already defined)
(label op5dprobdup already defined)
(label op5ddiffop already defined)
(label op4proxy already defined)
(label op4relatnshp already defined)
(label op4drelatfl already defined)
(label op4drelflro already defined)
(label op4dgender already defined)
(label op4prsninhh already defined)
(label op4dage already defined)
(label op4dagefl already defined)
(label op4dageflro already defined)
(label op4dgenderfl already defined)
(label op4dgenderflro already defined)
(label op4spouprtnr already defined)
(label op4nwspouprt already defined)
(label op4eduspo already defined)
(label op4leveledu already defined)
(label op4childinhh already defined)
(label op4reasgone already defined)
(label op4dspoudec already defined)
(label op4ddeceased already defined)
(label op4chnotinhh already defined)
(label op4educhild already defined)
(label op4martlstat already defined)
(label op4numchldrn already defined)
(label op4anychdu18 already defined)
(label op4numchdu18 already defined)
(label op4dchilddec already defined)
(label op4dchldedit already defined)
(label op4soclntwrk already defined)
(label op4dsocwrkfl already defined)
(label op4outhlp already defined)
(label op4insdhlp already defined)
(label op4bedhlp already defined)
(label op4tkplhlp1 already defined)
(label op4tkplhlp2 already defined)
(label op4launhlp already defined)
(label op4shophlp already defined)
(label op4mealhlp already defined)
(label op4bankhlp already defined)
(label op4moneyhlp already defined)
(label op4eathlp already defined)
(label op4bathhlp already defined)
(label op4toilhlp already defined)
(label op4dreshlp already defined)
(label op4medshlp already defined)
(label op4dochlp already defined)
(label op4dochlpmst already defined)
(label op4insurhlp already defined)
(label op4spcaredfr already defined)
(label op4chhlpfin already defined)
(label op4hlpchfin already defined)
(label op4ishelper already defined)
(label op4helpsched already defined)
(label op4numdayswk already defined)
(label op4numdaysmn already defined)
(label op4numhrsday already defined)
(label op4paidhelpr already defined)
(label op4sppayshlp already defined)
(label op4govpayhlp already defined)
(label op4inspayhlp already defined)
(label op4othpayhlp already defined)
(label op4payunit already defined)
(label op4hourlypay already defined)
(label op4weeklypay already defined)
(label op4monthlypy already defined)
(label op4progmpaid already defined)
(label op4dhrsmth already defined)
(label op4contctflg already defined)
(label op4dflmiss already defined)
(label op4dmissadd already defined)
(label op4dprobdup already defined)
(label op4ddiffop already defined)
(label op3proxy already defined)
(label op3relatnshp already defined)
(label op3drelatfl already defined)
(label op3drelflro already defined)
(label op3dgender already defined)
(label op3prsninhh already defined)
(label op3dage already defined)
(label op3dagefl already defined)
(label op3dageflro already defined)
(label op3dgenderfl already defined)
(label op3dgenderflro already defined)
(label op3spouprtnr already defined)
(label op3nwspouprt already defined)
(label op3eduspo already defined)
(label op3leveledu already defined)
(label op3childinhh already defined)
(label op3reasgone already defined)
(label op3dspoudec already defined)
(label op3ddeceased already defined)
(label op3chnotinhh already defined)
(label op3educhild already defined)
(label op3martlstat already defined)
(label op3numchldrn already defined)
(label op3anychdu18 already defined)
(label op3numchdu18 already defined)
(label op3dchilddec already defined)
(label op3dchldedit already defined)
(label op3soclntwrk already defined)
(label op3dsocwrkfl already defined)
(label op3outhlp already defined)
(label op3insdhlp already defined)
(label op3bedhlp already defined)
(label op3tkplhlp1 already defined)
(label op3tkplhlp2 already defined)
(label op3launhlp already defined)
(label op3shophlp already defined)
(label op3mealhlp already defined)
(label op3bankhlp already defined)
(label op3moneyhlp already defined)
(label op3eathlp already defined)
(label op3bathhlp already defined)
(label op3toilhlp already defined)
(label op3dreshlp already defined)
(label op3medshlp already defined)
(label op3dochlp already defined)
(label op3dochlpmst already defined)
(label op3insurhlp already defined)
(label op3spcaredfr already defined)
(label op3chhlpfin already defined)
(label op3hlpchfin already defined)
(label op3ishelper already defined)
(label op3helpsched already defined)
(label op3numdayswk already defined)
(label op3numdaysmn already defined)
(label op3numhrsday already defined)
(label op3paidhelpr already defined)
(label op3sppayshlp already defined)
(label op3govpayhlp already defined)
(label op3inspayhlp already defined)
(label op3othpayhlp already defined)
(label op3payunit already defined)
(label op3hourlypay already defined)
(label op3weeklypay already defined)
(label op3monthlypy already defined)
(label op3progmpaid already defined)
(label op3dhrsmth already defined)
(label op3contctflg already defined)
(label op3dflmiss already defined)
(label op3dmissadd already defined)
(label op3dprobdup already defined)
(label op3ddiffop already defined)
(label op2proxy already defined)
(label op2relatnshp already defined)
(label op2drelatfl already defined)
(label op2dgender already defined)
(label op2prsninhh already defined)
(label op2dage already defined)
(label op2dagefl already defined)
(label op2dgenderfl already defined)
(label op2spouprtnr already defined)
(label op2nwspouprt already defined)
(label op2eduspo already defined)
(label op2leveledu already defined)
(label op2childinhh already defined)
(label op2reasgone already defined)
(label op2dspoudec already defined)
(label op2ddeceased already defined)
(label op2chnotinhh already defined)
(label op2educhild already defined)
(label op2martlstat already defined)
(label op2numchldrn already defined)
(label op2anychdu18 already defined)
(label op2numchdu18 already defined)
(label op2dchilddec already defined)
(label op2soclntwrk already defined)
(label op2dsocwrkfl already defined)
(label op2outhlp already defined)
(label op2insdhlp already defined)
(label op2bedhlp already defined)
(label op2tkplhlp1 already defined)
(label op2tkplhlp2 already defined)
(label op2launhlp already defined)
(label op2shophlp already defined)
(label op2mealhlp already defined)
(label op2bankhlp already defined)
(label op2moneyhlp already defined)
(label op2eathlp already defined)
(label op2bathhlp already defined)
(label op2toilhlp already defined)
(label op2dreshlp already defined)
(label op2medshlp already defined)
(label op2dochlp already defined)
(label op2dochlpmst already defined)
(label op2insurhlp already defined)
(label op2spcaredfr already defined)
(label op2chhlpfin already defined)
(label op2hlpchfin already defined)
(label op2ishelper already defined)
(label op2helpsched already defined)
(label op2numdayswk already defined)
(label op2numdaysmn already defined)
(label op2numhrsday already defined)
(label op2paidhelpr already defined)
(label op2sppayshlp already defined)
(label op2govpayhlp already defined)
(label op2inspayhlp already defined)
(label op2othpayhlp already defined)
(label op2payunit already defined)
(label op2hourlypay already defined)
(label op2weeklypay already defined)
(label op2monthlypy already defined)
(label op2progmpaid already defined)
(label op2dhrsmth already defined)
(label op2contctflg already defined)
(label op2dflmiss already defined)
(label op2dmissadd already defined)
(label op2dprobdup already defined)
(label op2ddiffop already defined)
(label op1proxy already defined)
(label op1relatnshp already defined)
(label op1gender already defined)
(label op1spouprtnr already defined)
(label op1leveledu already defined)
(label op1prsninhh already defined)
(label op1childinhh already defined)
(label op1dage already defined)
(label op1chnotinhh already defined)
(label op1martlstat already defined)
(label op1numchldrn already defined)
(label op1anychdu18 already defined)
(label op1numchdu18 already defined)
(label op1soclntwrk already defined)
(label op1dcatgryag already defined)
(label op1dsocwrkfl already defined)
(label op1outhlp already defined)
(label op1insdhlp already defined)
(label op1bedhlp already defined)
(label op1tkplhlp1 already defined)
(label op1tkplhlp2 already defined)
(label op1launhlp already defined)
(label op1shophlp already defined)
(label op1mealhlp already defined)
(label op1bankhlp already defined)
(label op1moneyhlp already defined)
(label op1eathlp already defined)
(label op1bathhlp already defined)
(label op1toilhlp already defined)
(label op1dreshlp already defined)
(label op1medshlp already defined)
(label op1dochlp already defined)
(label op1dochlpmst already defined)
(label op1insurhlp already defined)
(label op1spcaredfr already defined)
(label op1chhlpfin already defined)
(label op1hlpchfin already defined)
(label op1ishelper already defined)
(label op1helpsched already defined)
(label op1numdayswk already defined)
(label op1numdaysmn already defined)
(label op1numhrsday already defined)
(label op1paidhelpr already defined)
(label op1sppayshlp already defined)
(label op1govpayhlp already defined)
(label op1inspayhlp already defined)
(label op1othpayhlp already defined)
(label op1payunit already defined)
(label op1hourlypay already defined)
(label op1weeklypay already defined)
(label op1monthlypy already defined)
(label op1progmpaid already defined)
(label op1dhrsmth already defined)
(label op1contctflg already defined)
(label op1dflmiss already defined)
(label op1dmissadd already defined)
(label op1dprobdup already defined)
(label pa5dfavact already defined)
(label fl5dneverdrv already defined)
(label rl5dracehisp already defined)
(label r5dgender already defined)
(label _merge already defined)

. 
end of do-file

. do "C:\Users\husaim03\AppData\Local\Temp\9\STD264314_000000.tmp"

. save R1234_OPSPltd.dta, replace
file R1234_OPSPltd.dta saved

. 
end of do-file

. do "C:\Users\husaim03\AppData\Local\Temp\9\STD264314_000000.tmp"

. 
. 
. use R7_OPSPlinked.dta, clear

.         
.                         keep spid op* wave w7anfinwgt0 w7varstrat w7varunit r7
> dresid ///
>                 mo7douthelp mo7dinsdhelp mo7dbedhelp sc7deathelp sc7dbathhelp 
> ///
>                 sc7dtoilhelp sc7ddreshelp ha7dlaunreas ha7dshopreas ha7dmealre
> as ///
>                 ha7dbankreas mc7dmedsreas w7an2011wgt0 

.                 
. 
end of do-file

. do "C:\Users\husaim03\AppData\Local\Temp\9\STD264314_000000.tmp"

. /*
> 
> Created by: --
> Date Created: --
> 
> Updated by: MH
> Date Updated: 02/01/2019
> 
> Description: This section uses the SP and OP data files and imputes
> hours of help provided to SP per methods in NHATS Technical Paper #7
> 
> Variables from this dataset are then brought in to the SP Rounds dataset
> and also the NSOC caregiver dataset.
> 
> 
> 
> **************************************************
> */
. 
. local date = subinstr("$S_DATE"," ","_",.) 

. local name 1a-help_hours_imputation-LOG`date'

. di "`name'"
1a-help_hours_imputation-LOG_5_Feb_2019

. 
. capture log close 
