----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\nhats\nhats_code\NHATS data setup\logs1a-help_hours_imputation-LOG.txt
  log type:  text
 opened on:   7 Apr 2017, 12:19:28

. 
. //PC file paths
. local r1raw "E:\nhats\data\NHATS Public\round_1\"

. local r2raw "E:\nhats\data\NHATS Public\round_2\"

. local r3raw "E:\nhats\data\NHATS Public\round_3\"

. local r4raw "E:\nhats\data\NHATS PUBLIC\round_4\"

. local r5raw "E:\nhats\data\NHATS PUBLIC\round_5\"

. local work "E:\nhats\data\NHATS working data\"

. local r1s "E:\nhats\data\NHATS Sensitive\r1_sensitive\"

. local r2s "E:\nhats\data\NHATS Sensitive\r2_sensitive\"

. local r3s "E:\nhats\data\NHATS Sensitive\r3_sensitive\"

. local r4s "E:\nhats\data\NHATS Sensitive\r4_sensitive\"

. local r5s "E:\nhats\data\NHATS Sensitive\r5_sensitive\"

. 
. /* //Rebecca mac file paths
> local r1raw /Users/rebeccagorges/Documents/data/nhats/round_1/
> local r2raw /Users/rebeccagorges/Documents/data/nhats/round_2/
> local r3raw /Users/rebeccagorges/Documents/data/nhats/round_3/
> local work /Users/rebeccagorges/Documents/data/nhats/working
> local r1s /Users/rebeccagorges/Documents/data/nhats/r1_sensitive/
> local r2s /Users/rebeccagorges/Documents/data/nhats/r2_sensitive/ 
>  */
.  
. cd "`work'"
E:\nhats\data\NHATS working data

. 
. **User note: This section can be commented out after run one time to set up datasets
. ********************************************************************
. //combine op and sp data files
. 
. //round 1
. use "`r1raw'NHATS_Round_1_OP_File_v2.dta", clear

. sort spid opid 

. 
. merge m:1 spid using round_1_1.dta //bring in sorted sp ivw dataset

    Result                           # of obs.
    -----------------------------------------
    not matched                           667
        from master                         0  (_merge==1)
        from using                        667  (_merge==2)

    matched                            38,097  (_merge==3)
    -----------------------------------------

. keep if _merge==3 //drop obs with no OP entries
(667 observations deleted)

. save R1_OPSPlinked.dta, replace
file R1_OPSPlinked.dta saved

. 
. //round 2
. use "`r2raw'NHATS_Round_2_OP_File_v2.dta", clear

. sort spid opid

. 
. merge m:1 spid using round_2_1.dta //bring in sorted sp ivw dataset
(label r1dresid already defined)
(label r2dresid already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                           465
        from master                         0  (_merge==1)
        from using                        465  (_merge==2)

    matched                            37,944  (_merge==3)
    -----------------------------------------

. keep if _merge==3 //drop obs with no OP entries
(465 observations deleted)

. save R2_OPSPlinked.dta, replace
file R2_OPSPlinked.dta saved

. 
. //round 3
. use "`r3raw'NHATS_Round_3_OP_File.dta", clear

. sort spid opid

. 
. merge m:1 spid using round_3_1.dta //bring in sorted sp ivw dataset
(label r1dresid already defined)
(label r2dresid already defined)
(label r3dresid already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                           317
        from master                         0  (_merge==1)
        from using                        317  (_merge==2)

    matched                            35,745  (_merge==3)
    -----------------------------------------

. keep if _merge==3 //drop obs with no OP entries
(317 observations deleted)

. save R3_OPSPlinked.dta, replace
file R3_OPSPlinked.dta saved

. 
. //round 4
. use "`r4raw'NHATS_Round_4_OP_File.dta", clear

. sort spid opid

. 
. merge m:1 spid using round_4_1.dta //bring in sorted sp ivw dataset
(label r1dresid already defined)
(label r2dresid already defined)
(label r3dresid already defined)
(label r4dresid already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                           211
        from master                         0  (_merge==1)
        from using                        211  (_merge==2)

    matched                            33,016  (_merge==3)
    -----------------------------------------

. keep if _merge==3 //drop obs with no OP entries
(211 observations deleted)

. save R4_OPSPlinked.dta, replace
file R4_OPSPlinked.dta saved

. 
. //round 5
. use "`r5raw'NHATS_Round_5_OP_File.dta", clear

. sort spid opid

. 
. merge m:1 spid using round_5_1.dta //bring in sorted sp ivw dataset
(label r1dresid already defined)
(label r2dresid already defined)
(label r3dresid already defined)
(label r4dresid already defined)
(label r5dresid already defined)
(label r5dcontnew already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                           394
        from master                         0  (_merge==1)
        from using                        394  (_merge==2)

    matched                            52,285  (_merge==3)
    -----------------------------------------

. keep if _merge==3 //drop obs with no OP entries
(394 observations deleted)

. save R5_OPSPlinked.dta, replace
file R5_OPSPlinked.dta saved

. 
. 
. 
. foreach w in 1 2 3 4 5 {
  2.         use R`w'_OPSPlinked.dta
  3.         
. //now create limited datasets for each wave with only needed variables
. local keeplist spid op* wave  w`w'anfinwgt0 w`w'varstrat w`w'varunit r`w'dresid ///
>  mo`w'douthelp mo`w'dinsdhelp mo`w'dbedhelp sc`w'deathelp sc`w'dbathhelp ///
>  sc`w'dtoilhelp sc`w'ddreshelp ha`w'dlaunreas ha`w'dshopreas ha`w'dmealreas ///
>  ha`w'dbankreas mc`w'dmedsreas
  4.  
.         keep `keeplist'
  5.         save R`w'_OPSPltd.dta, replace
  6. }
file R1_OPSPltd.dta saved
file R2_OPSPltd.dta saved
file R3_OPSPltd.dta saved
file R4_OPSPltd.dta saved
file R5_OPSPltd.dta saved

. 
. ********************************************************************
. //merge into single file for initial setup
. use R1_OPSPltd.dta, clear

. append using R2_OPSPltd.dta
(label op1proxy already defined)
(label op1relatnshp already defined)
(label op1gender already defined)
(label op1spouprtnr already defined)
(label op1leveledu already defined)
(label op1prsninhh already defined)
(label op1childinhh already defined)
(label op1dage already defined)
(label op1chnotinhh already defined)
(label op1martlstat already defined)
(label op1numchldrn already defined)
(label op1anychdu18 already defined)
(label op1numchdu18 already defined)
(label op1soclntwrk already defined)
(label op1dcatgryag already defined)
(label op1dsocwrkfl already defined)
(label op1outhlp already defined)
(label op1insdhlp already defined)
(label op1bedhlp already defined)
(label op1tkplhlp1 already defined)
(label op1tkplhlp2 already defined)
(label op1launhlp already defined)
(label op1shophlp already defined)
(label op1mealhlp already defined)
(label op1bankhlp already defined)
(label op1moneyhlp already defined)
(label op1eathlp already defined)
(label op1bathhlp already defined)
(label op1toilhlp already defined)
(label op1dreshlp already defined)
(label op1medshlp already defined)
(label op1dochlp already defined)
(label op1dochlpmst already defined)
(label op1insurhlp already defined)
(label op1spcaredfr already defined)
(label op1chhlpfin already defined)
(label op1hlpchfin already defined)
(label op1ishelper already defined)
(label op1helpsched already defined)
(label op1numdayswk already defined)
(label op1numdaysmn already defined)
(label op1numhrsday already defined)
(label op1paidhelpr already defined)
(label op1sppayshlp already defined)
(label op1govpayhlp already defined)
(label op1inspayhlp already defined)
(label op1othpayhlp already defined)
(label op1payunit already defined)
(label op1hourlypay already defined)
(label op1weeklypay already defined)
(label op1monthlypy already defined)
(label op1progmpaid already defined)
(label op1dhrsmth already defined)
(label op1contctflg already defined)
(label op1dflmiss already defined)
(label op1dmissadd already defined)
(label op1dprobdup already defined)

. append using R3_OPSPltd.dta
(label op2proxy already defined)
(label op2relatnshp already defined)
(label op2drelatfl already defined)
(label op2dgender already defined)
(label op2prsninhh already defined)
(label op2dage already defined)
(label op2dagefl already defined)
(label op2dgenderfl already defined)
(label op2spouprtnr already defined)
(label op2nwspouprt already defined)
(label op2eduspo already defined)
(label op2leveledu already defined)
(label op2childinhh already defined)
(label op2reasgone already defined)
(label op2dspoudec already defined)
(label op2ddeceased already defined)
(label op2chnotinhh already defined)
(label op2educhild already defined)
(label op2martlstat already defined)
(label op2numchldrn already defined)
(label op2anychdu18 already defined)
(label op2numchdu18 already defined)
(label op2dchilddec already defined)
(label op2soclntwrk already defined)
(label op2dsocwrkfl already defined)
(label op2outhlp already defined)
(label op2insdhlp already defined)
(label op2bedhlp already defined)
(label op2tkplhlp1 already defined)
(label op2tkplhlp2 already defined)
(label op2launhlp already defined)
(label op2shophlp already defined)
(label op2mealhlp already defined)
(label op2bankhlp already defined)
(label op2moneyhlp already defined)
(label op2eathlp already defined)
(label op2bathhlp already defined)
(label op2toilhlp already defined)
(label op2dreshlp already defined)
(label op2medshlp already defined)
(label op2dochlp already defined)
(label op2dochlpmst already defined)
(label op2insurhlp already defined)
(label op2spcaredfr already defined)
(label op2chhlpfin already defined)
(label op2hlpchfin already defined)
(label op2ishelper already defined)
(label op2helpsched already defined)
(label op2numdayswk already defined)
(label op2numdaysmn already defined)
(label op2numhrsday already defined)
(label op2paidhelpr already defined)
(label op2sppayshlp already defined)
(label op2govpayhlp already defined)
(label op2inspayhlp already defined)
(label op2othpayhlp already defined)
(label op2payunit already defined)
(label op2hourlypay already defined)
(label op2weeklypay already defined)
(label op2monthlypy already defined)
(label op2progmpaid already defined)
(label op2dhrsmth already defined)
(label op2contctflg already defined)
(label op2dflmiss already defined)
(label op2dmissadd already defined)
(label op2dprobdup already defined)
(label op2ddiffop already defined)
(label op1proxy already defined)
(label op1relatnshp already defined)
(label op1gender already defined)
(label op1spouprtnr already defined)
(label op1leveledu already defined)
(label op1prsninhh already defined)
(label op1childinhh already defined)
(label op1dage already defined)
(label op1chnotinhh already defined)
(label op1martlstat already defined)
(label op1numchldrn already defined)
(label op1anychdu18 already defined)
(label op1numchdu18 already defined)
(label op1soclntwrk already defined)
(label op1dcatgryag already defined)
(label op1dsocwrkfl already defined)
(label op1outhlp already defined)
(label op1insdhlp already defined)
(label op1bedhlp already defined)
(label op1tkplhlp1 already defined)
(label op1tkplhlp2 already defined)
(label op1launhlp already defined)
(label op1shophlp already defined)
(label op1mealhlp already defined)
(label op1bankhlp already defined)
(label op1moneyhlp already defined)
(label op1eathlp already defined)
(label op1bathhlp already defined)
(label op1toilhlp already defined)
(label op1dreshlp already defined)
(label op1medshlp already defined)
(label op1dochlp already defined)
(label op1dochlpmst already defined)
(label op1insurhlp already defined)
(label op1spcaredfr already defined)
(label op1chhlpfin already defined)
(label op1hlpchfin already defined)
(label op1ishelper already defined)
(label op1helpsched already defined)
(label op1numdayswk already defined)
(label op1numdaysmn already defined)
(label op1numhrsday already defined)
(label op1paidhelpr already defined)
(label op1sppayshlp already defined)
(label op1govpayhlp already defined)
(label op1inspayhlp already defined)
(label op1othpayhlp already defined)
(label op1payunit already defined)
(label op1hourlypay already defined)
(label op1weeklypay already defined)
(label op1monthlypy already defined)
(label op1progmpaid already defined)
(label op1dhrsmth already defined)
(label op1contctflg already defined)
(label op1dflmiss already defined)
(label op1dmissadd already defined)
(label op1dprobdup already defined)

. append using R4_OPSPltd.dta
(label op3proxy already defined)
(label op3relatnshp already defined)
(label op3drelatfl already defined)
(label op3drelflro already defined)
(label op3dgender already defined)
(label op3prsninhh already defined)
(label op3dage already defined)
(label op3dagefl already defined)
(label op3dageflro already defined)
(label op3dgenderfl already defined)
(label op3dgenderflro already defined)
(label op3spouprtnr already defined)
(label op3nwspouprt already defined)
(label op3eduspo already defined)
(label op3leveledu already defined)
(label op3childinhh already defined)
(label op3reasgone already defined)
(label op3dspoudec already defined)
(label op3ddeceased already defined)
(label op3chnotinhh already defined)
(label op3educhild already defined)
(label op3martlstat already defined)
(label op3numchldrn already defined)
(label op3anychdu18 already defined)
(label op3numchdu18 already defined)
(label op3dchilddec already defined)
(label op3dchldedit already defined)
(label op3soclntwrk already defined)
(label op3dsocwrkfl already defined)
(label op3outhlp already defined)
(label op3insdhlp already defined)
(label op3bedhlp already defined)
(label op3tkplhlp1 already defined)
(label op3tkplhlp2 already defined)
(label op3launhlp already defined)
(label op3shophlp already defined)
(label op3mealhlp already defined)
(label op3bankhlp already defined)
(label op3moneyhlp already defined)
(label op3eathlp already defined)
(label op3bathhlp already defined)
(label op3toilhlp already defined)
(label op3dreshlp already defined)
(label op3medshlp already defined)
(label op3dochlp already defined)
(label op3dochlpmst already defined)
(label op3insurhlp already defined)
(label op3spcaredfr already defined)
(label op3chhlpfin already defined)
(label op3hlpchfin already defined)
(label op3ishelper already defined)
(label op3helpsched already defined)
(label op3numdayswk already defined)
(label op3numdaysmn already defined)
(label op3numhrsday already defined)
(label op3paidhelpr already defined)
(label op3sppayshlp already defined)
(label op3govpayhlp already defined)
(label op3inspayhlp already defined)
(label op3othpayhlp already defined)
(label op3payunit already defined)
(label op3hourlypay already defined)
(label op3weeklypay already defined)
(label op3monthlypy already defined)
(label op3progmpaid already defined)
(label op3dhrsmth already defined)
(label op3contctflg already defined)
(label op3dflmiss already defined)
(label op3dmissadd already defined)
(label op3dprobdup already defined)
(label op3ddiffop already defined)
(label op2proxy already defined)
(label op2relatnshp already defined)
(label op2drelatfl already defined)
(label op2dgender already defined)
(label op2prsninhh already defined)
(label op2dage already defined)
(label op2dagefl already defined)
(label op2dgenderfl already defined)
(label op2spouprtnr already defined)
(label op2nwspouprt already defined)
(label op2eduspo already defined)
(label op2leveledu already defined)
(label op2childinhh already defined)
(label op2reasgone already defined)
(label op2dspoudec already defined)
(label op2ddeceased already defined)
(label op2chnotinhh already defined)
(label op2educhild already defined)
(label op2martlstat already defined)
(label op2numchldrn already defined)
(label op2anychdu18 already defined)
(label op2numchdu18 already defined)
(label op2dchilddec already defined)
(label op2soclntwrk already defined)
(label op2dsocwrkfl already defined)
(label op2outhlp already defined)
(label op2insdhlp already defined)
(label op2bedhlp already defined)
(label op2tkplhlp1 already defined)
(label op2tkplhlp2 already defined)
(label op2launhlp already defined)
(label op2shophlp already defined)
(label op2mealhlp already defined)
(label op2bankhlp already defined)
(label op2moneyhlp already defined)
(label op2eathlp already defined)
(label op2bathhlp already defined)
(label op2toilhlp already defined)
(label op2dreshlp already defined)
(label op2medshlp already defined)
(label op2dochlp already defined)
(label op2dochlpmst already defined)
(label op2insurhlp already defined)
(label op2spcaredfr already defined)
(label op2chhlpfin already defined)
(label op2hlpchfin already defined)
(label op2ishelper already defined)
(label op2helpsched already defined)
(label op2numdayswk already defined)
(label op2numdaysmn already defined)
(label op2numhrsday already defined)
(label op2paidhelpr already defined)
(label op2sppayshlp already defined)
(label op2govpayhlp already defined)
(label op2inspayhlp already defined)
(label op2othpayhlp already defined)
(label op2payunit already defined)
(label op2hourlypay already defined)
(label op2weeklypay already defined)
(label op2monthlypy already defined)
(label op2progmpaid already defined)
(label op2dhrsmth already defined)
(label op2contctflg already defined)
(label op2dflmiss already defined)
(label op2dmissadd already defined)
(label op2dprobdup already defined)
(label op2ddiffop already defined)
(label op1proxy already defined)
(label op1relatnshp already defined)
(label op1gender already defined)
(label op1spouprtnr already defined)
(label op1leveledu already defined)
(label op1prsninhh already defined)
(label op1childinhh already defined)
(label op1dage already defined)
(label op1chnotinhh already defined)
(label op1martlstat already defined)
(label op1numchldrn already defined)
(label op1anychdu18 already defined)
(label op1numchdu18 already defined)
(label op1soclntwrk already defined)
(label op1dcatgryag already defined)
(label op1dsocwrkfl already defined)
(label op1outhlp already defined)
(label op1insdhlp already defined)
(label op1bedhlp already defined)
(label op1tkplhlp1 already defined)
(label op1tkplhlp2 already defined)
(label op1launhlp already defined)
(label op1shophlp already defined)
(label op1mealhlp already defined)
(label op1bankhlp already defined)
(label op1moneyhlp already defined)
(label op1eathlp already defined)
(label op1bathhlp already defined)
(label op1toilhlp already defined)
(label op1dreshlp already defined)
(label op1medshlp already defined)
(label op1dochlp already defined)
(label op1dochlpmst already defined)
(label op1insurhlp already defined)
(label op1spcaredfr already defined)
(label op1chhlpfin already defined)
(label op1hlpchfin already defined)
(label op1ishelper already defined)
(label op1helpsched already defined)
(label op1numdayswk already defined)
(label op1numdaysmn already defined)
(label op1numhrsday already defined)
(label op1paidhelpr already defined)
(label op1sppayshlp already defined)
(label op1govpayhlp already defined)
(label op1inspayhlp already defined)
(label op1othpayhlp already defined)
(label op1payunit already defined)
(label op1hourlypay already defined)
(label op1weeklypay already defined)
(label op1monthlypy already defined)
(label op1progmpaid already defined)
(label op1dhrsmth already defined)
(label op1contctflg already defined)
(label op1dflmiss already defined)
(label op1dmissadd already defined)
(label op1dprobdup already defined)

. append using R5_OPSPltd.dta
(label op4proxy already defined)
(label op4relatnshp already defined)
(label op4drelatfl already defined)
(label op4drelflro already defined)
(label op4dgender already defined)
(label op4prsninhh already defined)
(label op4dage already defined)
(label op4dagefl already defined)
(label op4dageflro already defined)
(label op4dgenderfl already defined)
(label op4dgenderflro already defined)
(label op4spouprtnr already defined)
(label op4nwspouprt already defined)
(label op4eduspo already defined)
(label op4leveledu already defined)
(label op4childinhh already defined)
(label op4reasgone already defined)
(label op4dspoudec already defined)
(label op4ddeceased already defined)
(label op4chnotinhh already defined)
(label op4educhild already defined)
(label op4martlstat already defined)
(label op4numchldrn already defined)
(label op4anychdu18 already defined)
(label op4numchdu18 already defined)
(label op4dchilddec already defined)
(label op4dchldedit already defined)
(label op4soclntwrk already defined)
(label op4dsocwrkfl already defined)
(label op4outhlp already defined)
(label op4insdhlp already defined)
(label op4bedhlp already defined)
(label op4tkplhlp1 already defined)
(label op4tkplhlp2 already defined)
(label op4launhlp already defined)
(label op4shophlp already defined)
(label op4mealhlp already defined)
(label op4bankhlp already defined)
(label op4moneyhlp already defined)
(label op4eathlp already defined)
(label op4bathhlp already defined)
(label op4toilhlp already defined)
(label op4dreshlp already defined)
(label op4medshlp already defined)
(label op4dochlp already defined)
(label op4dochlpmst already defined)
(label op4insurhlp already defined)
(label op4spcaredfr already defined)
(label op4chhlpfin already defined)
(label op4hlpchfin already defined)
(label op4ishelper already defined)
(label op4helpsched already defined)
(label op4numdayswk already defined)
(label op4numdaysmn already defined)
(label op4numhrsday already defined)
(label op4paidhelpr already defined)
(label op4sppayshlp already defined)
(label op4govpayhlp already defined)
(label op4inspayhlp already defined)
(label op4othpayhlp already defined)
(label op4payunit already defined)
(label op4hourlypay already defined)
(label op4weeklypay already defined)
(label op4monthlypy already defined)
(label op4progmpaid already defined)
(label op4dhrsmth already defined)
(label op4contctflg already defined)
(label op4dflmiss already defined)
(label op4dmissadd already defined)
(label op4dprobdup already defined)
(label op4ddiffop already defined)
(label op3proxy already defined)
(label op3relatnshp already defined)
(label op3drelatfl already defined)
(label op3drelflro already defined)
(label op3dgender already defined)
(label op3prsninhh already defined)
(label op3dage already defined)
(label op3dagefl already defined)
(label op3dageflro already defined)
(label op3dgenderfl already defined)
(label op3dgenderflro already defined)
(label op3spouprtnr already defined)
(label op3nwspouprt already defined)
(label op3eduspo already defined)
(label op3leveledu already defined)
(label op3childinhh already defined)
(label op3reasgone already defined)
(label op3dspoudec already defined)
(label op3ddeceased already defined)
(label op3chnotinhh already defined)
(label op3educhild already defined)
(label op3martlstat already defined)
(label op3numchldrn already defined)
(label op3anychdu18 already defined)
(label op3numchdu18 already defined)
(label op3dchilddec already defined)
(label op3dchldedit already defined)
(label op3soclntwrk already defined)
(label op3dsocwrkfl already defined)
(label op3outhlp already defined)
(label op3insdhlp already defined)
(label op3bedhlp already defined)
(label op3tkplhlp1 already defined)
(label op3tkplhlp2 already defined)
(label op3launhlp already defined)
(label op3shophlp already defined)
(label op3mealhlp already defined)
(label op3bankhlp already defined)
(label op3moneyhlp already defined)
(label op3eathlp already defined)
(label op3bathhlp already defined)
(label op3toilhlp already defined)
(label op3dreshlp already defined)
(label op3medshlp already defined)
(label op3dochlp already defined)
(label op3dochlpmst already defined)
(label op3insurhlp already defined)
(label op3spcaredfr already defined)
(label op3chhlpfin already defined)
(label op3hlpchfin already defined)
(label op3ishelper already defined)
(label op3helpsched already defined)
(label op3numdayswk already defined)
(label op3numdaysmn already defined)
(label op3numhrsday already defined)
(label op3paidhelpr already defined)
(label op3sppayshlp already defined)
(label op3govpayhlp already defined)
(label op3inspayhlp already defined)
(label op3othpayhlp already defined)
(label op3payunit already defined)
(label op3hourlypay already defined)
(label op3weeklypay already defined)
(label op3monthlypy already defined)
(label op3progmpaid already defined)
(label op3dhrsmth already defined)
(label op3contctflg already defined)
(label op3dflmiss already defined)
(label op3dmissadd already defined)
(label op3dprobdup already defined)
(label op3ddiffop already defined)
(label op2proxy already defined)
(label op2relatnshp already defined)
(label op2drelatfl already defined)
(label op2dgender already defined)
(label op2prsninhh already defined)
(label op2dage already defined)
(label op2dagefl already defined)
(label op2dgenderfl already defined)
(label op2spouprtnr already defined)
(label op2nwspouprt already defined)
(label op2eduspo already defined)
(label op2leveledu already defined)
(label op2childinhh already defined)
(label op2reasgone already defined)
(label op2dspoudec already defined)
(label op2ddeceased already defined)
(label op2chnotinhh already defined)
(label op2educhild already defined)
(label op2martlstat already defined)
(label op2numchldrn already defined)
(label op2anychdu18 already defined)
(label op2numchdu18 already defined)
(label op2dchilddec already defined)
(label op2soclntwrk already defined)
(label op2dsocwrkfl already defined)
(label op2outhlp already defined)
(label op2insdhlp already defined)
(label op2bedhlp already defined)
(label op2tkplhlp1 already defined)
(label op2tkplhlp2 already defined)
(label op2launhlp already defined)
(label op2shophlp already defined)
(label op2mealhlp already defined)
(label op2bankhlp already defined)
(label op2moneyhlp already defined)
(label op2eathlp already defined)
(label op2bathhlp already defined)
(label op2toilhlp already defined)
(label op2dreshlp already defined)
(label op2medshlp already defined)
(label op2dochlp already defined)
(label op2dochlpmst already defined)
(label op2insurhlp already defined)
(label op2spcaredfr already defined)
(label op2chhlpfin already defined)
(label op2hlpchfin already defined)
(label op2ishelper already defined)
(label op2helpsched already defined)
(label op2numdayswk already defined)
(label op2numdaysmn already defined)
(label op2numhrsday already defined)
(label op2paidhelpr already defined)
(label op2sppayshlp already defined)
(label op2govpayhlp already defined)
(label op2inspayhlp already defined)
(label op2othpayhlp already defined)
(label op2payunit already defined)
(label op2hourlypay already defined)
(label op2weeklypay already defined)
(label op2monthlypy already defined)
(label op2progmpaid already defined)
(label op2dhrsmth already defined)
(label op2contctflg already defined)
(label op2dflmiss already defined)
(label op2dmissadd already defined)
(label op2dprobdup already defined)
(label op2ddiffop already defined)
(label op1proxy already defined)
(label op1relatnshp already defined)
(label op1gender already defined)
(label op1spouprtnr already defined)
(label op1leveledu already defined)
(label op1prsninhh already defined)
(label op1childinhh already defined)
(label op1dage already defined)
(label op1chnotinhh already defined)
(label op1martlstat already defined)
(label op1numchldrn already defined)
(label op1anychdu18 already defined)
(label op1numchdu18 already defined)
(label op1soclntwrk already defined)
(label op1dcatgryag already defined)
(label op1dsocwrkfl already defined)
(label op1outhlp already defined)
(label op1insdhlp already defined)
(label op1bedhlp already defined)
(label op1tkplhlp1 already defined)
(label op1tkplhlp2 already defined)
(label op1launhlp already defined)
(label op1shophlp already defined)
(label op1mealhlp already defined)
(label op1bankhlp already defined)
(label op1moneyhlp already defined)
(label op1eathlp already defined)
(label op1bathhlp already defined)
(label op1toilhlp already defined)
(label op1dreshlp already defined)
(label op1medshlp already defined)
(label op1dochlp already defined)
(label op1dochlpmst already defined)
(label op1insurhlp already defined)
(label op1spcaredfr already defined)
(label op1chhlpfin already defined)
(label op1hlpchfin already defined)
(label op1ishelper already defined)
(label op1helpsched already defined)
(label op1numdayswk already defined)
(label op1numdaysmn already defined)
(label op1numhrsday already defined)
(label op1paidhelpr already defined)
(label op1sppayshlp already defined)
(label op1govpayhlp already defined)
(label op1inspayhlp already defined)
(label op1othpayhlp already defined)
(label op1payunit already defined)
(label op1hourlypay already defined)
(label op1weeklypay already defined)
(label op1monthlypy already defined)
(label op1progmpaid already defined)
(label op1dhrsmth already defined)
(label op1contctflg already defined)
(label op1dflmiss already defined)
(label op1dmissadd already defined)
(label op1dprobdup already defined)

. 
. save R1234_OPSPltd.dta, replace
file R1234_OPSPltd.dta saved

. ********************************************************************
. use R1234_OPSPltd.dta, clear

. 
. tab wave, missing

Survey wave |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     38,097       19.33       19.33
          2 |     37,944       19.25       38.58
          3 |     35,745       18.14       56.72
          4 |     33,016       16.75       73.47
          5 |     52,285       26.53      100.00
------------+-----------------------------------
      Total |    197,087      100.00

. 
. ********************************************************************
. //recode helper time variables to -1 (na) if not helper per flag variable
. **Note, these OP variables are backfilled from wave to wave
. gen opishelper_allw=.
(197,087 missing values generated)

. foreach w in 1 2 3 4 5{
  2. tab op`w'ishelper wave, missing //helper flag variable
  3. replace opishelper_allw=op`w'ishelper if wave==`w'
  4. }

 R1 BXHL1 HELPS |                      Survey wave
             SP |         1          2          3          4          5 |     Total
----------------+-------------------------------------------------------+----------
-1 Inapplicable |    26,500     27,980     27,555     26,395     46,527 |   154,957 
          1 Yes |    11,597      9,964      8,190      6,621      5,758 |    42,130 
----------------+-------------------------------------------------------+----------
          Total |    38,097     37,944     35,745     33,016     52,285 |   197,087 

(38,097 real changes made)

       R2 BXHL2 |
    ELIGIBLE HL |                      Survey wave
        SECTION |         1          2          3          4          5 |     Total
----------------+-------------------------------------------------------+----------
-1 Inapplicable |         0     28,120     26,963     25,934     46,142 |   127,159 
          1 YES |         0      9,824      8,782      7,082      6,143 |    31,831 
              . |    38,097          0          0          0          0 |    38,097 
----------------+-------------------------------------------------------+----------
          Total |    38,097     37,944     35,745     33,016     52,285 |   197,087 

(37,944 real changes made)

       R3 BXHL2 |
    ELIGIBLE HL |                      Survey wave
        SECTION |         1          2          3          4          5 |     Total
----------------+-------------------------------------------------------+----------
-1 Inapplicable |         0          0     27,332     25,481     45,742 |    98,555 
          1 YES |         0          0      8,413      7,535      6,543 |    22,491 
              . |    38,097     37,944          0          0          0 |    76,041 
----------------+-------------------------------------------------------+----------
          Total |    38,097     37,944     35,745     33,016     52,285 |   197,087 

(35,745 real changes made)

       R4 BXHL2 |
    ELIGIBLE HL |                      Survey wave
        SECTION |         1          2          3          4          5 |     Total
----------------+-------------------------------------------------------+----------
-1 Inapplicable |         0          0          0     25,931     45,476 |    71,407 
          1 YES |         0          0          0      7,085      6,809 |    13,894 
              . |    38,097     37,944     35,745          0          0 |   111,786 
----------------+-------------------------------------------------------+----------
          Total |    38,097     37,944     35,745     33,016     52,285 |   197,087 

(33,016 real changes made)

       R5 BXHL2 |
    ELIGIBLE HL |                      Survey wave
        SECTION |         1          2          3          4          5 |     Total
----------------+-------------------------------------------------------+----------
-1 Inapplicable |         0          0          0          0     39,861 |    39,861 
          1 YES |         0          0          0          0     12,424 |    12,424 
              . |    38,097     37,944     35,745     33,016          0 |   144,802 
----------------+-------------------------------------------------------+----------
          Total |    38,097     37,944     35,745     33,016     52,285 |   197,087 

(52,285 real changes made)

. tab opishelper_allw wave, missing

opishelper |                      Survey wave
     _allw |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
        -1 |    26,500     28,120     27,332     25,931     39,861 |   147,744 
         1 |    11,597      9,824      8,413      7,085     12,424 |    49,343 
-----------+-------------------------------------------------------+----------
     Total |    38,097     37,944     35,745     33,016     52,285 |   197,087 


. 
. foreach w in 1 2 3 4 5{
  2.         foreach v in op`w'helpsched op`w'numdayswk op`w'numdaysmn op`w'numhrsday {
  3.                 tab `v' if op`w'ishelper==-1 & wave==`w', missing
  4.                 replace `v'=-1 if op`w'ishelper==-1 & wave==`w'
  5.         }
  6. }

 R1 HL1 HELP IS |
  REG SCHEDULED |      Freq.     Percent        Cum.
----------------+-----------------------------------
          -8 DK |         12        0.05        0.05
          -7 RF |          3        0.01        0.06
-1 INAPPLICABLE |     26,481       99.93       99.98
       2 VARIED |          4        0.02      100.00
----------------+-----------------------------------
          Total |     26,500      100.00
(19 real changes made)

R1 HL2 NUM DAYS |
    HELP PER WK |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     26,500      100.00      100.00
----------------+-----------------------------------
          Total |     26,500      100.00
(0 real changes made)

R1 HL3 NUM DAYS |
   HELP PER MON |      Freq.     Percent        Cum.
----------------+-----------------------------------
          -8 DK |         14        0.05        0.05
          -7 RF |          3        0.01        0.06
-1 Inapplicable |     26,483       99.94      100.00
----------------+-----------------------------------
          Total |     26,500      100.00
(17 real changes made)

 R1 HL4 NUM HRS |
   HELP PER DAY |      Freq.     Percent        Cum.
----------------+-----------------------------------
          -8 DK |         14        0.05        0.05
          -7 RF |          3        0.01        0.06
-1 Inapplicable |     26,483       99.94      100.00
----------------+-----------------------------------
          Total |     26,500      100.00
(17 real changes made)

 R2 HL1 HELP IS |
  REG SCHEDULED |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     28,120      100.00      100.00
----------------+-----------------------------------
          Total |     28,120      100.00
(0 real changes made)

R2 HL2 NUM DAYS |
    HELP PER WK |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     28,120      100.00      100.00
----------------+-----------------------------------
          Total |     28,120      100.00
(0 real changes made)

R2 HL3 NUM DAYS |
   HELP PER MON |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     28,120      100.00      100.00
----------------+-----------------------------------
          Total |     28,120      100.00
(0 real changes made)

 R2 HL4 NUM HRS |
   HELP PER DAY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     28,120      100.00      100.00
----------------+-----------------------------------
          Total |     28,120      100.00
(0 real changes made)

 R3 HL1 HELP IS |
  REG SCHEDULED |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     27,329       99.99       99.99
       2 VARIED |          3        0.01      100.00
----------------+-----------------------------------
          Total |     27,332      100.00
(3 real changes made)

R3 HL2 NUM DAYS |
    HELP PER WK |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     27,332      100.00      100.00
----------------+-----------------------------------
          Total |     27,332      100.00
(0 real changes made)

R3 HL3 NUM DAYS |
   HELP PER MON |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     27,332      100.00      100.00
----------------+-----------------------------------
          Total |     27,332      100.00
(0 real changes made)

 R3 HL4 NUM HRS |
   HELP PER DAY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     27,332      100.00      100.00
----------------+-----------------------------------
          Total |     27,332      100.00
(0 real changes made)

 R4 HL1 HELP IS |
  REG SCHEDULED |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     25,931      100.00      100.00
----------------+-----------------------------------
          Total |     25,931      100.00
(0 real changes made)

R4 HL2 NUM DAYS |
    HELP PER WK |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     25,931      100.00      100.00
----------------+-----------------------------------
          Total |     25,931      100.00
(0 real changes made)

R4 HL3 NUM DAYS |
   HELP PER MON |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     25,931      100.00      100.00
----------------+-----------------------------------
          Total |     25,931      100.00
(0 real changes made)

 R4 HL4 NUM HRS |
   HELP PER DAY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     25,931      100.00      100.00
----------------+-----------------------------------
          Total |     25,931      100.00
(0 real changes made)

 R5 HL1 HELP IS |
  REG SCHEDULED |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     39,861      100.00      100.00
----------------+-----------------------------------
          Total |     39,861      100.00
(0 real changes made)

R5 HL2 NUM DAYS |
    HELP PER WK |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     39,861      100.00      100.00
----------------+-----------------------------------
          Total |     39,861      100.00
(0 real changes made)

R5 HL3 NUM DAYS |
   HELP PER MON |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     39,861      100.00      100.00
----------------+-----------------------------------
          Total |     39,861      100.00
(0 real changes made)

 R5 HL4 NUM HRS |
   HELP PER DAY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     39,861      100.00      100.00
----------------+-----------------------------------
          Total |     39,861      100.00
(0 real changes made)

. //generate indicator of help with any task that has monthly reference period
. gen month=.
(197,087 missing values generated)

. foreach w in 1 2 3 4 5{
  2. replace month=0 if wave==`w'
  3. replace month=1 if (op`w'outhlp==1 | op`w'insdhlp==1 | op`w'bedhlp==1 | ///
>  op`w'tkplhlp1==1 | op`w'tkplhlp2==1 | op`w'launhlp==1 | op`w'shophlp==1 | ///
>  op`w'mealhlp==1 | op`w'bankhlp==1 | op`w'eathlp==1 | op`w'bathhlp==1 | ///
>  op`w'toilhlp==1 | op`w'dreshlp==1 | op`w'medshlp==1) & wave==`w'
  4. } 
(38,097 real changes made)
(11,077 real changes made)
(37,944 real changes made)
(10,419 real changes made)
(35,745 real changes made)
(9,099 real changes made)
(33,016 real changes made)
(7,623 real changes made)
(52,285 real changes made)
(12,432 real changes made)

. tab month wave, missing

           |                      Survey wave
     month |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
         0 |    27,020     27,525     26,646     25,393     39,853 |   146,437 
         1 |    11,077     10,419      9,099      7,623     12,432 |    50,650 
-----------+-------------------------------------------------------+----------
     Total |    38,097     37,944     35,745     33,016     52,285 |   197,087 


. 
.  //generate indicator of help with any task that has yearly reference period
. gen year=.
(197,087 missing values generated)

. foreach w in 1 2 3 4 5{
  2. replace year=0 if wave==`w'
  3. replace year=1 if (op`w'moneyhlp==1 | op`w'dochlp==1 | op`w'insurhlp==1) & wave==`w'
  4. tab year month if wave==`w', missing
  5. }
(38,097 real changes made)
(4,425 real changes made)

           |         month
      year |         0          1 |     Total
-----------+----------------------+----------
         0 |    26,152      7,520 |    33,672 
         1 |       868      3,557 |     4,425 
-----------+----------------------+----------
     Total |    27,020     11,077 |    38,097 

(37,944 real changes made)
(3,489 real changes made)

           |         month
      year |         0          1 |     Total
-----------+----------------------+----------
         0 |    26,835      7,620 |    34,455 
         1 |       690      2,799 |     3,489 
-----------+----------------------+----------
     Total |    27,525     10,419 |    37,944 

(35,745 real changes made)
(2,978 real changes made)

           |         month
      year |         0          1 |     Total
-----------+----------------------+----------
         0 |    25,983      6,784 |    32,767 
         1 |       663      2,315 |     2,978 
-----------+----------------------+----------
     Total |    26,646      9,099 |    35,745 

(33,016 real changes made)
(2,689 real changes made)

           |         month
      year |         0          1 |     Total
-----------+----------------------+----------
         0 |    24,744      5,583 |    30,327 
         1 |       649      2,040 |     2,689 
-----------+----------------------+----------
     Total |    25,393      7,623 |    33,016 

(52,285 real changes made)
(4,599 real changes made)

           |         month
      year |         0          1 |     Total
-----------+----------------------+----------
         0 |    38,773      8,913 |    47,686 
         1 |     1,080      3,519 |     4,599 
-----------+----------------------+----------
     Total |    39,853     12,432 |    52,285 


. 
. //generate indicator of help in last year but not last month
. gen yearnotmonth=0

. replace yearnotmonth=1 if year==1 & month==0
(3,950 real changes made)

. tab yearnotmonth wave, missing

yearnotmon |                      Survey wave
        th |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
         0 |    37,229     37,254     35,082     32,367     51,205 |   193,137 
         1 |       868        690        663        649      1,080 |     3,950 
-----------+-------------------------------------------------------+----------
     Total |    38,097     37,944     35,745     33,016     52,285 |   197,087 


. ********************************************************************
. //pull variable for sits in with doctor
. gen op_doc_help=.
(197,087 missing values generated)

. forvalues i=1/5 {
  2.         replace op_doc_help=op`i'dochlp if wave==`i'
  3. }
(38,097 real changes made)
(37,944 real changes made)
(35,745 real changes made)
(33,016 real changes made)
(52,285 real changes made)

. ********************************************************************
. //generate SP received help with self care or mobility activity or 
. //household activity for health and functioning reasons
. gen disab=.
(197,087 missing values generated)

. foreach w in 1 2 3 4 5{
  2. replace disab=0 if wave==`w'
  3. //self care or mobility, assumed to be for health reasons
. replace disab=1 if (mo`w'douthelp==2 | mo`w'dinsdhelp==2 | mo`w'dbedhelp==2 | ///
>  sc`w'deathelp==2 | sc`w'dbathhelp==2 | sc`w'dtoilhelp==2 | sc`w'ddreshelp==2) & wave==`w'
  4. //household activity for health or functioning reasons or in residential care
. **note this is different from tech paper #7 because codes disab=1 if 1,3 or 4
. **not just if 3 or 4
. foreach v in ha`w'dlaunreas ha`w'dshopreas ha`w'dmealreas ha`w'dbankreas mc`w'dmedsreas{
  5. replace disab=1 if inlist(`v',1,3,4) & wave==`w'
  6. }
  7. }
(38,097 real changes made)
(9,055 real changes made)
(1,494 real changes made)
(1,737 real changes made)
(376 real changes made)
(335 real changes made)
(211 real changes made)
(37,944 real changes made)
(10,999 real changes made)
(1,524 real changes made)
(1,870 real changes made)
(347 real changes made)
(388 real changes made)
(280 real changes made)
(35,745 real changes made)
(11,252 real changes made)
(1,182 real changes made)
(1,866 real changes made)
(392 real changes made)
(370 real changes made)
(205 real changes made)
(33,016 real changes made)
(10,392 real changes made)
(1,215 real changes made)
(1,557 real changes made)
(423 real changes made)
(383 real changes made)
(266 real changes made)
(52,285 real changes made)
(14,693 real changes made)
(1,735 real changes made)
(2,443 real changes made)
(716 real changes made)
(497 real changes made)
(337 real changes made)

. tab disab wave, missing

           |                      Survey wave
     disab |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
         0 |    24,889     22,536     20,478     18,780     31,864 |   118,547 
         1 |    13,208     15,408     15,267     14,236     20,421 |    78,540 
-----------+-------------------------------------------------------+----------
     Total |    38,097     37,944     35,745     33,016     52,285 |   197,087 


. 
. ********************************************************************
. //flag variable for hours/month reported, valid
. tab op1dhrsmth wave, missing //derived hours/month from HL section

 R1 D HL2 HL3 HL4 HRS |                      Survey wave
           HELP MONTH |         1          2          3          4          5 |     Total
----------------------+-------------------------------------------------------+----------
    -11:hours missing |       253        212        171        147        121 |       904 
     -10:days missing |       103         84         69         55         51 |       362 
  -9:days+hrs missing |       729        612        502        394        326 |     2,563 
            -1:Inapp. |    26,500     27,980     27,555     26,395     46,527 |   154,957 
                    1 |     1,093        952        810        665        587 |     4,107 
                    2 |       554        464        405        331        295 |     2,049 
                    3 |       219        195        177        156        141 |       888 
                    4 |       834        481        409        339        292 |     2,355 
                 4.33 |         0        238        203        167        149 |       757 
                    5 |       134        117         96         77         65 |       489 
                    6 |       291        249        210        173        147 |     1,070 
                    7 |        68         58         49         43         43 |       261 
                    8 |       285        255        219        170        155 |     1,084 
                 8.66 |         0        169        130        101         90 |       490 
                    9 |       291         79         65         54         52 |       541 
                   10 |       191        173        148        124        107 |       743 
                   11 |         2          2          1          0          0 |         5 
                   12 |       197        174        142        108         97 |       718 
                12.99 |         0        108         80         65         55 |       308 
                   13 |       118          0          0          0          0 |       118 
                   14 |        72         56         47         33         29 |       237 
                   15 |       118        102         85         73         59 |       437 
                   16 |       129        112         90         76         63 |       470 
                   17 |       126          0          0          0          0 |       126 
                17.32 |         0        111         89         67         59 |       326 
                   18 |        36         34         31         20         19 |       140 
                   20 |       139        121         98         85         75 |       518 
                   21 |        33         27         22         16         13 |       111 
                21.65 |         0         53         39         25         22 |       139 
                   22 |        66          4          4          4          3 |        81 
                   23 |         2          2          2          1          1 |         8 
                   24 |        92         78         64         55         41 |       330 
                   25 |        34         29         24         19         17 |       123 
                25.98 |         0        112         90         69         55 |       326 
                   26 |       134          0          0          0          0 |       134 
                   27 |         2          1          1          1          0 |         5 
                   28 |        31         26         23         20         20 |       120 
                   30 |       531        292        234        203        180 |     1,440 
                30.31 |         0        151        127        107         93 |       478 
                   31 |        41         34         26         20         18 |       139 
                   32 |        41         37         31         23         17 |       149 
                   33 |         1          1          1          1          1 |         5 
                34.64 |         0         84         70         57         52 |       263 
                   35 |       116         20         14         12         10 |       172 
                   36 |        24         18         13         11          9 |        75 
                38.97 |         0         37         33         25         18 |       113 
                   39 |        47          0          0          0          0 |        47 
                   40 |        62         54         38         30         27 |       211 
                   42 |        23         18         15         11          9 |        76 
                   43 |        60          0          0          0          0 |        60 
                 43.3 |         0         53         40         27         25 |       145 
                   44 |         4          4          3          3          3 |        17 
                   45 |        23         19         14         10          8 |        74 
                   46 |         2          0          0          0          0 |         2 
                47.63 |         0          1          1          1          1 |         4 
                   48 |        24         17         13          8          5 |        67 
                   49 |         7          7          6          4          4 |        28 
                   50 |        28         24         23         19         14 |       108 
                51.96 |         0         72         59         46         37 |       214 
                   52 |        76          0          0          0          0 |        76 
                   54 |         1          1          1          0          0 |         3 
                   56 |        27         25         22         18         16 |       108 
                   60 |       304        249        202        168        151 |     1,074 
                60.62 |         0        179        143        107         94 |       523 
                   61 |       219          0          0          0          0 |       219 
                   62 |        34         29         22         18         17 |       120 
                   63 |         3          3          2          1          1 |        10 
                   64 |         9          6          6          5          5 |        31 
                64.95 |         0         40         29         23         20 |       112 
                   65 |        54          1          1          1          1 |        58 
                   69 |        40          0          0          0          0 |        40 
                69.28 |         0         32         28         22         20 |       102 
                   70 |         8          7          3          3          3 |        24 
                   72 |        11         10          8          5          5 |        39 
                   75 |        15         13          9          6          6 |        49 
                77.94 |         0         15         12         11          7 |        45 
                   78 |        18          1          1          1          1 |        22 
                   80 |        23         20         19         18         13 |        93 
                   84 |         8          8          6          4          4 |        30 
                 86.6 |         0         34         28         21         19 |       102 
                   87 |        38          0          0          0          0 |        38 
                   90 |       146        123        101         78         67 |       515 
                90.93 |         0        102         81         66         57 |       306 
                   91 |       122          0          0          0          0 |       122 
                   93 |        13         11         10          6          6 |        46 
                   95 |         1          0          0          0          0 |         1 
                95.26 |         0          1          0          0          0 |         1 
                   96 |        16         15         14         12         12 |        69 
                   98 |         2          2          1          1          1 |         7 
                  100 |        23         19         16         10          7 |        75 
               103.92 |         0         39         30         20         19 |       108 
                  104 |        45          0          0          0          0 |        45 
                  105 |         3          2          2          2          2 |        11 
                  108 |        23          1          1          1          0 |        26 
               108.25 |         0         20         16         10          6 |        52 
                  112 |         4          2          1          0          0 |         7 
                  120 |       139        115         96         79         62 |       491 
                  121 |       108          0          0          0          0 |       108 
               121.24 |         0         97         77         62         53 |       289 
                  124 |        20         17         11          9          9 |        66 
                  125 |         6          4          4          3          1 |        18 
                  126 |         1          1          0          0          0 |         2 
                  128 |         2          1          1          0          0 |         4 
                129.9 |         0          9          6          3          3 |        21 
                  130 |        10          0          0          0          0 |        10 
                  135 |         1          1          0          0          0 |         2 
               138.56 |         0          2          1          0          0 |         3 
                  139 |         2          0          0          0          0 |         2 
                  140 |         6          5          4          3          3 |        21 
                  150 |        81         70         56         46         40 |       293 
               151.55 |         0         70         56         40         28 |       194 
                  152 |        81          0          0          0          0 |        81 
                  154 |         1          1          0          0          0 |         2 
                  155 |        17         13         11         10          7 |        58 
               155.88 |         0         11          8          6          4 |        29 
                  156 |        11          0          0          0          0 |        11 
                  160 |         9          8          7          6          5 |        35 
                  161 |         1          1          1          1          1 |         5 
                  168 |        28         21         12         10         10 |        81 
                  173 |        20          0          0          0          0 |        20 
                173.2 |         0         12          8          5          5 |        30 
                  176 |         1          1          1          1          1 |         5 
                  180 |        43         36         25         22         20 |       146 
               181.86 |         0         49         32         29         24 |       134 
                  182 |        56          1          0          0          0 |        57 
                  184 |         1          1          0          0          0 |         2 
                  186 |        12         10          9          7          6 |        44 
               190.52 |         0          1          1          0          0 |         2 
                  191 |         1          0          0          0          0 |         1 
               194.85 |         0          5          5          3          2 |        15 
                  195 |         5          0          0          0          0 |         5 
                  200 |         9          9          7          7          6 |        38 
               207.84 |         0         13         10          3          3 |        29 
                  208 |        16          1          0          0          0 |        17 
                  210 |         8          7          7          6          5 |        33 
                  212 |        27          0          0          0          0 |        27 
               212.17 |         0         23         19         16         13 |        71 
                  216 |         1          1          1          1          1 |         5 
                216.5 |         0          2          2          1          1 |         6 
                  217 |         4          1          1          1          1 |         8 
                  220 |         1          1          0          0          0 |         2 
                  224 |         2          2          1          1          1 |         7 
                  225 |         1          1          0          0          0 |         2 
               233.82 |         0          1          1          1          1 |         4 
                  234 |         2          0          0          0          0 |         2 
                  240 |        73         63         52         43         37 |       268 
                  242 |       101          0          0          0          0 |       101 
               242.48 |         0         89         76         61         47 |       273 
                  248 |        18         14         10          7          6 |        55 
                  250 |         1          1          1          0          0 |         3 
                  252 |         3          3          1          1          1 |         9 
                259.8 |         0          6          4          4          3 |        17 
                  260 |         7          0          0          0          0 |         7 
                  270 |         2          0          0          0          0 |         2 
               272.79 |         0          7          7          4          4 |        22 
                  273 |         7          0          0          0          0 |         7 
                  279 |         1          1          1          0          0 |         3 
               285.78 |         0          1          0          0          0 |         1 
                  286 |         1          0          0          0          0 |         1 
                  288 |         1          1          0          0          0 |         2 
               298.77 |         0          1          1          1          0 |         3 
                  299 |         1          0          0          0          0 |         1 
                  300 |        23         20         14         11          9 |        77 
                  303 |        23          0          0          0          0 |        23 
                303.1 |         0         19         13         11         11 |        54 
                  310 |         5          4          4          3          3 |        19 
               311.76 |         0         18         14          8          7 |        47 
                  312 |        18          0          0          0          0 |        18 
                  330 |         1          1          0          0          0 |         2 
                  333 |         2          0          0          0          0 |         2 
               333.41 |         0          1          1          0          0 |         2 
                  336 |         1          1          0          0          0 |         2 
               337.74 |         0          1          1          1          1 |         4 
                  338 |         1          0          0          0          0 |         1 
                  360 |        33         28         21         16         14 |       112 
               363.72 |         0         40         27         18         12 |        97 
                  364 |        49          0          0          0          0 |        49 
                  372 |         4          4          3          1          1 |        13 
                  375 |         3          3          3          3          3 |        15 
                389.7 |         0          1          1          1          1 |         4 
                  390 |         1          0          0          0          0 |         1 
                  394 |         1          0          0          0          0 |         1 
               394.03 |         0          1          1          1          1 |         4 
               415.68 |         0          3          3          2          1 |         9 
                  416 |         3          0          0          0          0 |         3 
                  420 |         1          1          1          1          0 |         4 
                  424 |         7          0          0          0          0 |         7 
               424.34 |         0          6          3          0          0 |         9 
                  425 |         1          1          1          1          1 |         5 
                  432 |         1          1          1          0          0 |         3 
                  433 |         3          3          1          0          0 |         7 
                  434 |         1          1          1          0          0 |         3 
                  450 |         4          4          4          4          4 |        20 
               454.65 |         0          1          1          0          0 |         2 
                  455 |         2          0          0          0          0 |         2 
                  465 |         1          1          0          0          0 |         2 
                  480 |         8          6          3          2          2 |        21 
               484.96 |         0         20         11          9          6 |        46 
                  485 |        22          0          0          0          0 |        22 
                  496 |         2          2          2          1          1 |         8 
                  504 |         1          1          0          0          0 |         2 
                  515 |         1          0          0          0          0 |         1 
               515.27 |         0          1          1          1          1 |         4 
                519.6 |         0          4          3          3          3 |        13 
                  520 |         6          0          0          0          0 |         6 
                  527 |         2          2          1          0          0 |         5 
                  540 |         3          3          3          2          1 |        12 
               545.58 |         0          4          4          3          2 |        13 
                  546 |         4          0          0          0          0 |         4 
                  558 |         2          2          1          0          0 |         5 
               575.89 |         0          1          1          0          0 |         2 
                  576 |         2          1          1          1          1 |         6 
                  600 |         3          1          1          1          1 |         7 
               623.52 |         0          2          2          1          1 |         6 
                  624 |         2          0          0          0          0 |         2 
                  660 |         1          1          0          0          0 |         2 
               666.82 |         0          1          1          1          1 |         4 
                  667 |         1          0          0          0          0 |         1 
                  690 |         1          1          0          0          0 |         2 
                  697 |         1          0          0          0          0 |         1 
               697.13 |         0          1          1          1          0 |         3 
                  713 |         1          1          1          1          1 |         5 
                  720 |        62         56         41         25         23 |       207 
                  727 |       301          0          0          0          0 |       301 
               727.44 |         0        266        202        160        139 |       767 
                  744 |        30         25         20         12         10 |        97 
Not codeable, <1 hour |     1,306      1,143        966        823        742 |     4,980 
----------------------+-------------------------------------------------------+----------
                Total |    38,097     37,944     35,745     33,016     52,285 |   197,087 


. gen op_ind_hrsmth=.
(197,087 missing values generated)

. foreach w in 1 2 3 4 5{
  2. replace op_ind_hrsmth=op`w'dhrsmth if wave==`w'
  3. }
(38,097 real changes made)
(37,944 real changes made)
(35,745 real changes made)
(33,016 real changes made)
(52,285 real changes made)

. recode op_ind_hrsmth (1/750=1)
(op_ind_hrsmth: 33448 changes made)

. 
. la def hrsmth -13"-13:Deceased" -12"Zero days/wk" -11"-11:hours missing" ///
>  -10"-10:days missing" -9 "-9:days+hours mssing" -1"-1:NA" 1"1:Valid" 9999"9999:<1hr/day",replace

. la val op_ind_hrsmth hrsmth 

. tab op_ind_hrsmth wave, missing

                     |                      Survey wave
       op_ind_hrsmth |         1          2          3          4          5 |     Total
---------------------+-------------------------------------------------------+----------
        -13:Deceased |         0      2,287      2,790      2,516      2,118 |     9,711 
        Zero days/wk |         0      1,264      1,024        998      2,374 |     5,660 
   -11:hours missing |       253        220        324        237        333 |     1,367 
    -10:days missing |       103          0          0          0          0 |       103 
-9:days+hours mssing |       729        372        558        547      1,007 |     3,213 
               -1:NA |    26,500     25,833     24,542     23,415     37,743 |   138,033 
             1:Valid |     9,206      7,502      6,116      4,921      7,975 |    35,720 
       9999:<1hr/day |     1,306        466        391        382        735 |     3,280 
---------------------+-------------------------------------------------------+----------
               Total |    38,097     37,944     35,745     33,016     52,285 |   197,087 


. 
. //generate variable indicating one day per month or one day per week
. gen justone=.
(197,087 missing values generated)

. foreach w in 1 2 3 4 5{
  2. replace justone=0 if wave==`w'
  3. replace justone=1 if (op`w'numdayswk==1 | op`w'numdaysmn==1) & wave==`w'
  4. }
(38,097 real changes made)
(3,160 real changes made)
(37,944 real changes made)
(1,386 real changes made)
(35,745 real changes made)
(1,062 real changes made)
(33,016 real changes made)
(847 real changes made)
(52,285 real changes made)
(1,387 real changes made)

. tab justone op_ind_hrsmth, missing

           |                                      op_ind_hrsmth
   justone | -13:Decea  Zero days  -11:hours  -10:days   -9:days+h      -1:NA    1:Valid  9999:<1hr |     Total
-----------+----------------------------------------------------------------------------------------+----------
         0 |     9,711      5,659      1,214        103      3,212    138,033     29,521      1,792 |   189,245 
         1 |         0          1        153          0          1          0      6,199      1,488 |     7,842 
-----------+----------------------------------------------------------------------------------------+----------
     Total |     9,711      5,660      1,367        103      3,213    138,033     35,720      3,280 |   197,087 


. 
. //recode help flags to 0=(no or inapplicable) or 1=yes
. foreach w in 1 2 3 4 5{
  2. foreach v in op`w'outhlp op`w'insdhlp op`w'bedhlp op`w'tkplhlp1 op`w'tkplhlp2 op`w'launhlp ///
>  op`w'shophlp op`w'mealhlp op`w'bankhlp op`w'eathlp op`w'bathhlp op`w'toilhlp op`w'dreshlp ///
>  op`w'medshlp op`w'moneyhlp op`w'dochlp op`w'insurhlp{
  3. tab `v' if wave==`w', missing
  4. replace `v'=0 if `v'==-1 & wave==`w'
  5. }
  6. }

  R1 MO6A HELPS |
  SP GO OUTSIDE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,363       95.45       95.45
          1 Yes |      1,734        4.55      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(36,363 real changes made)

 R1 MO19A HELPS |
SP INSIDE HOUSE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,951       96.99       96.99
          1 Yes |      1,146        3.01      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(36,951 real changes made)

 R1 MO25A HELPS |
  SP OUT OF BED |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     37,372       98.10       98.10
          1 Yes |        725        1.90      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(37,372 real changes made)

  R1 DT5A TAKES |
 SP PLACES MOST |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,277       89.97       89.97
          1 Yes |      3,820       10.03      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(34,277 real changes made)

  R1 DT7A TAKES |
  SP PLACES OTH |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,423       95.61       95.61
          1 Yes |      1,674        4.39      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(36,423 real changes made)

  R1 HA3A HELPS |
SP WITH LAUNDRY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,248       89.90       89.90
          1 Yes |      3,849       10.10      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(34,248 real changes made)

 R1 HA25A HELPS |
        SP WITH |
       SHOPPING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     32,691       85.81       85.81
          1 Yes |      5,406       14.19      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(32,691 real changes made)

 R1 HA32A HELPS |
  SP WITH MEALS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     33,240       87.25       87.25
          1 Yes |      4,857       12.75      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(33,240 real changes made)

 R1 HA42A HELPS |
SP WITH BANKING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,595       90.81       90.81
          1 Yes |      3,502        9.19      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(34,595 real changes made)

  R1 SC3A HELPS |
 SP WITH EATING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     37,466       98.34       98.34
          1 Yes |        631        1.66      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(37,466 real changes made)

 R1 SC11A HELPS |
SP WITH BATHING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     37,131       97.46       97.46
          1 Yes |        966        2.54      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(37,131 real changes made)

 R1 SC17A HELPS |
        SP WITH |
      TOILETING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     37,601       98.70       98.70
          1 Yes |        496        1.30      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(37,601 real changes made)

 R1 SC23A HELPS |
        SP WITH |
       DRESSING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,877       96.80       96.80
          1 Yes |      1,220        3.20      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(36,877 real changes made)

  R1 MC5A HELPS |
        SP WITH |
      MEDICINES |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,515       95.85       95.85
          1 Yes |      1,582        4.15      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(36,515 real changes made)

 R1 HA52A HELPS |
  SP WITH MONEY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,906       96.87       96.87
          1 Yes |      1,191        3.13      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(36,906 real changes made)

  R1 MC17A SITS |
 IN W SP AT DRS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,631       90.90       90.90
          1 Yes |      3,466        9.10      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(34,631 real changes made)

 R1 MC22A HELPS |
     WITH INSUR |
          DECIS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     37,690       98.93       98.93
          1 Yes |        407        1.07      100.00
----------------+-----------------------------------
          Total |     38,097      100.00
(37,690 real changes made)

  R2 MO6A HELPS |
  SP GO OUTSIDE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,119       95.19       95.19
          1 YES |      1,825        4.81      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(36,119 real changes made)

 R2 MO19A HELPS |
SP INSIDE HOUSE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,536       96.29       96.29
          1 YES |      1,408        3.71      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(36,536 real changes made)

 R2 MO25A HELPS |
  SP OUT OF BED |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,942       97.36       97.36
          1 YES |      1,002        2.64      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(36,942 real changes made)

  R2 DT5A TAKES |
 SP PLACES MOST |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,708       91.47       91.47
          1 YES |      3,236        8.53      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(34,708 real changes made)

  R2 DT7A TAKES |
  SP PLACES OTH |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,459       96.09       96.09
          1 YES |      1,485        3.91      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(36,459 real changes made)

  R2 HA3A HELPS |
SP WITH LAUNDRY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,791       91.69       91.69
          1 YES |      3,153        8.31      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(34,791 real changes made)

 R2 HA25A HELPS |
        SP WITH |
       SHOPPING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     33,637       88.65       88.65
          1 YES |      4,307       11.35      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(33,637 real changes made)

 R2 HA32A HELPS |
  SP WITH MEALS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     33,840       89.18       89.18
          1 YES |      4,104       10.82      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(33,840 real changes made)

 R2 HA42A HELPS |
SP WITH BANKING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     35,151       92.64       92.64
          1 YES |      2,793        7.36      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(35,151 real changes made)

  R2 SC3A HELPS |
 SP WITH EATING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,948       97.38       97.38
          1 YES |        996        2.62      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(36,948 real changes made)

 R2 SC11A HELPS |
SP WITH BATHING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,479       96.14       96.14
          1 YES |      1,465        3.86      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(36,479 real changes made)

 R2 SC17A HELPS |
        SP WITH |
      TOILETING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     37,086       97.74       97.74
          1 YES |        858        2.26      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(37,086 real changes made)

 R2 SC23A HELPS |
        SP WITH |
       DRESSING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,411       95.96       95.96
          1 YES |      1,533        4.04      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(36,411 real changes made)

  R2 MC5A HELPS |
        SP WITH |
      MEDICINES |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,629       96.53       96.53
          1 YES |      1,315        3.47      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(36,629 real changes made)

 R2 HA52A HELPS |
  SP WITH MONEY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     37,034       97.60       97.60
          1 YES |        910        2.40      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(37,034 real changes made)

  R2 MC17A SITS |
 IN W SP AT DRS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     35,204       92.78       92.78
          1 YES |      2,740        7.22      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(35,204 real changes made)

 R2 MC22A HELPS |
     WITH INSUR |
          DECIS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     37,670       99.28       99.28
          1 YES |        274        0.72      100.00
----------------+-----------------------------------
          Total |     37,944      100.00
(37,670 real changes made)

  R3 MO6A HELPS |
  SP GO OUTSIDE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,099       95.40       95.40
          1 YES |      1,646        4.60      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(34,099 real changes made)

 R3 MO19A HELPS |
SP INSIDE HOUSE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,468       96.43       96.43
          1 YES |      1,277        3.57      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(34,468 real changes made)

 R3 MO25A HELPS |
  SP OUT OF BED |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,758       97.24       97.24
          1 YES |        987        2.76      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(34,758 real changes made)

  R3 DT5A TAKES |
 SP PLACES MOST |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     33,064       92.50       92.50
          1 YES |      2,681        7.50      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(33,064 real changes made)

  R3 DT7A TAKES |
  SP PLACES OTH |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,376       96.17       96.17
          1 YES |      1,369        3.83      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(34,376 real changes made)

  R3 HA3A HELPS |
SP WITH LAUNDRY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     33,148       92.73       92.73
          1 YES |      2,597        7.27      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(33,148 real changes made)

 R3 HA25A HELPS |
        SP WITH |
       SHOPPING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     32,111       89.83       89.83
          1 YES |      3,634       10.17      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(32,111 real changes made)

 R3 HA32A HELPS |
  SP WITH MEALS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     32,304       90.37       90.37
          1 YES |      3,441        9.63      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(32,304 real changes made)

 R3 HA42A HELPS |
SP WITH BANKING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     33,433       93.53       93.53
          1 YES |      2,312        6.47      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(33,433 real changes made)

  R3 SC3A HELPS |
 SP WITH EATING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,725       97.15       97.15
          1 YES |      1,020        2.85      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(34,725 real changes made)

 R3 SC11A HELPS |
SP WITH BATHING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,399       96.23       96.23
          1 YES |      1,346        3.77      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(34,399 real changes made)

 R3 SC17A HELPS |
        SP WITH |
      TOILETING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,880       97.58       97.58
          1 YES |        865        2.42      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(34,880 real changes made)

 R3 SC23A HELPS |
        SP WITH |
       DRESSING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,251       95.82       95.82
          1 YES |      1,494        4.18      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(34,251 real changes made)

  R3 MC5A HELPS |
        SP WITH |
      MEDICINES |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,644       96.92       96.92
          1 YES |      1,101        3.08      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(34,644 real changes made)

 R3 HA52A HELPS |
  SP WITH MONEY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     34,973       97.84       97.84
          1 YES |        772        2.16      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(34,973 real changes made)

  R3 MC17A SITS |
 IN W SP AT DRS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     33,422       93.50       93.50
          1 YES |      2,323        6.50      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(33,422 real changes made)

 R3 MC22A HELPS |
     WITH INSUR |
          DECIS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     35,516       99.36       99.36
          1 YES |        229        0.64      100.00
----------------+-----------------------------------
          Total |     35,745      100.00
(35,516 real changes made)

  R4 MO6A HELPS |
  SP GO OUTSIDE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     31,583       95.66       95.66
          1 YES |      1,433        4.34      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(31,583 real changes made)

 R4 MO19A HELPS |
SP INSIDE HOUSE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     31,894       96.60       96.60
          1 YES |      1,122        3.40      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(31,894 real changes made)

 R4 MO25A HELPS |
  SP OUT OF BED |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     32,139       97.34       97.34
          1 YES |        877        2.66      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(32,139 real changes made)

  R4 DT5A TAKES |
 SP PLACES MOST |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     30,769       93.19       93.19
          1 YES |      2,247        6.81      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(30,769 real changes made)

  R4 DT7A TAKES |
  SP PLACES OTH |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     31,867       96.52       96.52
          1 YES |      1,149        3.48      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(31,867 real changes made)

  R4 HA3A HELPS |
SP WITH LAUNDRY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     30,847       93.43       93.43
          1 YES |      2,169        6.57      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(30,847 real changes made)

 R4 HA25A HELPS |
        SP WITH |
       SHOPPING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     30,036       90.97       90.97
          1 YES |      2,980        9.03      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(30,036 real changes made)

 R4 HA32A HELPS |
  SP WITH MEALS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     30,131       91.26       91.26
          1 YES |      2,885        8.74      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(30,131 real changes made)

 R4 HA42A HELPS |
SP WITH BANKING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     31,080       94.14       94.14
          1 YES |      1,936        5.86      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(31,080 real changes made)

  R4 SC3A HELPS |
 SP WITH EATING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     32,104       97.24       97.24
          1 YES |        912        2.76      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(32,104 real changes made)

 R4 SC11A HELPS |
SP WITH BATHING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     31,910       96.65       96.65
          1 YES |      1,106        3.35      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(31,910 real changes made)

 R4 SC17A HELPS |
        SP WITH |
      TOILETING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     32,329       97.92       97.92
          1 YES |        687        2.08      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(32,329 real changes made)

 R4 SC23A HELPS |
        SP WITH |
       DRESSING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     31,704       96.03       96.03
          1 YES |      1,312        3.97      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(31,704 real changes made)

  R4 MC5A HELPS |
        SP WITH |
      MEDICINES |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     32,033       97.02       97.02
          1 YES |        983        2.98      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(32,033 real changes made)

 R4 HA52A HELPS |
  SP WITH MONEY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     32,285       97.79       97.79
          1 YES |        731        2.21      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(32,285 real changes made)

  R4 MC17A SITS |
 IN W SP AT DRS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     31,006       93.91       93.91
          1 YES |      2,010        6.09      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(31,006 real changes made)

 R4 MC22A HELPS |
     WITH INSUR |
          DECIS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     32,766       99.24       99.24
          1 YES |        250        0.76      100.00
----------------+-----------------------------------
          Total |     33,016      100.00
(32,766 real changes made)

  R5 MO6A HELPS |
  SP GO OUTSIDE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     50,225       96.06       96.06
          1 YES |      2,060        3.94      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(50,225 real changes made)

 R5 MO19A HELPS |
SP INSIDE HOUSE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     50,773       97.11       97.11
          1 YES |      1,512        2.89      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(50,773 real changes made)

 R5 MO25A HELPS |
  SP OUT OF BED |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     51,201       97.93       97.93
          1 YES |      1,084        2.07      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(51,201 real changes made)

  R5 DT5A TAKES |
 SP PLACES MOST |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     48,505       92.77       92.77
          1 YES |      3,780        7.23      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(48,505 real changes made)

  R5 DT7A TAKES |
  SP PLACES OTH |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     50,442       96.48       96.48
          1 YES |      1,843        3.52      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(50,442 real changes made)

  R5 HA3A HELPS |
SP WITH LAUNDRY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     48,357       92.49       92.49
          1 YES |      3,928        7.51      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(48,357 real changes made)

 R5 HA25A HELPS |
        SP WITH |
       SHOPPING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     46,731       89.38       89.38
          1 YES |      5,554       10.62      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(46,731 real changes made)

 R5 HA32A HELPS |
  SP WITH MEALS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     47,057       90.00       90.00
          1 YES |      5,228       10.00      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(47,057 real changes made)

 R5 HA42A HELPS |
SP WITH BANKING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     48,892       93.51       93.51
          1 YES |      3,393        6.49      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(48,892 real changes made)

  R5 SC3A HELPS |
 SP WITH EATING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     51,286       98.09       98.09
          1 YES |        999        1.91      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(51,286 real changes made)

 R5 SC11A HELPS |
SP WITH BATHING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     50,903       97.36       97.36
          1 YES |      1,382        2.64      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(50,903 real changes made)

 R5 SC17A HELPS |
        SP WITH |
      TOILETING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     51,502       98.50       98.50
          1 YES |        783        1.50      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(51,502 real changes made)

 R5 SC23A HELPS |
        SP WITH |
       DRESSING |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     50,533       96.65       96.65
          1 YES |      1,752        3.35      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(50,533 real changes made)

  R5 MC5A HELPS |
        SP WITH |
      MEDICINES |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     50,666       96.90       96.90
          1 YES |      1,619        3.10      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(50,666 real changes made)

 R5 HA52A HELPS |
  SP WITH MONEY |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     51,075       97.69       97.69
          1 YES |      1,210        2.31      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(51,075 real changes made)

  R5 MC17A SITS |
 IN W SP AT DRS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     48,781       93.30       93.30
          1 YES |      3,504        6.70      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(48,781 real changes made)

 R5 MC22A HELPS |
     WITH INSUR |
          DECIS |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     51,894       99.25       99.25
          1 YES |        391        0.75      100.00
----------------+-----------------------------------
          Total |     52,285      100.00
(51,894 real changes made)

. 
. //generate variable indicating help with only one activity
. gen numact=.
(197,087 missing values generated)

. foreach w in 1 2 3 4 5{
  2. replace numact=op`w'outhlp + op`w'insdhlp + op`w'bedhlp + op`w'tkplhlp1 + op`w'tkplhlp2 + ///
>  op`w'launhlp + op`w'shophlp + op`w'mealhlp + op`w'bankhlp + op`w'eathlp + op`w'bathhlp + ///
>  op`w'toilhlp + op`w'dreshlp + op`w'medshlp + op`w'moneyhlp + op`w'dochlp + op`w'insurhlp if wave==`w'
  3. }
(38,097 real changes made)
(37,944 real changes made)
(35,745 real changes made)
(33,016 real changes made)
(52,285 real changes made)

. 
. tab numact wave, missing

           |                      Survey wave
    numact |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
         0 |    26,152     26,835     25,983     24,744     38,773 |   142,487 
         1 |     4,741      4,436      4,003      3,367      5,526 |    22,073 
         2 |     1,875      1,747      1,566      1,359      2,220 |     8,767 
         3 |     1,433      1,382      1,091        931      1,627 |     6,464 
         4 |     1,242      1,122        974        755      1,291 |     5,384 
         5 |       877        786        665        611        896 |     3,835 
         6 |       570        580        520        448        679 |     2,797 
         7 |       345        357        357        264        417 |     1,740 
         8 |       246        203        157        173        235 |     1,014 
         9 |       149        152        126        111        185 |       723 
        10 |       134        109        105         75        139 |       562 
        11 |       131         95         78         63        110 |       477 
        12 |        92         57         51         55         90 |       345 
        13 |        55         51         40         35         51 |       232 
        14 |        41         23         20         17         40 |       141 
        15 |        13          9          8          7          6 |        43 
        16 |         1          0          1          1          0 |         3 
-----------+-------------------------------------------------------+----------
     Total |    38,097     37,944     35,745     33,016     52,285 |   197,087 


. gen oneact=0 //note this =0 if help with no activities

. replace oneact=1 if numact==1
(22,073 real changes made)

. tab oneact opishelper_allw, missing

           |    opishelper_allw
    oneact |        -1          1 |     Total
-----------+----------------------+----------
         0 |   146,324     28,690 |   175,014 
         1 |     1,420     20,653 |    22,073 
-----------+----------------------+----------
     Total |   147,744     49,343 |   197,087 


. 
. ********************************************************************
. //generate variables indicating relationship is spouse, other rel, other nonrel
. gen spouse=.
(197,087 missing values generated)

. gen otherrel=.
(197,087 missing values generated)

. gen nonrel=.
(197,087 missing values generated)

. gen daughter=0

. gen son=0

. gen oth_fam=0

. 
. label var otherrel "Non-spouse relative"

. label var oth_fam "Family member of SP, not spouse, son, or daughter"

. label var nonrel "Non-relative"

. 
. foreach w in 1 2 3 4 5{
  2. replace spouse=0 if wave==`w'
  3. replace spouse=1 if op`w'relat==2 & wave==`w'
  4. replace otherrel=0 if wave==`w'
  5. replace otherrel=1 if ((op`w'relat>2 & op`w'relat<=29) | op`w'relat==91) & wave==`w'
  6. replace nonrel=0 if wave==`w'
  7. replace nonrel=1 if (op`w'relat>=30 & op`w'relat~=91) & wave==`w'
  8. replace daughter=1 if inlist(op`w'relat,3,5,7) & wave==`w'
  9. replace son=1 if inlist(op`w'relat,4,6,8) & wave==`w'
 10. replace oth_fam=1 if ((op`w'relat>8 & op`w'relat<=29) | op`w'relat==91) & wave==`w'
 11. 
. tab op`w'relat spouse
 12. tab op`w'relat otherrel
 13. tab op`w'relat nonrel
 14. 
. }
(38,097 real changes made)
(3,804 real changes made)
(38,097 real changes made)
(29,181 real changes made)
(38,097 real changes made)
(5,112 real changes made)
(11,763 real changes made)
(11,544 real changes made)
(5,874 real changes made)

         R1 OTHR PRSN |        spouse
   RELATIONSHIP TO SP |         0          1 |     Total
----------------------+----------------------+----------
    2 SPOUSE/ PARTNER |         0      3,804 |     3,804 
           3 DAUGHTER |    10,386          0 |    10,386 
                4 SON |    10,322          0 |    10,322 
    5 DAUGHTER-IN-LAW |       403          0 |       403 
         6 SON-IN-LAW |       331          0 |       331 
       7 STEPDAUGHTER |       974          0 |       974 
            8 STEPSON |       891          0 |       891 
             9 SISTER |     1,360          0 |     1,360 
           10 BROTHER |       571          0 |       571 
     11 SISTER-IN-LAW |       205          0 |       205 
    12 BROTHER-IN-LAW |        77          0 |        77 
            13 MOTHER |       115          0 |       115 
        14 STEPMOTHER |         5          0 |         5 
     15 MOTHER-IN-LAW |        35          0 |        35 
            16 FATHER |        14          0 |        14 
        17 STEPFATHER |         3          0 |         3 
     18 FATHER-IN-LAW |         7          0 |         7 
     19 GRANDDAUGHTER |     1,169          0 |     1,169 
          20 GRANDSON |       950          0 |       950 
             21 NIECE |       347          0 |       347 
            22 NEPHEW |       201          0 |       201 
              23 AUNT |        45          0 |        45 
             24 UNCLE |        14          0 |        14 
            25 COUSIN |       182          0 |       182 
26 STEPDAUGHTER'S SON |        30          0 |        30 
27 STEPSON'S SON/ DAU |        12          0 |        12 
28 DAUGHTER-IN-LAW'S  |        55          0 |        55 
29 SON-IN-LAW'S SON/  |        26          0 |        26 
    30 BOARDER/RENTER |        10          0 |        10 
31 PAID AIDE/ HOUSEKE |       547          0 |       547 
          32 ROOMMATE |        25          0 |        25 
33 EX-WIFE/ EX-HUSBAN |        54          0 |        54 
34 BOYFRIEND/ GIRLFRI |        51          0 |        51 
          35 NEIGHBOR |       189          0 |       189 
            36 FRIEND |     2,803          0 |     2,803 
37 STAFF PERSON AT TH |       367          0 |       367 
         38 CO-WORKER |        18          0 |        18 
39 MINISTER, PRIEST,  |       155          0 |       155 
40 PSYCHIATRIST, PSYC |        41          0 |        41 
    91 OTHER RELATIVE |       451          0 |       451 
 92 OTHER NONRELATIVE |       852          0 |       852 
----------------------+----------------------+----------
                Total |    34,293      3,804 |    38,097 


         R1 OTHR PRSN |  Non-spouse relative
   RELATIONSHIP TO SP |         0          1 |     Total
----------------------+----------------------+----------
    2 SPOUSE/ PARTNER |     3,804          0 |     3,804 
           3 DAUGHTER |         0     10,386 |    10,386 
                4 SON |         0     10,322 |    10,322 
    5 DAUGHTER-IN-LAW |         0        403 |       403 
         6 SON-IN-LAW |         0        331 |       331 
       7 STEPDAUGHTER |         0        974 |       974 
            8 STEPSON |         0        891 |       891 
             9 SISTER |         0      1,360 |     1,360 
           10 BROTHER |         0        571 |       571 
     11 SISTER-IN-LAW |         0        205 |       205 
    12 BROTHER-IN-LAW |         0         77 |        77 
            13 MOTHER |         0        115 |       115 
        14 STEPMOTHER |         0          5 |         5 
     15 MOTHER-IN-LAW |         0         35 |        35 
            16 FATHER |         0         14 |        14 
        17 STEPFATHER |         0          3 |         3 
     18 FATHER-IN-LAW |         0          7 |         7 
     19 GRANDDAUGHTER |         0      1,169 |     1,169 
          20 GRANDSON |         0        950 |       950 
             21 NIECE |         0        347 |       347 
            22 NEPHEW |         0        201 |       201 
              23 AUNT |         0         45 |        45 
             24 UNCLE |         0         14 |        14 
            25 COUSIN |         0        182 |       182 
26 STEPDAUGHTER'S SON |         0         30 |        30 
27 STEPSON'S SON/ DAU |         0         12 |        12 
28 DAUGHTER-IN-LAW'S  |         0         55 |        55 
29 SON-IN-LAW'S SON/  |         0         26 |        26 
    30 BOARDER/RENTER |        10          0 |        10 
31 PAID AIDE/ HOUSEKE |       547          0 |       547 
          32 ROOMMATE |        25          0 |        25 
33 EX-WIFE/ EX-HUSBAN |        54          0 |        54 
34 BOYFRIEND/ GIRLFRI |        51          0 |        51 
          35 NEIGHBOR |       189          0 |       189 
            36 FRIEND |     2,803          0 |     2,803 
37 STAFF PERSON AT TH |       367          0 |       367 
         38 CO-WORKER |        18          0 |        18 
39 MINISTER, PRIEST,  |       155          0 |       155 
40 PSYCHIATRIST, PSYC |        41          0 |        41 
    91 OTHER RELATIVE |         0        451 |       451 
 92 OTHER NONRELATIVE |       852          0 |       852 
----------------------+----------------------+----------
                Total |     8,916     29,181 |    38,097 


         R1 OTHR PRSN |     Non-relative
   RELATIONSHIP TO SP |         0          1 |     Total
----------------------+----------------------+----------
    2 SPOUSE/ PARTNER |     3,804          0 |     3,804 
           3 DAUGHTER |    10,386          0 |    10,386 
                4 SON |    10,322          0 |    10,322 
    5 DAUGHTER-IN-LAW |       403          0 |       403 
         6 SON-IN-LAW |       331          0 |       331 
       7 STEPDAUGHTER |       974          0 |       974 
            8 STEPSON |       891          0 |       891 
             9 SISTER |     1,360          0 |     1,360 
           10 BROTHER |       571          0 |       571 
     11 SISTER-IN-LAW |       205          0 |       205 
    12 BROTHER-IN-LAW |        77          0 |        77 
            13 MOTHER |       115          0 |       115 
        14 STEPMOTHER |         5          0 |         5 
     15 MOTHER-IN-LAW |        35          0 |        35 
            16 FATHER |        14          0 |        14 
        17 STEPFATHER |         3          0 |         3 
     18 FATHER-IN-LAW |         7          0 |         7 
     19 GRANDDAUGHTER |     1,169          0 |     1,169 
          20 GRANDSON |       950          0 |       950 
             21 NIECE |       347          0 |       347 
            22 NEPHEW |       201          0 |       201 
              23 AUNT |        45          0 |        45 
             24 UNCLE |        14          0 |        14 
            25 COUSIN |       182          0 |       182 
26 STEPDAUGHTER'S SON |        30          0 |        30 
27 STEPSON'S SON/ DAU |        12          0 |        12 
28 DAUGHTER-IN-LAW'S  |        55          0 |        55 
29 SON-IN-LAW'S SON/  |        26          0 |        26 
    30 BOARDER/RENTER |         0         10 |        10 
31 PAID AIDE/ HOUSEKE |         0        547 |       547 
          32 ROOMMATE |         0         25 |        25 
33 EX-WIFE/ EX-HUSBAN |         0         54 |        54 
34 BOYFRIEND/ GIRLFRI |         0         51 |        51 
          35 NEIGHBOR |         0        189 |       189 
            36 FRIEND |         0      2,803 |     2,803 
37 STAFF PERSON AT TH |         0        367 |       367 
         38 CO-WORKER |         0         18 |        18 
39 MINISTER, PRIEST,  |         0        155 |       155 
40 PSYCHIATRIST, PSYC |         0         41 |        41 
    91 OTHER RELATIVE |       451          0 |       451 
 92 OTHER NONRELATIVE |         0        852 |       852 
----------------------+----------------------+----------
                Total |    32,985      5,112 |    38,097 

(37,944 real changes made)
(3,063 real changes made)
(37,944 real changes made)
(27,270 real changes made)
(37,944 real changes made)
(7,365 real changes made)
(10,211 real changes made)
(9,912 real changes made)
(7,147 real changes made)

    R2 RELASHIP TO SP |        spouse
       UPDATE AND NEW |         0          1 |     Total
----------------------+----------------------+----------
                -8 DK |         3          0 |         3 
      -1 Inapplicable |       243          0 |       243 
    2 SPOUSE/ PARTNER |         0      3,063 |     3,063 
           3 DAUGHTER |     8,858          0 |     8,858 
                4 SON |     8,742          0 |     8,742 
    5 DAUGHTER-IN-LAW |       503          0 |       503 
         6 SON-IN-LAW |       377          0 |       377 
       7 STEPDAUGHTER |       850          0 |       850 
            8 STEPSON |       793          0 |       793 
             9 SISTER |     1,450          0 |     1,450 
           10 BROTHER |       640          0 |       640 
     11 SISTER-IN-LAW |       260          0 |       260 
    12 BROTHER-IN-LAW |        94          0 |        94 
            13 MOTHER |       118          0 |       118 
        14 STEPMOTHER |         5          0 |         5 
     15 MOTHER-IN-LAW |        43          0 |        43 
            16 FATHER |        18          0 |        18 
        17 STEPFATHER |         3          0 |         3 
     18 FATHER-IN-LAW |        12          0 |        12 
     19 GRANDDAUGHTER |     1,433          0 |     1,433 
          20 GRANDSON |     1,209          0 |     1,209 
             21 NIECE |       440          0 |       440 
            22 NEPHEW |       230          0 |       230 
              23 AUNT |        45          0 |        45 
             24 UNCLE |        14          0 |        14 
            25 COUSIN |       240          0 |       240 
26 STEPDAUGHTER'S SON |        41          0 |        41 
27 STEPSON'S SON/ DAU |        25          0 |        25 
28 DAUGHTER-IN-LAW'S  |        75          0 |        75 
29 SON-IN-LAW'S SON/  |        35          0 |        35 
    30 BOARDER/RENTER |        11          0 |        11 
31 PAID AIDE/ HOUSEKE |       879          0 |       879 
          32 ROOMMATE |        29          0 |        29 
33 EX-WIFE/ EX-HUSBAN |        85          0 |        85 
34 BOYFRIEND/ GIRLFRI |        65          0 |        65 
          35 NEIGHBOR |       275          0 |       275 
            36 FRIEND |     3,555          0 |     3,555 
37 SOMEONE/SERVICE AT |       647          0 |       647 
         38 CO-WORKER |        26          0 |        26 
39 MINISTER, PRIEST,  |       194          0 |       194 
40 PSYCHIATRIST, PSYC |        47          0 |        47 
41 DECEASED SPOUSE/PA |       113          0 |       113 
    91 OTHER RELATIVE |       717          0 |       717 
 92 OTHER NONRELATIVE |     1,439          0 |     1,439 
----------------------+----------------------+----------
                Total |    34,881      3,063 |    37,944 


    R2 RELASHIP TO SP |  Non-spouse relative
       UPDATE AND NEW |         0          1 |     Total
----------------------+----------------------+----------
                -8 DK |         3          0 |         3 
      -1 Inapplicable |       243          0 |       243 
    2 SPOUSE/ PARTNER |     3,063          0 |     3,063 
           3 DAUGHTER |         0      8,858 |     8,858 
                4 SON |         0      8,742 |     8,742 
    5 DAUGHTER-IN-LAW |         0        503 |       503 
         6 SON-IN-LAW |         0        377 |       377 
       7 STEPDAUGHTER |         0        850 |       850 
            8 STEPSON |         0        793 |       793 
             9 SISTER |         0      1,450 |     1,450 
           10 BROTHER |         0        640 |       640 
     11 SISTER-IN-LAW |         0        260 |       260 
    12 BROTHER-IN-LAW |         0         94 |        94 
            13 MOTHER |         0        118 |       118 
        14 STEPMOTHER |         0          5 |         5 
     15 MOTHER-IN-LAW |         0         43 |        43 
            16 FATHER |         0         18 |        18 
        17 STEPFATHER |         0          3 |         3 
     18 FATHER-IN-LAW |         0         12 |        12 
     19 GRANDDAUGHTER |         0      1,433 |     1,433 
          20 GRANDSON |         0      1,209 |     1,209 
             21 NIECE |         0        440 |       440 
            22 NEPHEW |         0        230 |       230 
              23 AUNT |         0         45 |        45 
             24 UNCLE |         0         14 |        14 
            25 COUSIN |         0        240 |       240 
26 STEPDAUGHTER'S SON |         0         41 |        41 
27 STEPSON'S SON/ DAU |         0         25 |        25 
28 DAUGHTER-IN-LAW'S  |         0         75 |        75 
29 SON-IN-LAW'S SON/  |         0         35 |        35 
    30 BOARDER/RENTER |        11          0 |        11 
31 PAID AIDE/ HOUSEKE |       879          0 |       879 
          32 ROOMMATE |        29          0 |        29 
33 EX-WIFE/ EX-HUSBAN |        85          0 |        85 
34 BOYFRIEND/ GIRLFRI |        65          0 |        65 
          35 NEIGHBOR |       275          0 |       275 
            36 FRIEND |     3,555          0 |     3,555 
37 SOMEONE/SERVICE AT |       647          0 |       647 
         38 CO-WORKER |        26          0 |        26 
39 MINISTER, PRIEST,  |       194          0 |       194 
40 PSYCHIATRIST, PSYC |        47          0 |        47 
41 DECEASED SPOUSE/PA |       113          0 |       113 
    91 OTHER RELATIVE |         0        717 |       717 
 92 OTHER NONRELATIVE |     1,439          0 |     1,439 
----------------------+----------------------+----------
                Total |    10,674     27,270 |    37,944 


    R2 RELASHIP TO SP |     Non-relative
       UPDATE AND NEW |         0          1 |     Total
----------------------+----------------------+----------
                -8 DK |         3          0 |         3 
      -1 Inapplicable |       243          0 |       243 
    2 SPOUSE/ PARTNER |     3,063          0 |     3,063 
           3 DAUGHTER |     8,858          0 |     8,858 
                4 SON |     8,742          0 |     8,742 
    5 DAUGHTER-IN-LAW |       503          0 |       503 
         6 SON-IN-LAW |       377          0 |       377 
       7 STEPDAUGHTER |       850          0 |       850 
            8 STEPSON |       793          0 |       793 
             9 SISTER |     1,450          0 |     1,450 
           10 BROTHER |       640          0 |       640 
     11 SISTER-IN-LAW |       260          0 |       260 
    12 BROTHER-IN-LAW |        94          0 |        94 
            13 MOTHER |       118          0 |       118 
        14 STEPMOTHER |         5          0 |         5 
     15 MOTHER-IN-LAW |        43          0 |        43 
            16 FATHER |        18          0 |        18 
        17 STEPFATHER |         3          0 |         3 
     18 FATHER-IN-LAW |        12          0 |        12 
     19 GRANDDAUGHTER |     1,433          0 |     1,433 
          20 GRANDSON |     1,209          0 |     1,209 
             21 NIECE |       440          0 |       440 
            22 NEPHEW |       230          0 |       230 
              23 AUNT |        45          0 |        45 
             24 UNCLE |        14          0 |        14 
            25 COUSIN |       240          0 |       240 
26 STEPDAUGHTER'S SON |        41          0 |        41 
27 STEPSON'S SON/ DAU |        25          0 |        25 
28 DAUGHTER-IN-LAW'S  |        75          0 |        75 
29 SON-IN-LAW'S SON/  |        35          0 |        35 
    30 BOARDER/RENTER |         0         11 |        11 
31 PAID AIDE/ HOUSEKE |         0        879 |       879 
          32 ROOMMATE |         0         29 |        29 
33 EX-WIFE/ EX-HUSBAN |         0         85 |        85 
34 BOYFRIEND/ GIRLFRI |         0         65 |        65 
          35 NEIGHBOR |         0        275 |       275 
            36 FRIEND |         0      3,555 |     3,555 
37 SOMEONE/SERVICE AT |         0        647 |       647 
         38 CO-WORKER |         0         26 |        26 
39 MINISTER, PRIEST,  |         0        194 |       194 
40 PSYCHIATRIST, PSYC |         0         47 |        47 
41 DECEASED SPOUSE/PA |         0        113 |       113 
    91 OTHER RELATIVE |       717          0 |       717 
 92 OTHER NONRELATIVE |         0      1,439 |     1,439 
----------------------+----------------------+----------
                Total |    30,579      7,365 |    37,944 

(35,745 real changes made)
(2,440 real changes made)
(35,745 real changes made)
(24,421 real changes made)
(35,745 real changes made)
(8,364 real changes made)
(8,546 real changes made)
(8,352 real changes made)
(7,523 real changes made)

    R3 RELASHIP TO SP |        spouse
       UPDATE AND NEW |         0          1 |     Total
----------------------+----------------------+----------
      -1 Inapplicable |       520          0 |       520 
    2 SPOUSE/ PARTNER |         0      2,440 |     2,440 
           3 DAUGHTER |     7,309          0 |     7,309 
                4 SON |     7,277          0 |     7,277 
    5 DAUGHTER-IN-LAW |       509          0 |       509 
         6 SON-IN-LAW |       386          0 |       386 
       7 STEPDAUGHTER |       728          0 |       728 
            8 STEPSON |       689          0 |       689 
             9 SISTER |     1,398          0 |     1,398 
           10 BROTHER |       677          0 |       677 
     11 SISTER-IN-LAW |       281          0 |       281 
    12 BROTHER-IN-LAW |       106          0 |       106 
            13 MOTHER |       114          0 |       114 
        14 STEPMOTHER |         5          0 |         5 
     15 MOTHER-IN-LAW |        47          0 |        47 
            16 FATHER |        16          0 |        16 
        17 STEPFATHER |         3          0 |         3 
     18 FATHER-IN-LAW |        16          0 |        16 
     19 GRANDDAUGHTER |     1,519          0 |     1,519 
          20 GRANDSON |     1,285          0 |     1,285 
             21 NIECE |       467          0 |       467 
            22 NEPHEW |       256          0 |       256 
              23 AUNT |        50          0 |        50 
             24 UNCLE |        10          0 |        10 
            25 COUSIN |       248          0 |       248 
26 STEPDAUGHTER'S SON |        44          0 |        44 
27 STEPSON'S SON/ DAU |        33          0 |        33 
28 DAUGHTER-IN-LAW'S  |       107          0 |       107 
29 SON-IN-LAW'S SON/  |        44          0 |        44 
    30 BOARDER/RENTER |        11          0 |        11 
31 PAID AIDE/ HOUSEKE |       979          0 |       979 
          32 ROOMMATE |        26          0 |        26 
33 EX-WIFE/ EX-HUSBAN |        96          0 |        96 
34 BOYFRIEND/ GIRLFRI |        59          0 |        59 
          35 NEIGHBOR |       369          0 |       369 
            36 FRIEND |     4,041          0 |     4,041 
37 SOMEONE/SERVICE AT |       645          0 |       645 
         38 CO-WORKER |        27          0 |        27 
39 MINISTER, PRIEST,  |       207          0 |       207 
40 PSYCHIATRIST, PSYC |        48          0 |        48 
41 DECEASED SPOUSE/PA |        89          0 |        89 
    91 OTHER RELATIVE |       797          0 |       797 
 92 OTHER NONRELATIVE |     1,767          0 |     1,767 
----------------------+----------------------+----------
                Total |    33,305      2,440 |    35,745 


    R3 RELASHIP TO SP |  Non-spouse relative
       UPDATE AND NEW |         0          1 |     Total
----------------------+----------------------+----------
      -1 Inapplicable |       520          0 |       520 
    2 SPOUSE/ PARTNER |     2,440          0 |     2,440 
           3 DAUGHTER |         0      7,309 |     7,309 
                4 SON |         0      7,277 |     7,277 
    5 DAUGHTER-IN-LAW |         0        509 |       509 
         6 SON-IN-LAW |         0        386 |       386 
       7 STEPDAUGHTER |         0        728 |       728 
            8 STEPSON |         0        689 |       689 
             9 SISTER |         0      1,398 |     1,398 
           10 BROTHER |         0        677 |       677 
     11 SISTER-IN-LAW |         0        281 |       281 
    12 BROTHER-IN-LAW |         0        106 |       106 
            13 MOTHER |         0        114 |       114 
        14 STEPMOTHER |         0          5 |         5 
     15 MOTHER-IN-LAW |         0         47 |        47 
            16 FATHER |         0         16 |        16 
        17 STEPFATHER |         0          3 |         3 
     18 FATHER-IN-LAW |         0         16 |        16 
     19 GRANDDAUGHTER |         0      1,519 |     1,519 
          20 GRANDSON |         0      1,285 |     1,285 
             21 NIECE |         0        467 |       467 
            22 NEPHEW |         0        256 |       256 
              23 AUNT |         0         50 |        50 
             24 UNCLE |         0         10 |        10 
            25 COUSIN |         0        248 |       248 
26 STEPDAUGHTER'S SON |         0         44 |        44 
27 STEPSON'S SON/ DAU |         0         33 |        33 
28 DAUGHTER-IN-LAW'S  |         0        107 |       107 
29 SON-IN-LAW'S SON/  |         0         44 |        44 
    30 BOARDER/RENTER |        11          0 |        11 
31 PAID AIDE/ HOUSEKE |       979          0 |       979 
          32 ROOMMATE |        26          0 |        26 
33 EX-WIFE/ EX-HUSBAN |        96          0 |        96 
34 BOYFRIEND/ GIRLFRI |        59          0 |        59 
          35 NEIGHBOR |       369          0 |       369 
            36 FRIEND |     4,041          0 |     4,041 
37 SOMEONE/SERVICE AT |       645          0 |       645 
         38 CO-WORKER |        27          0 |        27 
39 MINISTER, PRIEST,  |       207          0 |       207 
40 PSYCHIATRIST, PSYC |        48          0 |        48 
41 DECEASED SPOUSE/PA |        89          0 |        89 
    91 OTHER RELATIVE |         0        797 |       797 
 92 OTHER NONRELATIVE |     1,767          0 |     1,767 
----------------------+----------------------+----------
                Total |    11,324     24,421 |    35,745 


    R3 RELASHIP TO SP |     Non-relative
       UPDATE AND NEW |         0          1 |     Total
----------------------+----------------------+----------
      -1 Inapplicable |       520          0 |       520 
    2 SPOUSE/ PARTNER |     2,440          0 |     2,440 
           3 DAUGHTER |     7,309          0 |     7,309 
                4 SON |     7,277          0 |     7,277 
    5 DAUGHTER-IN-LAW |       509          0 |       509 
         6 SON-IN-LAW |       386          0 |       386 
       7 STEPDAUGHTER |       728          0 |       728 
            8 STEPSON |       689          0 |       689 
             9 SISTER |     1,398          0 |     1,398 
           10 BROTHER |       677          0 |       677 
     11 SISTER-IN-LAW |       281          0 |       281 
    12 BROTHER-IN-LAW |       106          0 |       106 
            13 MOTHER |       114          0 |       114 
        14 STEPMOTHER |         5          0 |         5 
     15 MOTHER-IN-LAW |        47          0 |        47 
            16 FATHER |        16          0 |        16 
        17 STEPFATHER |         3          0 |         3 
     18 FATHER-IN-LAW |        16          0 |        16 
     19 GRANDDAUGHTER |     1,519          0 |     1,519 
          20 GRANDSON |     1,285          0 |     1,285 
             21 NIECE |       467          0 |       467 
            22 NEPHEW |       256          0 |       256 
              23 AUNT |        50          0 |        50 
             24 UNCLE |        10          0 |        10 
            25 COUSIN |       248          0 |       248 
26 STEPDAUGHTER'S SON |        44          0 |        44 
27 STEPSON'S SON/ DAU |        33          0 |        33 
28 DAUGHTER-IN-LAW'S  |       107          0 |       107 
29 SON-IN-LAW'S SON/  |        44          0 |        44 
    30 BOARDER/RENTER |         0         11 |        11 
31 PAID AIDE/ HOUSEKE |         0        979 |       979 
          32 ROOMMATE |         0         26 |        26 
33 EX-WIFE/ EX-HUSBAN |         0         96 |        96 
34 BOYFRIEND/ GIRLFRI |         0         59 |        59 
          35 NEIGHBOR |         0        369 |       369 
            36 FRIEND |         0      4,041 |     4,041 
37 SOMEONE/SERVICE AT |         0        645 |       645 
         38 CO-WORKER |         0         27 |        27 
39 MINISTER, PRIEST,  |         0        207 |       207 
40 PSYCHIATRIST, PSYC |         0         48 |        48 
41 DECEASED SPOUSE/PA |         0         89 |        89 
    91 OTHER RELATIVE |       797          0 |       797 
 92 OTHER NONRELATIVE |         0      1,767 |     1,767 
----------------------+----------------------+----------
                Total |    27,381      8,364 |    35,745 

(33,016 real changes made)
(1,969 real changes made)
(33,016 real changes made)
(21,632 real changes made)
(33,016 real changes made)
(8,600 real changes made)
(7,165 real changes made)
(6,991 real changes made)
(7,476 real changes made)

    R4 RELASHIP TO SP |        spouse
       UPDATE AND NEW |         0          1 |     Total
----------------------+----------------------+----------
      -1 Inapplicable |       815          0 |       815 
    2 SPOUSE/ PARTNER |         0      1,969 |     1,969 
           3 DAUGHTER |     6,070          0 |     6,070 
                4 SON |     6,040          0 |     6,040 
    5 DAUGHTER-IN-LAW |       489          0 |       489 
         6 SON-IN-LAW |       365          0 |       365 
       7 STEPDAUGHTER |       606          0 |       606 
            8 STEPSON |       586          0 |       586 
             9 SISTER |     1,336          0 |     1,336 
           10 BROTHER |       650          0 |       650 
     11 SISTER-IN-LAW |       295          0 |       295 
    12 BROTHER-IN-LAW |       113          0 |       113 
            13 MOTHER |       102          0 |       102 
        14 STEPMOTHER |         5          0 |         5 
     15 MOTHER-IN-LAW |        43          0 |        43 
            16 FATHER |        14          0 |        14 
        17 STEPFATHER |         4          0 |         4 
     18 FATHER-IN-LAW |        18          0 |        18 
     19 GRANDDAUGHTER |     1,539          0 |     1,539 
          20 GRANDSON |     1,318          0 |     1,318 
             21 NIECE |       473          0 |       473 
            22 NEPHEW |       249          0 |       249 
              23 AUNT |        51          0 |        51 
             24 UNCLE |        10          0 |        10 
            25 COUSIN |       251          0 |       251 
26 STEPDAUGHTER'S SON |        40          0 |        40 
27 STEPSON'S SON/ DAU |        31          0 |        31 
28 DAUGHTER-IN-LAW'S  |       107          0 |       107 
29 SON-IN-LAW'S SON/  |        38          0 |        38 
    30 BOARDER/RENTER |        11          0 |        11 
31 PAID AIDE/ HOUSEKE |       892          0 |       892 
          32 ROOMMATE |        30          0 |        30 
33 EX-WIFE/ EX-HUSBAN |        96          0 |        96 
34 BOYFRIEND/ GIRLFRI |        51          0 |        51 
          35 NEIGHBOR |       401          0 |       401 
            36 FRIEND |     4,234          0 |     4,234 
37 SOMEONE/SERVICE AT |       584          0 |       584 
         38 CO-WORKER |        28          0 |        28 
39 MINISTER, PRIEST,  |       206          0 |       206 
40 PSYCHIATRIST, PSYC |        49          0 |        49 
41 DECEASED SPOUSE/PA |        84          0 |        84 
    91 OTHER RELATIVE |       789          0 |       789 
 92 OTHER NONRELATIVE |     1,934          0 |     1,934 
----------------------+----------------------+----------
                Total |    31,047      1,969 |    33,016 


    R4 RELASHIP TO SP |  Non-spouse relative
       UPDATE AND NEW |         0          1 |     Total
----------------------+----------------------+----------
      -1 Inapplicable |       815          0 |       815 
    2 SPOUSE/ PARTNER |     1,969          0 |     1,969 
           3 DAUGHTER |         0      6,070 |     6,070 
                4 SON |         0      6,040 |     6,040 
    5 DAUGHTER-IN-LAW |         0        489 |       489 
         6 SON-IN-LAW |         0        365 |       365 
       7 STEPDAUGHTER |         0        606 |       606 
            8 STEPSON |         0        586 |       586 
             9 SISTER |         0      1,336 |     1,336 
           10 BROTHER |         0        650 |       650 
     11 SISTER-IN-LAW |         0        295 |       295 
    12 BROTHER-IN-LAW |         0        113 |       113 
            13 MOTHER |         0        102 |       102 
        14 STEPMOTHER |         0          5 |         5 
     15 MOTHER-IN-LAW |         0         43 |        43 
            16 FATHER |         0         14 |        14 
        17 STEPFATHER |         0          4 |         4 
     18 FATHER-IN-LAW |         0         18 |        18 
     19 GRANDDAUGHTER |         0      1,539 |     1,539 
          20 GRANDSON |         0      1,318 |     1,318 
             21 NIECE |         0        473 |       473 
            22 NEPHEW |         0        249 |       249 
              23 AUNT |         0         51 |        51 
             24 UNCLE |         0         10 |        10 
            25 COUSIN |         0        251 |       251 
26 STEPDAUGHTER'S SON |         0         40 |        40 
27 STEPSON'S SON/ DAU |         0         31 |        31 
28 DAUGHTER-IN-LAW'S  |         0        107 |       107 
29 SON-IN-LAW'S SON/  |         0         38 |        38 
    30 BOARDER/RENTER |        11          0 |        11 
31 PAID AIDE/ HOUSEKE |       892          0 |       892 
          32 ROOMMATE |        30          0 |        30 
33 EX-WIFE/ EX-HUSBAN |        96          0 |        96 
34 BOYFRIEND/ GIRLFRI |        51          0 |        51 
          35 NEIGHBOR |       401          0 |       401 
            36 FRIEND |     4,234          0 |     4,234 
37 SOMEONE/SERVICE AT |       584          0 |       584 
         38 CO-WORKER |        28          0 |        28 
39 MINISTER, PRIEST,  |       206          0 |       206 
40 PSYCHIATRIST, PSYC |        49          0 |        49 
41 DECEASED SPOUSE/PA |        84          0 |        84 
    91 OTHER RELATIVE |         0        789 |       789 
 92 OTHER NONRELATIVE |     1,934          0 |     1,934 
----------------------+----------------------+----------
                Total |    11,384     21,632 |    33,016 


    R4 RELASHIP TO SP |     Non-relative
       UPDATE AND NEW |         0          1 |     Total
----------------------+----------------------+----------
      -1 Inapplicable |       815          0 |       815 
    2 SPOUSE/ PARTNER |     1,969          0 |     1,969 
           3 DAUGHTER |     6,070          0 |     6,070 
                4 SON |     6,040          0 |     6,040 
    5 DAUGHTER-IN-LAW |       489          0 |       489 
         6 SON-IN-LAW |       365          0 |       365 
       7 STEPDAUGHTER |       606          0 |       606 
            8 STEPSON |       586          0 |       586 
             9 SISTER |     1,336          0 |     1,336 
           10 BROTHER |       650          0 |       650 
     11 SISTER-IN-LAW |       295          0 |       295 
    12 BROTHER-IN-LAW |       113          0 |       113 
            13 MOTHER |       102          0 |       102 
        14 STEPMOTHER |         5          0 |         5 
     15 MOTHER-IN-LAW |        43          0 |        43 
            16 FATHER |        14          0 |        14 
        17 STEPFATHER |         4          0 |         4 
     18 FATHER-IN-LAW |        18          0 |        18 
     19 GRANDDAUGHTER |     1,539          0 |     1,539 
          20 GRANDSON |     1,318          0 |     1,318 
             21 NIECE |       473          0 |       473 
            22 NEPHEW |       249          0 |       249 
              23 AUNT |        51          0 |        51 
             24 UNCLE |        10          0 |        10 
            25 COUSIN |       251          0 |       251 
26 STEPDAUGHTER'S SON |        40          0 |        40 
27 STEPSON'S SON/ DAU |        31          0 |        31 
28 DAUGHTER-IN-LAW'S  |       107          0 |       107 
29 SON-IN-LAW'S SON/  |        38          0 |        38 
    30 BOARDER/RENTER |         0         11 |        11 
31 PAID AIDE/ HOUSEKE |         0        892 |       892 
          32 ROOMMATE |         0         30 |        30 
33 EX-WIFE/ EX-HUSBAN |         0         96 |        96 
34 BOYFRIEND/ GIRLFRI |         0         51 |        51 
          35 NEIGHBOR |         0        401 |       401 
            36 FRIEND |         0      4,234 |     4,234 
37 SOMEONE/SERVICE AT |         0        584 |       584 
         38 CO-WORKER |         0         28 |        28 
39 MINISTER, PRIEST,  |         0        206 |       206 
40 PSYCHIATRIST, PSYC |         0         49 |        49 
41 DECEASED SPOUSE/PA |         0         84 |        84 
    91 OTHER RELATIVE |       789          0 |       789 
 92 OTHER NONRELATIVE |         0      1,934 |     1,934 
----------------------+----------------------+----------
                Total |    24,416      8,600 |    33,016 

(52,285 real changes made)
(3,736 real changes made)
(52,285 real changes made)
(35,336 real changes made)
(52,285 real changes made)
(12,301 real changes made)
(12,241 real changes made)
(11,938 real changes made)
(11,157 real changes made)

    R5 RELASHIP TO SP |        spouse
       UPDATE AND NEW |         0          1 |     Total
----------------------+----------------------+----------
      -1 Inapplicable |       912          0 |       912 
    2 SPOUSE/ PARTNER |         0      3,736 |     3,736 
           3 DAUGHTER |    10,420          0 |    10,420 
                4 SON |    10,355          0 |    10,355 
    5 DAUGHTER-IN-LAW |       698          0 |       698 
         6 SON-IN-LAW |       539          0 |       539 
       7 STEPDAUGHTER |     1,123          0 |     1,123 
            8 STEPSON |     1,044          0 |     1,044 
             9 SISTER |     2,244          0 |     2,244 
           10 BROTHER |     1,057          0 |     1,057 
     11 SISTER-IN-LAW |       459          0 |       459 
    12 BROTHER-IN-LAW |       179          0 |       179 
            13 MOTHER |       183          0 |       183 
        14 STEPMOTHER |         6          0 |         6 
     15 MOTHER-IN-LAW |        65          0 |        65 
            16 FATHER |        33          0 |        33 
        17 STEPFATHER |         4          0 |         4 
     18 FATHER-IN-LAW |        27          0 |        27 
     19 GRANDDAUGHTER |     2,153          0 |     2,153 
          20 GRANDSON |     1,951          0 |     1,951 
             21 NIECE |       650          0 |       650 
            22 NEPHEW |       329          0 |       329 
              23 AUNT |        75          0 |        75 
             24 UNCLE |        14          0 |        14 
            25 COUSIN |       378          0 |       378 
26 STEPDAUGHTER'S SON |        51          0 |        51 
27 STEPSON'S SON/ DAU |        50          0 |        50 
28 DAUGHTER-IN-LAW'S  |       141          0 |       141 
29 SON-IN-LAW'S SON/  |        55          0 |        55 
    30 BOARDER/RENTER |        26          0 |        26 
31 PAID AIDE/ HOUSEKE |     1,201          0 |     1,201 
          32 ROOMMATE |        36          0 |        36 
33 EX-WIFE/ EX-HUSBAN |       127          0 |       127 
34 BOYFRIEND/ GIRLFRI |        84          0 |        84 
          35 NEIGHBOR |       552          0 |       552 
            36 FRIEND |     6,402          0 |     6,402 
37 SOMEONE/SERVICE AT |       681          0 |       681 
         38 CO-WORKER |        40          0 |        40 
39 MINISTER, PRIEST,  |       324          0 |       324 
40 PSYCHIATRIST, PSYC |        85          0 |        85 
41 DECEASED SPOUSE/PA |       132          0 |       132 
    91 OTHER RELATIVE |     1,053          0 |     1,053 
 92 OTHER NONRELATIVE |     2,611          0 |     2,611 
----------------------+----------------------+----------
                Total |    48,549      3,736 |    52,285 


    R5 RELASHIP TO SP |  Non-spouse relative
       UPDATE AND NEW |         0          1 |     Total
----------------------+----------------------+----------
      -1 Inapplicable |       912          0 |       912 
    2 SPOUSE/ PARTNER |     3,736          0 |     3,736 
           3 DAUGHTER |         0     10,420 |    10,420 
                4 SON |         0     10,355 |    10,355 
    5 DAUGHTER-IN-LAW |         0        698 |       698 
         6 SON-IN-LAW |         0        539 |       539 
       7 STEPDAUGHTER |         0      1,123 |     1,123 
            8 STEPSON |         0      1,044 |     1,044 
             9 SISTER |         0      2,244 |     2,244 
           10 BROTHER |         0      1,057 |     1,057 
     11 SISTER-IN-LAW |         0        459 |       459 
    12 BROTHER-IN-LAW |         0        179 |       179 
            13 MOTHER |         0        183 |       183 
        14 STEPMOTHER |         0          6 |         6 
     15 MOTHER-IN-LAW |         0         65 |        65 
            16 FATHER |         0         33 |        33 
        17 STEPFATHER |         0          4 |         4 
     18 FATHER-IN-LAW |         0         27 |        27 
     19 GRANDDAUGHTER |         0      2,153 |     2,153 
          20 GRANDSON |         0      1,951 |     1,951 
             21 NIECE |         0        650 |       650 
            22 NEPHEW |         0        329 |       329 
              23 AUNT |         0         75 |        75 
             24 UNCLE |         0         14 |        14 
            25 COUSIN |         0        378 |       378 
26 STEPDAUGHTER'S SON |         0         51 |        51 
27 STEPSON'S SON/ DAU |         0         50 |        50 
28 DAUGHTER-IN-LAW'S  |         0        141 |       141 
29 SON-IN-LAW'S SON/  |         0         55 |        55 
    30 BOARDER/RENTER |        26          0 |        26 
31 PAID AIDE/ HOUSEKE |     1,201          0 |     1,201 
          32 ROOMMATE |        36          0 |        36 
33 EX-WIFE/ EX-HUSBAN |       127          0 |       127 
34 BOYFRIEND/ GIRLFRI |        84          0 |        84 
          35 NEIGHBOR |       552          0 |       552 
            36 FRIEND |     6,402          0 |     6,402 
37 SOMEONE/SERVICE AT |       681          0 |       681 
         38 CO-WORKER |        40          0 |        40 
39 MINISTER, PRIEST,  |       324          0 |       324 
40 PSYCHIATRIST, PSYC |        85          0 |        85 
41 DECEASED SPOUSE/PA |       132          0 |       132 
    91 OTHER RELATIVE |         0      1,053 |     1,053 
 92 OTHER NONRELATIVE |     2,611          0 |     2,611 
----------------------+----------------------+----------
                Total |    16,949     35,336 |    52,285 


    R5 RELASHIP TO SP |     Non-relative
       UPDATE AND NEW |         0          1 |     Total
----------------------+----------------------+----------
      -1 Inapplicable |       912          0 |       912 
    2 SPOUSE/ PARTNER |     3,736          0 |     3,736 
           3 DAUGHTER |    10,420          0 |    10,420 
                4 SON |    10,355          0 |    10,355 
    5 DAUGHTER-IN-LAW |       698          0 |       698 
         6 SON-IN-LAW |       539          0 |       539 
       7 STEPDAUGHTER |     1,123          0 |     1,123 
            8 STEPSON |     1,044          0 |     1,044 
             9 SISTER |     2,244          0 |     2,244 
           10 BROTHER |     1,057          0 |     1,057 
     11 SISTER-IN-LAW |       459          0 |       459 
    12 BROTHER-IN-LAW |       179          0 |       179 
            13 MOTHER |       183          0 |       183 
        14 STEPMOTHER |         6          0 |         6 
     15 MOTHER-IN-LAW |        65          0 |        65 
            16 FATHER |        33          0 |        33 
        17 STEPFATHER |         4          0 |         4 
     18 FATHER-IN-LAW |        27          0 |        27 
     19 GRANDDAUGHTER |     2,153          0 |     2,153 
          20 GRANDSON |     1,951          0 |     1,951 
             21 NIECE |       650          0 |       650 
            22 NEPHEW |       329          0 |       329 
              23 AUNT |        75          0 |        75 
             24 UNCLE |        14          0 |        14 
            25 COUSIN |       378          0 |       378 
26 STEPDAUGHTER'S SON |        51          0 |        51 
27 STEPSON'S SON/ DAU |        50          0 |        50 
28 DAUGHTER-IN-LAW'S  |       141          0 |       141 
29 SON-IN-LAW'S SON/  |        55          0 |        55 
    30 BOARDER/RENTER |         0         26 |        26 
31 PAID AIDE/ HOUSEKE |         0      1,201 |     1,201 
          32 ROOMMATE |         0         36 |        36 
33 EX-WIFE/ EX-HUSBAN |         0        127 |       127 
34 BOYFRIEND/ GIRLFRI |         0         84 |        84 
          35 NEIGHBOR |         0        552 |       552 
            36 FRIEND |         0      6,402 |     6,402 
37 SOMEONE/SERVICE AT |         0        681 |       681 
         38 CO-WORKER |         0         40 |        40 
39 MINISTER, PRIEST,  |         0        324 |       324 
40 PSYCHIATRIST, PSYC |         0         85 |        85 
41 DECEASED SPOUSE/PA |         0        132 |       132 
    91 OTHER RELATIVE |     1,053          0 |     1,053 
 92 OTHER NONRELATIVE |         0      2,611 |     2,611 
----------------------+----------------------+----------
                Total |    39,984     12,301 |    52,285 


. 
. tab spouse wave, missing

           |                      Survey wave
    spouse |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
         0 |    34,293     34,881     33,305     31,047     48,549 |   182,075 
         1 |     3,804      3,063      2,440      1,969      3,736 |    15,012 
-----------+-------------------------------------------------------+----------
     Total |    38,097     37,944     35,745     33,016     52,285 |   197,087 


. tab otherrel wave, missing

Non-spouse |                      Survey wave
  relative |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
         0 |     8,916     10,674     11,324     11,384     16,949 |    59,247 
         1 |    29,181     27,270     24,421     21,632     35,336 |   137,840 
-----------+-------------------------------------------------------+----------
     Total |    38,097     37,944     35,745     33,016     52,285 |   197,087 


. tab nonrel wave, missing

Non-relati |                      Survey wave
        ve |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
         0 |    32,985     30,579     27,381     24,416     39,984 |   155,345 
         1 |     5,112      7,365      8,364      8,600     12,301 |    41,742 
-----------+-------------------------------------------------------+----------
     Total |    38,097     37,944     35,745     33,016     52,285 |   197,087 


. 
. ********************************************************************
. //generate variables indicating help w/ adls & iadls
. local adl insd bed eat bath toil dres

. local iadl laun shop meal bank meds 

. local nonadl out money tkpl

. gen op5tkplhlp=op5tkplhlp1
(144,802 missing values generated)

. 
. foreach x of local adl {
  2.         gen op_adl_`x'=0
  3. }

. foreach x of local iadl {
  2.         gen op_iadl_`x'=0
  3. }

. foreach x of local nonadl {
  2.         gen op_nonadl_`x'=0
  3. }

. 
. forvalues i=1/5 {
  2.         foreach x of local adl{
  3.                 replace op_adl_`x'=1 if op`i'`x'hlp==1 & wave==`i'
  4. }
  5.         foreach x of local iadl {
  6.                 replace op_iadl_`x'=1 if op`i'`x'hlp==1 & wave==`i'
  7. }
  8.         foreach x of local nonadl {
  9.                 replace op_nonadl_`x'=1 if op`i'`x'hlp==1 & wave==`i'
 10. }
 11. }
(1,146 real changes made)
(725 real changes made)
(631 real changes made)
(966 real changes made)
(496 real changes made)
(1,220 real changes made)
(3,849 real changes made)
(5,406 real changes made)
(4,857 real changes made)
(3,502 real changes made)
(1,582 real changes made)
(1,734 real changes made)
(1,191 real changes made)
op1tkplhlp ambiguous abbreviation
r(111);

end of do-file

r(111);

. do "C:\Users\bollee01\AppData\Local\Temp\5\STD00000000.tmp"

. capture log close
