---------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\nhats\nhats_code\NHATS data setup\logs2_nhats_cleaning.txt
  log type:  text
 opened on:  15 Mar 2018, 10:02:55

. 
. local work "E:\nhats\data\NHATS working data\"

. //local work /Users/rebeccagorges/Documents/data/nhats/working
. 
. cd "`work'"
E:\nhats\data\NHATS working data

. use round_1_to_6.dta

. *********************************************
. tab wave, missing

Survey wave |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,245       19.88       19.88
          2 |      7,075       17.06       36.95
          3 |      5,799       13.98       50.93
          4 |      4,737       11.42       62.35
          5 |      8,334       20.10       82.45
          6 |      7,276       17.55      100.00
------------+-----------------------------------
      Total |     41,466      100.00

. 
. *********************************************
. //interview type, varies by wave, use tracker status variables
. 
. tab r3spstat if wave==3

          R3 SUBJECT PERSON INTRVW STAT |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                               11 Ready |         68        1.17        1.17
                             12 Started |          8        0.14        1.31
                               20 Final |      5,407       93.24       94.55
                        24 Not Required |        316        5.45      100.00
----------------------------------------+-----------------------------------
                                  Total |      5,799      100.00

. tab r3status if wave==3

                 R3 OVERALL CASE STATUS |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                            60 Complete |      4,838       83.43       83.43
               61 Complete, NH facility |        213        3.67       87.10
    62 Complete SP Deceased, Proxy Intv |        523        9.02       96.12
        63 Complete SP, FQ not complete |         46        0.79       96.91
       64 Complete FQ, SP not complete  |        179        3.09      100.00
----------------------------------------+-----------------------------------
                                  Total |      5,799      100.00

. 
. gen ivw_type=3

. replace ivw_type=1 if r1spstat==20 & wave==1 
(7,609 real changes made)

. 
. foreach w in 2 3 4 5 6{
  2.         replace ivw_type=1 if (r`w'spstat==20 & r`w'status!=62) & wave==`w'
  3.         replace ivw_type=2 if (r`w'spstat==20 & r`w'status==62) & wave==`w'
  4. }
(6,056 real changes made)
(503 real changes made)
(4,884 real changes made)
(523 real changes made)
(4,037 real changes made)
(404 real changes made)
(7,576 real changes made)
(296 real changes made)
(6,410 real changes made)
(486 real changes made)

. 
. la def ivw_type 1 "Alive, SP interview completed" 2"Died, proxy SP LML interview completed" ///
>         3"SP interview not completed"

. la val ivw_type ivw_type

. tab ivw_type wave, missing

                      |                            Survey wave
             ivw_type |         1          2          3          4          5          6 |     Total
----------------------+------------------------------------------------------------------+----------
Alive, SP interview c |     7,609      6,056      4,884      4,037      7,576      6,410 |    36,572 
Died, proxy SP LML in |         0        503        523        404        296        486 |     2,212 
SP interview not comp |       636        516        392        296        462        380 |     2,682 
----------------------+------------------------------------------------------------------+----------
                Total |     8,245      7,075      5,799      4,737      8,334      7,276 |    41,466 


. 
. tab r1status r1spstat if wave==1, missing

      R1 OVERALL CASE |  R1 SUBJECT PERSON INTRVW STAT
               STATUS |  11 Ready   20 Final  24 Not Re |     Total
----------------------+---------------------------------+----------
          60 Complete |         0      7,550          0 |     7,550 
61 Complete, NH facil |         1          0        467 |       468 
63 Complete SP, FQ no |         0         59          0 |        59 
64 Complete FQ, SP no |       168          0          0 |       168 
----------------------+---------------------------------+----------
                Total |       169      7,609        467 |     8,245 


. tab r1dresid r1spstat if wave==1, missing

R1 D RESIDENTIAL CARE |  R1 SUBJECT PERSON INTRVW STAT
               STATUS |  11 Ready   20 Final  24 Not Re |     Total
----------------------+---------------------------------+----------
         1 Community  |         0      7,197          0 |     7,197 
2 Residential Care Re |         0        412          0 |       412 
3 Residential Care Re |       168          0          0 |       168 
4 Nursing Home Reside |         1          0        467 |       468 
----------------------+---------------------------------+----------
                Total |       169      7,609        467 |     8,245 


. //compare to old code, if r1dresid=1 or 2, then include in homebound paper
. //so use ivw type=1 is the same thing for r1
. 
. gen sp_ivw_yes=1 if r1spstat==20 & wave==1
(33,857 missing values generated)

. replace sp_ivw_yes=0 if inlist(r1spstat,11,24) & wave==1
(636 real changes made)

. 
. foreach w in 2 3 4 5 6{
  2.         tab r`w'status r`w'spstat if wave==`w', missing
  3.         replace sp_ivw_yes=1 if r`w'spstat==20 & wave==`w'
  4.         replace sp_ivw_yes=0 if inlist(r`w'spstat,11,12,24) & wave==`w'
  5. }

      R2 OVERALL CASE |        R2 SUBJECT PERSON INTRVW STAT
               STATUS |  11 Ready  12 Starte   20 Final  24 Not Re |     Total
----------------------+--------------------------------------------+----------
          60 Complete |         0          0      5,992          0 |     5,992 
61 Complete, NH facil |         0          0          0        326 |       326 
62 Complete SP Deceas |         0          0        503          0 |       503 
63 Complete SP, FQ no |         0          0         64          0 |        64 
64 Complete FQ, SP no |        56          1          0        133 |       190 
----------------------+--------------------------------------------+----------
                Total |        56          1      6,559        459 |     7,075 

(6,559 real changes made)
(516 real changes made)

      R3 OVERALL CASE |        R3 SUBJECT PERSON INTRVW STAT
               STATUS |  11 Ready  12 Starte   20 Final  24 Not Re |     Total
----------------------+--------------------------------------------+----------
          60 Complete |         0          0      4,838          0 |     4,838 
61 Complete, NH facil |         0          0          0        213 |       213 
62 Complete SP Deceas |         0          0        523          0 |       523 
63 Complete SP, FQ no |         0          0         46          0 |        46 
64 Complete FQ, SP no |        68          8          0        103 |       179 
----------------------+--------------------------------------------+----------
                Total |        68          8      5,407        316 |     5,799 

(5,407 real changes made)
(392 real changes made)

      R4 OVERALL CASE |        R4 SUBJECT PERSON INTRVW STAT
               STATUS |  11 Ready  12 Starte   20 Final  24 Not Re |     Total
----------------------+--------------------------------------------+----------
          60 Complete |         0          0      4,007          0 |     4,007 
61 Complete, NH facil |         0          0          0        140 |       140 
62 Complete SP Deceas |         0          0        404          0 |       404 
63 Complete SP, FQ no |         0          0         30          0 |        30 
64 Complete FQ, SP no |        79          6          0         71 |       156 
----------------------+--------------------------------------------+----------
                Total |        79          6      4,441        211 |     4,737 

(4,441 real changes made)
(296 real changes made)

      R5 OVERALL CASE |        R5 SUBJECT PERSON INTRVW STAT
               STATUS |  11 Ready  12 Starte   20 Final  24 Not Re |     Total
----------------------+--------------------------------------------+----------
          60 Complete |         0          0      7,520          0 |     7,520 
61 Complete, NH facil |         0          0          0        283 |       283 
62 Complete SP Deceas |         0          0        296          0 |       296 
63 Complete SP, FQ no |         0          0         56          0 |        56 
64 Complete FQ, SP no |       123          8          0         48 |       179 
----------------------+--------------------------------------------+----------
                Total |       123          8      7,872        331 |     8,334 

(7,872 real changes made)
(462 real changes made)

      R6 OVERALL CASE |        R6 SUBJECT PERSON INTRVW STAT
               STATUS |  11 Ready  12 Starte   20 Final  24 Not Re |     Total
----------------------+--------------------------------------------+----------
          60 Complete |         0          0      6,357          0 |     6,357 
61 Complete, NH facil |         0          0          0        203 |       203 
62 Complete SP Deceas |         0          0        486          0 |       486 
63 Complete SP, FQ no |         0          0         53          0 |        53 
64 Complete FQ, SP no |        91          5          0         81 |       177 
----------------------+--------------------------------------------+----------
                Total |        91          5      6,896        284 |     7,276 

(6,896 real changes made)
(380 real changes made)

. la var sp_ivw_yes "SP interview conducted? yes=1" //note this includes lml interviews

. tab sp_ivw_yes wave, missing

        SP |
 interview |
conducted? |                            Survey wave
     yes=1 |         1          2          3          4          5          6 |     Total
-----------+------------------------------------------------------------------+----------
         0 |       636        516        392        296        462        380 |     2,682 
         1 |     7,609      6,559      5,407      4,441      7,872      6,896 |    38,784 
-----------+------------------------------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737      8,334      7,276 |    41,466 


. 
. gen lml_ivw_yes = 0

. foreach w in 2 3 4 5 6{
  2.         replace lml_ivw_yes=1 if r`w'spstat==20 & r`w'status==62 & wave==`w'
  3. }
(503 real changes made)
(523 real changes made)
(404 real changes made)
(296 real changes made)
(486 real changes made)

. la var lml_ivw_yes "LWL interview? yes=1"

. 
. tab sp_ivw_yes lml_ivw_yes, missing

        SP |
 interview |
conducted? | LWL interview? yes=1
     yes=1 |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,682          0 |     2,682 
         1 |    36,572      2,212 |    38,784 
-----------+----------------------+----------
     Total |    39,254      2,212 |    41,466 


. tab lml_ivw_yes wave, missing

       LWL |
interview? |                            Survey wave
     yes=1 |         1          2          3          4          5          6 |     Total
-----------+------------------------------------------------------------------+----------
         0 |     8,245      6,572      5,276      4,333      8,038      6,790 |    39,254 
         1 |         0        503        523        404        296        486 |     2,212 
-----------+------------------------------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737      8,334      7,276 |    41,466 


. 
. tab mo2outoft r2status if wave==2, missing

      R2 MO1 OFTEN GO |                 R2 OVERALL CASE STATUS
              OUTSIDE | 60 Comple  61 Comple  62 Comple  63 Comple  64 Comple |     Total
----------------------+-------------------------------------------------------+----------
           -9 Missing |         0          0          0          0        190 |       190 
                -8 DK |         2          0          8          0          0 |        10 
                -7 RF |         1          0          1          0          0 |         2 
      -1 Inapplicable |         0        326        127          0          0 |       453 
1 EVERY DAY (7 DAYS A |     3,753          0         42         38          0 |     3,833 
2 MOST DAYS (5-6 DAYS |       995          0         43          9          0 |     1,047 
3 SOME DAYS (2-4 DAYS |       743          0         78          9          0 |       830 
4 RARELY (ONCE A WEEK |       371          0         88          5          0 |       464 
              5 NEVER |       127          0        116          3          0 |       246 
----------------------+-------------------------------------------------------+----------
                Total |     5,992        326        503         64        190 |     7,075 


. tab mo3outoft r3status if wave==3, missing

      R3 MO1 OFTEN GO |                 R3 OVERALL CASE STATUS
              OUTSIDE | 60 Comple  61 Comple  62 Comple  63 Comple  64 Comple |     Total
----------------------+-------------------------------------------------------+----------
           -9 Missing |         0          0          0          0        179 |       179 
                -8 DK |         5          0         14          0          0 |        19 
                -7 RF |         1          0          0          0          0 |         1 
      -1 Inapplicable |         0        213        117          0          0 |       330 
1 EVERY DAY (7 DAYS A |     2,971          0         38         20          0 |     3,029 
2 MOST DAYS (5-6 DAYS |       816          0         39         10          0 |       865 
3 SOME DAYS (2-4 DAYS |       630          0         87          8          0 |       725 
4 RARELY (ONCE A WEEK |       314          0        130          5          0 |       449 
              5 NEVER |       101          0         98          3          0 |       202 
----------------------+-------------------------------------------------------+----------
                Total |     4,838        213        523         46        179 |     5,799 


. 
. //identify proxy SP interviews
. gen proxy_ivw=.
(41,466 missing values generated)

. foreach w in 1 2 3 4 5 6{
  2. replace proxy_ivw=1 if is`w'resptype==2
  3. replace proxy_ivw=0 if is`w'resptype==1
  4. }
(583 real changes made)
(7,026 real changes made)
(964 real changes made)
(5,595 real changes made)
(897 real changes made)
(4,510 real changes made)
(722 real changes made)
(3,719 real changes made)
(779 real changes made)
(7,093 real changes made)
(894 real changes made)
(6,002 real changes made)

. la var proxy_ivw "Interview via proxy"

. tab proxy_ivw wave, missing

 Interview |                            Survey wave
 via proxy |         1          2          3          4          5          6 |     Total
-----------+------------------------------------------------------------------+----------
         0 |     7,026      5,595      4,510      3,719      7,093      6,002 |    33,945 
         1 |       583        964        897        722        779        894 |     4,839 
         . |       636        516        392        296        462        380 |     2,682 
-----------+------------------------------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737      8,334      7,276 |    41,466 


. tab proxy_ivw wave if ivw_type==1, missing

 Interview |                            Survey wave
 via proxy |         1          2          3          4          5          6 |     Total
-----------+------------------------------------------------------------------+----------
         0 |     7,026      5,595      4,510      3,719      7,093      6,002 |    33,945 
         1 |       583        461        374        318        483        408 |     2,627 
-----------+------------------------------------------------------------------+----------
     Total |     7,609      6,056      4,884      4,037      7,576      6,410 |    36,572 


. tab proxy_ivw wave if ivw_type==2, missing

 Interview |                      Survey wave
 via proxy |         2          3          4          5          6 |     Total
-----------+-------------------------------------------------------+----------
         1 |       503        523        404        296        486 |     2,212 
-----------+-------------------------------------------------------+----------
     Total |       503        523        404        296        486 |     2,212 


. 
. /*missing data convention per user guide
> For our purposes, code all as missing
> The following codes were used at the item level for missing data of different types:
> -7 = Refusal
> -8 = Don’t Know
> -1 = Inapplicable
> -9 = Not Ascertained*/
. local miss -9,-1

. 
. *********************************************
. *********************************************
. //definitions of homebound
. *********************************************
. *********************************************
. //how often go out of the house?
. gen freq_go_out=.
(41,466 missing values generated)

. foreach w in 1 2 3 4 5 6{
  2.         tab mo`w'outoft, missing
  3.         replace freq_go_out=mo`w'outoft if wave==`w'
  4. }

        R1 MO1 OFTEN GO OUTSIDE |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                     -9 Missing |        168        0.41        0.41
                          -8 DK |          5        0.01        0.42
                          -7 RF |          1        0.00        0.42
                -1 Inapplicable |        468        1.13        1.55
    1 EVERY DAY (7 DAYS A WEEK) |      4,854       11.71       13.25
  2 MOST DAYS (5-6 DAYS A WEEK) |      1,226        2.96       16.21
  3 SOME DAYS (2-4 DAYS A WEEK) |        962        2.32       18.53
 4 RARELY (ONCE A WEEK OR LESS) |        428        1.03       19.56
                        5 NEVER |        133        0.32       19.88
                              . |     33,221       80.12      100.00
--------------------------------+-----------------------------------
                          Total |     41,466      100.00
(8,245 real changes made)

       R2 MO1 OFTEN GO OUTSIDE |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
                    -9 Missing |        190        0.46        0.46
                         -8 DK |         10        0.02        0.48
                         -7 RF |          2        0.00        0.49
               -1 Inapplicable |        453        1.09        1.58
   1 EVERY DAY (7 DAYS A WEEK) |      3,833        9.24       10.82
 2 MOST DAYS (5-6 DAYS A WEEK) |      1,047        2.52       13.35
 3 SOME DAYS (2-4 DAYS A WEEK) |        830        2.00       15.35
4 RARELY (ONCE A WEEK OR LESS) |        464        1.12       16.47
                       5 NEVER |        246        0.59       17.06
                             . |     34,391       82.94      100.00
-------------------------------+-----------------------------------
                         Total |     41,466      100.00
(7,075 real changes made)

       R3 MO1 OFTEN GO OUTSIDE |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
                    -9 Missing |        179        0.43        0.43
                         -8 DK |         19        0.05        0.48
                         -7 RF |          1        0.00        0.48
               -1 Inapplicable |        330        0.80        1.28
   1 EVERY DAY (7 DAYS A WEEK) |      3,029        7.30        8.58
 2 MOST DAYS (5-6 DAYS A WEEK) |        865        2.09       10.67
 3 SOME DAYS (2-4 DAYS A WEEK) |        725        1.75       12.41
4 RARELY (ONCE A WEEK OR LESS) |        449        1.08       13.50
                       5 NEVER |        202        0.49       13.98
                             . |     35,667       86.02      100.00
-------------------------------+-----------------------------------
                         Total |     41,466      100.00
(5,799 real changes made)

       R4 MO1 OFTEN GO OUTSIDE |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
                    -9 Missing |        156        0.38        0.38
                         -8 DK |          6        0.01        0.39
               -1 Inapplicable |        159        0.38        0.77
   1 EVERY DAY (7 DAYS A WEEK) |      2,423        5.84        6.62
 2 MOST DAYS (5-6 DAYS A WEEK) |        773        1.86        8.48
 3 SOME DAYS (2-4 DAYS A WEEK) |        621        1.50        9.98
4 RARELY (ONCE A WEEK OR LESS) |        369        0.89       10.87
                       5 NEVER |        230        0.55       11.42
                             . |     36,729       88.58      100.00
-------------------------------+-----------------------------------
                         Total |     41,466      100.00
(4,737 real changes made)

       R5 MO1 OFTEN GO OUTSIDE |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
                    -9 Missing |        179        0.43        0.43
                         -8 DK |          8        0.02        0.45
               -1 Inapplicable |        292        0.70        1.16
   1 EVERY DAY (7 DAYS A WEEK) |      4,626       11.16       12.31
 2 MOST DAYS (5-6 DAYS A WEEK) |      1,420        3.42       15.74
 3 SOME DAYS (2-4 DAYS A WEEK) |      1,048        2.53       18.26
4 RARELY (ONCE A WEEK OR LESS) |        521        1.26       19.52
                       5 NEVER |        240        0.58       20.10
                             . |     33,132       79.90      100.00
-------------------------------+-----------------------------------
                         Total |     41,466      100.00
(8,334 real changes made)

       R6 MO1 OFTEN GO OUTSIDE |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
                    -9 Missing |        177        0.43        0.43
                         -8 DK |          9        0.02        0.45
                         -7 RF |          1        0.00        0.45
               -1 Inapplicable |        229        0.55        1.00
   1 EVERY DAY (7 DAYS A WEEK) |      3,803        9.17       10.17
 2 MOST DAYS (5-6 DAYS A WEEK) |      1,250        3.01       13.19
 3 SOME DAYS (2-4 DAYS A WEEK) |      1,010        2.44       15.62
4 RARELY (ONCE A WEEK OR LESS) |        506        1.22       16.85
                       5 NEVER |        291        0.70       17.55
                             . |     34,190       82.45      100.00
-------------------------------+-----------------------------------
                         Total |     41,466      100.00
(7,276 real changes made)

. 
. replace freq_go_out=. if inlist(freq_go_out,`miss')
(2,980 real changes made, 2,980 to missing)

. la def freq_go_out 1 "Every day" 2 "Most days (5-6/week)" ///
>         3 "Some days (2-4/week)" 4 "Rarely" 5 "Never"

. la val  freq_go_out freq_go_out

. la var freq_go_out "How often go outside"

. tab freq_go_out sp_ivw_yes, missing

                     |     SP interview
                     |   conducted? yes=1
How often go outside |         0          1 |     Total
---------------------+----------------------+----------
                  -8 |         0         57 |        57 
                  -7 |         0          5 |         5 
           Every day |         0     22,568 |    22,568 
Most days (5-6/week) |         0      6,581 |     6,581 
Some days (2-4/week) |         0      5,196 |     5,196 
              Rarely |         0      2,737 |     2,737 
               Never |         0      1,342 |     1,342 
                   . |     2,682        298 |     2,980 
---------------------+----------------------+----------
               Total |     2,682     38,784 |    41,466 


. tab freq_go_out sp_ivw_yes if wave==1, missing

                     |     SP interview
                     |   conducted? yes=1
How often go outside |         0          1 |     Total
---------------------+----------------------+----------
                  -8 |         0          5 |         5 
                  -7 |         0          1 |         1 
           Every day |         0      4,854 |     4,854 
Most days (5-6/week) |         0      1,226 |     1,226 
Some days (2-4/week) |         0        962 |       962 
              Rarely |         0        428 |       428 
               Never |         0        133 |       133 
                   . |       636          0 |       636 
---------------------+----------------------+----------
               Total |       636      7,609 |     8,245 


. tab freq_go_out sp_ivw_yes if wave==2 & lml_ivw_yes==0, missing

                     |     SP interview
                     |   conducted? yes=1
How often go outside |         0          1 |     Total
---------------------+----------------------+----------
                  -8 |         0          2 |         2 
                  -7 |         0          1 |         1 
           Every day |         0      3,791 |     3,791 
Most days (5-6/week) |         0      1,004 |     1,004 
Some days (2-4/week) |         0        752 |       752 
              Rarely |         0        376 |       376 
               Never |         0        130 |       130 
                   . |       516          0 |       516 
---------------------+----------------------+----------
               Total |       516      6,056 |     6,572 


. tab freq_go_out sp_ivw_yes if wave==2 & lml_ivw_yes==1, missing

                     |     SP
                     | interview
                     | conducted?
                     |   yes=1
How often go outside |         1 |     Total
---------------------+-----------+----------
                  -8 |         8 |         8 
                  -7 |         1 |         1 
           Every day |        42 |        42 
Most days (5-6/week) |        43 |        43 
Some days (2-4/week) |        78 |        78 
              Rarely |        88 |        88 
               Never |       116 |       116 
                   . |       127 |       127 
---------------------+-----------+----------
               Total |       503 |       503 


. tab freq_go_out sp_ivw_yes if wave==3 & lml_ivw_yes==0, missing

                     |     SP interview
                     |   conducted? yes=1
How often go outside |         0          1 |     Total
---------------------+----------------------+----------
                  -8 |         0          5 |         5 
                  -7 |         0          1 |         1 
           Every day |         0      2,991 |     2,991 
Most days (5-6/week) |         0        826 |       826 
Some days (2-4/week) |         0        638 |       638 
              Rarely |         0        319 |       319 
               Never |         0        104 |       104 
                   . |       392          0 |       392 
---------------------+----------------------+----------
               Total |       392      4,884 |     5,276 


. 
. 
. //MO questions not asked in lml interviews where persons were not alert(PD6)
. //or not mobile(PD7) in last month so lml has more missingless
. tab freq_go_out mo2outoft if wave==2 & lml_ivw_yes==1, missing

                     |                                 R2 MO1 OFTEN GO OUTSIDE
How often go outside |     -8 DK      -7 RF  -1 Inappl  1 EVERY D  2 MOST DA  3 SOME DA  4 RARELY     5 NEVER |     Total
---------------------+----------------------------------------------------------------------------------------+----------
                  -8 |         8          0          0          0          0          0          0          0 |         8 
                  -7 |         0          1          0          0          0          0          0          0 |         1 
           Every day |         0          0          0         42          0          0          0          0 |        42 
Most days (5-6/week) |         0          0          0          0         43          0          0          0 |        43 
Some days (2-4/week) |         0          0          0          0          0         78          0          0 |        78 
              Rarely |         0          0          0          0          0          0         88          0 |        88 
               Never |         0          0          0          0          0          0          0        116 |       116 
                   . |         0          0        127          0          0          0          0          0 |       127 
---------------------+----------------------------------------------------------------------------------------+----------
               Total |         8          1        127         42         43         78         88        116 |       503 


. 
. *********************************************
. //Did anyone ever help you - asked if report going outside
. //left missing if report never go outside
. gen help_go_out=.
(41,466 missing values generated)

. foreach w in 1 2 3 4 5 6{
  2.         tab mo`w'outhlp, missing
  3.         replace help_go_out=1 if mo`w'outhlp==1
  4.         replace help_go_out=0 if mo`w'outhlp==2
  5.         replace help_go_out=-7 if mo`w'outhlp==-7
  6.         replace help_go_out=-8 if mo`w'outhlp==-8
  7. }

 R1 MO6 HELP GO |
        OUTSIDE |      Freq.     Percent        Cum.
----------------+-----------------------------------
     -9 Missing |        168        0.41        0.41
          -8 DK |          1        0.00        0.41
          -7 RF |          1        0.00        0.41
-1 Inapplicable |        601        1.45        1.86
          1 YES |      1,045        2.52        4.38
           2 NO |      6,429       15.50       19.88
              . |     33,221       80.12      100.00
----------------+-----------------------------------
          Total |     41,466      100.00
(1,045 real changes made)
(6,429 real changes made)
(1 real change made)
(1 real change made)

       R2 MO6 HELP GO |
              OUTSIDE |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        190        0.46        0.46
                -8 DK |         10        0.02        0.48
                -7 RF |          2        0.00        0.49
      -1 Inapplicable |        699        1.69        2.17
                1 YES |      1,041        2.51        4.68
                 2 NO |      5,133       12.38       17.06
                    . |     34,391       82.94      100.00
----------------------+-----------------------------------
                Total |     41,466      100.00
(1,041 real changes made)
(5,133 real changes made)
(2 real changes made)
(10 real changes made)

       R3 MO6 HELP GO |
              OUTSIDE |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        179        0.43        0.43
                -8 DK |         17        0.04        0.47
                -7 RF |          1        0.00        0.48
      -1 Inapplicable |        532        1.28        1.76
                1 YES |        948        2.29        4.04
                 2 NO |      4,122        9.94       13.98
                    . |     35,667       86.02      100.00
----------------------+-----------------------------------
                Total |     41,466      100.00
(948 real changes made)
(4,122 real changes made)
(1 real change made)
(17 real changes made)

       R4 MO6 HELP GO |
              OUTSIDE |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        156        0.38        0.38
                -8 DK |         10        0.02        0.40
      -1 Inapplicable |        389        0.94        1.34
                1 YES |        798        1.92        3.26
                 2 NO |      3,384        8.16       11.42
                    . |     36,729       88.58      100.00
----------------------+-----------------------------------
                Total |     41,466      100.00
(798 real changes made)
(3,384 real changes made)
(0 real changes made)
(10 real changes made)

       R5 MO6 HELP GO |
              OUTSIDE |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        179        0.43        0.43
                -8 DK |         11        0.03        0.46
                -7 RF |          1        0.00        0.46
      -1 Inapplicable |        532        1.28        1.74
                1 YES |      1,155        2.79        4.53
                 2 NO |      6,456       15.57       20.10
                    . |     33,132       79.90      100.00
----------------------+-----------------------------------
                Total |     41,466      100.00
(1,155 real changes made)
(6,456 real changes made)
(1 real change made)
(11 real changes made)

       R6 MO6 HELP GO |
              OUTSIDE |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        177        0.43        0.43
                -8 DK |         14        0.03        0.46
                -7 RF |          1        0.00        0.46
      -1 Inapplicable |        520        1.25        1.72
                1 YES |      1,132        2.73        4.45
                 2 NO |      5,432       13.10       17.55
                    . |     34,190       82.45      100.00
----------------------+-----------------------------------
                Total |     41,466      100.00
(1,132 real changes made)
(5,432 real changes made)
(1 real change made)
(14 real changes made)

. la var help_go_out "Anyone ever help you leave home?"

. tab help_go_out wave if sp_ivw_yes==1, missing

    Anyone |
 ever help |
 you leave |                            Survey wave
     home? |         1          2          3          4          5          6 |     Total
-----------+------------------------------------------------------------------+----------
        -8 |         1         10         17         10         11         14 |        63 
        -7 |         1          2          1          0          1          1 |         6 
         0 |     6,429      5,133      4,122      3,384      6,456      5,432 |    30,956 
         1 |     1,045      1,041        948        798      1,155      1,132 |     6,119 
         . |       133        373        319        249        249        317 |     1,640 
-----------+------------------------------------------------------------------+----------
     Total |     7,609      6,559      5,407      4,441      7,872      6,896 |    38,784 


. 
. *********************************************
. //go out of the house on own?
. //only asked if report having help when go outside (help_go_out==1)
. gen out_on_own=.
(41,466 missing values generated)

. foreach w in 1 2 3 4 5 6{
  2.         tab mo`w'outslf help_go_out if wave==`w', missing
  3.         replace out_on_own=mo`w'outslf if wave==`w'
  4. }

 R1 MO7 LEFT BY |            Anyone ever help you leave home?
       YOURSELF |        -8         -7          0          1          . |     Total
----------------+-------------------------------------------------------+----------
     -9 Missing |         0          0          0          0        168 |       168 
-1 Inapplicable |         1          1      6,429          0        601 |     7,032 
   1 MOST TIMES |         0          0          0        184          0 |       184 
    2 SOMETIMES |         0          0          0        167          0 |       167 
       3 RARELY |         0          0          0        118          0 |       118 
        4 NEVER |         0          0          0        576          0 |       576 
----------------+-------------------------------------------------------+----------
          Total |         1          1      6,429      1,045        769 |     8,245 

(8,245 real changes made)

 R2 MO7 LEFT BY |            Anyone ever help you leave home?
       YOURSELF |        -8         -7          0          1          . |     Total
----------------+-------------------------------------------------------+----------
     -9 Missing |         0          0          0          0        190 |       190 
-1 Inapplicable |        10          2      5,133        180        699 |     6,024 
   1 MOST TIMES |         0          0          0        160          0 |       160 
    2 SOMETIMES |         0          0          0        118          0 |       118 
       3 RARELY |         0          0          0        106          0 |       106 
        4 NEVER |         0          0          0        477          0 |       477 
----------------+-------------------------------------------------------+----------
          Total |        10          2      5,133      1,041        889 |     7,075 

(7,075 real changes made)

 R3 MO7 LEFT BY |            Anyone ever help you leave home?
       YOURSELF |        -8         -7          0          1          . |     Total
----------------+-------------------------------------------------------+----------
     -9 Missing |         0          0          0          0        179 |       179 
-1 Inapplicable |        17          1      4,122        211        532 |     4,883 
   1 MOST TIMES |         0          0          0        112          0 |       112 
    2 SOMETIMES |         0          0          0        100          0 |       100 
       3 RARELY |         0          0          0         82          0 |        82 
        4 NEVER |         0          0          0        443          0 |       443 
----------------+-------------------------------------------------------+----------
          Total |        17          1      4,122        948        711 |     5,799 

(5,799 real changes made)

 R4 MO7 LEFT BY |      Anyone ever help you leave home?
       YOURSELF |        -8          0          1          . |     Total
----------------+--------------------------------------------+----------
     -9 Missing |         0          0          0        156 |       156 
-1 Inapplicable |        10      3,384        176        389 |     3,959 
   1 MOST TIMES |         0          0         98          0 |        98 
    2 SOMETIMES |         0          0         83          0 |        83 
       3 RARELY |         0          0         71          0 |        71 
        4 NEVER |         0          0        370          0 |       370 
----------------+--------------------------------------------+----------
          Total |        10      3,384        798        545 |     4,737 

(4,737 real changes made)

 R5 MO7 LEFT BY |            Anyone ever help you leave home?
       YOURSELF |        -8         -7          0          1          . |     Total
----------------+-------------------------------------------------------+----------
     -9 Missing |         0          0          0          0        179 |       179 
          -8 DK |         0          0          0          1          0 |         1 
-1 Inapplicable |        11          1      6,456        127        532 |     7,127 
   1 MOST TIMES |         0          0          0        154          0 |       154 
    2 SOMETIMES |         0          0          0        174          0 |       174 
       3 RARELY |         0          0          0        132          0 |       132 
        4 NEVER |         0          0          0        567          0 |       567 
----------------+-------------------------------------------------------+----------
          Total |        11          1      6,456      1,155        711 |     8,334 

(8,334 real changes made)

 R6 MO7 LEFT BY |            Anyone ever help you leave home?
       YOURSELF |        -8         -7          0          1          . |     Total
----------------+-------------------------------------------------------+----------
     -9 Missing |         0          0          0          0        177 |       177 
          -8 DK |         0          0          0          2          0 |         2 
-1 Inapplicable |        14          1      5,432        207        520 |     6,174 
   1 MOST TIMES |         0          0          0        160          0 |       160 
    2 SOMETIMES |         0          0          0        147          0 |       147 
       3 RARELY |         0          0          0        115          0 |       115 
        4 NEVER |         0          0          0        501          0 |       501 
----------------+-------------------------------------------------------+----------
          Total |        14          1      5,432      1,132        697 |     7,276 

(7,276 real changes made)

. replace out_on_own=. if inlist(out_on_own,`miss')
(36,248 real changes made, 36,248 to missing)

. replace out_on_own=5 if help_go_out==0
(30,956 real changes made)

. replace out_on_own=6 if freq_go_out==5
(1,342 real changes made)

. la def out_on_own 1"Most times" 2"Sometimes" 3"Rarely" 4"Never"5"NA, reported no help" ///
> 6"NA, never left home"

. la val out_on_own out_on_own

. la var out_on_own "When left house, left by yourself?"

. tab out_on_own wave if sp_ivw_yes==1, missing

    When left house, |                            Survey wave
   left by yourself? |         1          2          3          4          5          6 |     Total
---------------------+------------------------------------------------------------------+----------
                  -8 |         0          0          0          0          1          2 |         3 
          Most times |       184        160        112         98        154        160 |       868 
           Sometimes |       167        118        100         83        174        147 |       789 
              Rarely |       118        106         82         71        132        115 |       624 
               Never |       576        477        443        370        567        501 |     2,934 
NA, reported no help |     6,429      5,133      4,122      3,384      6,456      5,432 |    30,956 
 NA, never left home |       133        246        202        230        240        291 |     1,342 
                   . |         2        319        346        205        148        248 |     1,268 
---------------------+------------------------------------------------------------------+----------
               Total |     7,609      6,559      5,407      4,441      7,872      6,896 |    38,784 


. 
. *********************************************
. //needs help when go outside? gets help and also goes outside on own != never
. gen needshelp=0

. replace needshelp=1 if help_go_out==1& out_on_own~=4
(3,185 real changes made)

. la var needshelp "Leaves home but with help"

. tab needshelp wave, missing

    Leaves |
  home but |                            Survey wave
 with help |         1          2          3          4          5          6 |     Total
-----------+------------------------------------------------------------------+----------
         0 |     7,776      6,511      5,294      4,309      7,746      6,645 |    38,281 
         1 |       469        564        505        428        588        631 |     3,185 
-----------+------------------------------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737      8,334      7,276 |    41,466 


. 
. *********************************************
. //has difficulty? when you used your walker,cane,etc? how much difficulty
. //did you have leaving the house by yourself? 1=none, 2=a little, 3=some, 4=a lot
. //inapplicable if don't report using any device to help, so set to 0 here
. gen hasdifficulty=0

. foreach w in 1 2 3 4 5 6{
  2.         tab mo`w'outdif if wave==`w', missing
  3.         replace hasdifficulty=1 if inlist(mo`w'outdif,2,3,4,5)
  4.         replace hasdifficulty=0 if mo`w'outdif==1
  5.         replace hasdifficulty=-7 if  mo`w'outdif==-7
  6.         replace hasdifficulty=-8 if  mo`w'outdif==-8
  7. 
. }

     R1 MO8 HOW |
      DIFFICULT |      Freq.     Percent        Cum.
----------------+-----------------------------------
     -9 Missing |        168        2.04        2.04
          -8 DK |          2        0.02        2.06
          -7 RF |          2        0.02        2.09
-1 Inapplicable |      1,177       14.28       16.36
         1 NONE |      5,929       71.91       88.27
     2 A LITTLE |        540        6.55       94.82
         3 SOME |        295        3.58       98.40
        4 A LOT |        132        1.60      100.00
----------------+-----------------------------------
          Total |      8,245      100.00
(967 real changes made)
(0 real changes made)
(2 real changes made)
(2 real changes made)

     R2 MO8 HOW |
      DIFFICULT |      Freq.     Percent        Cum.
----------------+-----------------------------------
     -9 Missing |        190        2.69        2.69
          -8 DK |          7        0.10        2.78
          -7 RF |          2        0.03        2.81
-1 Inapplicable |      1,436       20.30       23.11
         1 NONE |      4,679       66.13       89.24
     2 A LITTLE |        468        6.61       95.86
         3 SOME |        209        2.95       98.81
        4 A LOT |         84        1.19      100.00
----------------+-----------------------------------
          Total |      7,075      100.00
(761 real changes made)
(0 real changes made)
(2 real changes made)
(7 real changes made)

     R3 MO8 HOW |
      DIFFICULT |      Freq.     Percent        Cum.
----------------+-----------------------------------
     -9 Missing |        179        3.09        3.09
          -8 DK |          3        0.05        3.14
          -7 RF |          1        0.02        3.16
-1 Inapplicable |      1,283       22.12       25.28
         1 NONE |      3,767       64.96       90.24
     2 A LITTLE |        335        5.78       96.02
         3 SOME |        170        2.93       98.95
        4 A LOT |         61        1.05      100.00
----------------+-----------------------------------
          Total |      5,799      100.00
(566 real changes made)
(0 real changes made)
(1 real change made)
(3 real changes made)

     R4 MO8 HOW |
      DIFFICULT |      Freq.     Percent        Cum.
----------------+-----------------------------------
     -9 Missing |        156        3.29        3.29
          -8 DK |          3        0.06        3.36
-1 Inapplicable |      1,001       21.13       24.49
         1 NONE |      3,062       64.64       89.13
     2 A LITTLE |        300        6.33       95.46
         3 SOME |        160        3.38       98.84
        4 A LOT |         55        1.16      100.00
----------------+-----------------------------------
          Total |      4,737      100.00
(515 real changes made)
(0 real changes made)
(0 real changes made)
(3 real changes made)

     R5 MO8 HOW |
      DIFFICULT |      Freq.     Percent        Cum.
----------------+-----------------------------------
     -9 Missing |        179        2.15        2.15
          -8 DK |          4        0.05        2.20
          -7 RF |          1        0.01        2.21
-1 Inapplicable |      1,281       15.37       17.58
         1 NONE |      5,897       70.76       88.34
     2 A LITTLE |        567        6.80       95.14
         3 SOME |        307        3.68       98.82
        4 A LOT |         98        1.18      100.00
----------------+-----------------------------------
          Total |      8,334      100.00
(972 real changes made)
(0 real changes made)
(1 real change made)
(4 real changes made)

     R6 MO8 HOW |
      DIFFICULT |      Freq.     Percent        Cum.
----------------+-----------------------------------
     -9 Missing |        177        2.43        2.43
          -8 DK |          8        0.11        2.54
          -7 RF |          1        0.01        2.56
-1 Inapplicable |      1,331       18.29       20.85
         1 NONE |      4,900       67.34       88.19
     2 A LITTLE |        508        6.98       95.18
         3 SOME |        281        3.86       99.04
        4 A LOT |         70        0.96      100.00
----------------+-----------------------------------
          Total |      7,276      100.00
(859 real changes made)
(0 real changes made)
(1 real change made)
(8 real changes made)

. la var hasdifficulty "Leaves home on own but has difficulty"

. tab hasdifficulty wave if sp_ivw_yes==1, missing

    Leaves |
   home on |
   own but |
       has |                            Survey wave
difficulty |         1          2          3          4          5          6 |     Total
-----------+------------------------------------------------------------------+----------
        -8 |         2          7          3          3          4          8 |        27 
        -7 |         2          2          1          0          1          1 |         7 
         0 |     6,638      5,789      4,837      3,923      6,895      6,028 |    34,110 
         1 |       967        761        566        515        972        859 |     4,640 
-----------+------------------------------------------------------------------+----------
     Total |     7,609      6,559      5,407      4,441      7,872      6,896 |    38,784 


. *********************************************
. //needs help or has difficulty going outside?
. gen helpdiff=.
(41,466 missing values generated)

. replace helpdiff=0 if needshelp==0 & hasdifficulty==0
(35,098 real changes made)

. replace helpdiff=1 if needshelp==1 | hasdifficulty==1
(6,341 real changes made)

. la var helpdiff "Either needs help or has difficulty going outside"

. tab helpdiff wave if sp_ivw_yes==1, missing

    Either |
needs help |
    or has |
difficulty |
     going |                            Survey wave
   outside |         1          2          3          4          5          6 |     Total
-----------+------------------------------------------------------------------+----------
         0 |     6,477      5,469      4,514      3,652      6,619      5,685 |    32,416 
         1 |     1,129      1,083        890        786      1,249      1,204 |     6,341 
         . |         3          7          3          3          4          7 |        27 
-----------+------------------------------------------------------------------+----------
     Total |     7,609      6,559      5,407      4,441      7,872      6,896 |    38,784 


. *********************************************
. //independent - go out some/most days but are independent
. gen independent=0

. replace independent=1 if help_go_out==0 & hasdifficulty==0
(27,785 real changes made)

. la var independent "Independently leaves home"

. tab independent wave if sp_ivw_yes==1, missing

Independen |
tly leaves |                            Survey wave
      home |         1          2          3          4          5          6 |     Total
-----------+------------------------------------------------------------------+----------
         0 |     1,841      1,951      1,671      1,416      2,077      2,043 |    10,999 
         1 |     5,768      4,608      3,736      3,025      5,795      4,853 |    27,785 
-----------+------------------------------------------------------------------+----------
     Total |     7,609      6,559      5,407      4,441      7,872      6,896 |    38,784 


. 
. tab independent helpdiff, missing //no overlap

Independen |     Either needs help or has
tly leaves |     difficulty going outside
      home |         0          1          . |     Total
-----------+---------------------------------+----------
         0 |     7,313      6,341         27 |    13,681 
         1 |    27,785          0          0 |    27,785 
-----------+---------------------------------+----------
     Total |    35,098      6,341         27 |    41,466 


. *********************************************
. /*homebound categories
> 0 = never go out
> 1 = rarely go out
> 2 = go out but never by self
> 3 = go out but need help/have difficulty
> 4 = go out, independent - don't need help or have difficulty
> */
. gen homebound_cat=.
(41,466 missing values generated)

. replace homebound_cat=1 if freq_go_out==4 | freq_go_out==5
(4,079 real changes made)

. replace homebound_cat=2 if inlist(freq_go_out,3,2,1) & out_on_own==4
(1,686 real changes made)

. replace homebound_cat=3 if inlist(freq_go_out,3,2,1) & helpdiff==1
(5,384 real changes made)

. replace homebound_cat=4 if inlist(freq_go_out,3,2,1) & independent==1
(27,256 real changes made)

. 
. //from technical paper
. replace homebound_cat=3 if spid==10009011 & wave==1
(1 real change made)

. 
. la var homebound_cat "Homebound status, categorical"

. la def hb 1 "Never/Rarely leaves home" 2 "Leaves home but never by self" ///
> 3 "Leaves home but needs help/has difficulty" 4 "Independent, not homebound"

. la val homebound_cat hb

. tab homebound_cat wave if sp_ivw_yes==1, missing

    Homebound status, |                            Survey wave
          categorical |         1          2          3          4          5          6 |     Total
----------------------+------------------------------------------------------------------+----------
Never/Rarely leaves h |       561        710        651        599        761        797 |     4,079 
Leaves home but never |       342        259        248        211        337        289 |     1,686 
Leaves home but needs |     1,019        918        719        630      1,073      1,026 |     5,385 
Independent, not home |     5,681      4,531      3,649      2,974      5,679      4,742 |    27,256 
                    . |         6        141        140         27         22         42 |       378 
----------------------+------------------------------------------------------------------+----------
                Total |     7,609      6,559      5,407      4,441      7,872      6,896 |    38,784 


. /*binary for never go out, since never/rarely together*/
. gen never_go_out=freq_go_out==5 if freq!=.
(2,980 missing values generated)

. label var never_go_out "Never leaves home"

. *********************************************
. /*subcategories for level 4 homeboud category
> independent but go out only rarely
> independent and go out frequently*/
. gen indeplow=0

. replace indeplow=1 if freq_go_out==3 & independent==1
(2,278 real changes made)

. la var indeplow "Independent, go out rarely" 

. 
. gen indephigh=0

. replace indephigh=1 if inlist(freq_go_out,2,1) & independent==1
(24,978 real changes made)

. la var indephigh "Independent, go out often"

. 
. tab indeplow wave if sp_ivw_yes==1, missing

Independen |
 t, go out |                            Survey wave
    rarely |         1          2          3          4          5          6 |     Total
-----------+------------------------------------------------------------------+----------
         0 |     7,150      6,199      5,096      4,185      7,413      6,463 |    36,506 
         1 |       459        360        311        256        459        433 |     2,278 
-----------+------------------------------------------------------------------+----------
     Total |     7,609      6,559      5,407      4,441      7,872      6,896 |    38,784 


. tab indephigh wave if sp_ivw_yes==1, missing

Independen |
 t, go out |                            Survey wave
     often |         1          2          3          4          5          6 |     Total
-----------+------------------------------------------------------------------+----------
         0 |     2,387      2,388      2,069      1,723      2,652      2,587 |    13,806 
         1 |     5,222      4,171      3,338      2,718      5,220      4,309 |    24,978 
-----------+------------------------------------------------------------------+----------
     Total |     7,609      6,559      5,407      4,441      7,872      6,896 |    38,784 


. 
. *********************************************
. *********************************************
. //demographic information
. *********************************************
. *********************************************
. //age at interview, note this is missing for wave 3 b/c no wave 3 sensitive data yet
. gen age=.
(41,466 missing values generated)

. foreach w in 1 2 3 4 5 6{
  2.         replace age=r`w'dintvwrage if wave==`w'
  3.         sum age if wave==`w', detail
  4.         }       
(8,245 real changes made)

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%           66             65
 5%           66             65
10%           68             65       Obs               8,245
25%           71             65       Sum of Wgt.       8,245

50%           78                      Mean            78.3698
                        Largest       Std. Dev.      8.187231
75%           84            102
90%           90            103       Variance       67.03075
95%           92            105       Skewness       .3186162
99%           97            106       Kurtosis       2.275853
(7,075 real changes made)

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -1
 5%           -1             -1
10%           67             -1       Obs               7,075
25%           71             -1       Sum of Wgt.       7,075

50%           78                      Mean           73.49385
                        Largest       Std. Dev.      22.01883
75%           85            103
90%           90            103       Variance       484.8287
95%           93            106       Skewness      -2.627003
99%           97            107       Kurtosis       9.423245
(5,799 real changes made)

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -1
 5%           -1             -1
10%           68             -1       Obs               5,799
25%           71             -1       Sum of Wgt.       5,799

50%           78                      Mean           72.61976
                        Largest       Std. Dev.      24.35733
75%           85            103
90%           90            103       Variance       593.2795
95%           93            104       Skewness      -2.372214
99%           98            104       Kurtosis       7.620767
(4,737 real changes made)

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -1
 5%           -1             -1
10%           69             -1       Obs               4,737
25%           72             -1       Sum of Wgt.       4,737

50%           79                      Mean           73.64049
                        Largest       Std. Dev.      23.94829
75%           86            103
90%           91            103       Variance       573.5204
95%           94            103       Skewness      -2.468165
99%           98            105       Kurtosis       8.139488
(8,334 real changes made)

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -1
 5%           66             -1
10%           68             -1       Obs               8,334
25%           71             -1       Sum of Wgt.       8,334

50%           78                      Mean           75.91661
                        Largest       Std. Dev.      16.76712
75%           84            103
90%           90            104       Variance       281.1363
95%           93            106       Skewness      -3.270721
99%           97            107       Kurtosis       15.92062
(7,276 real changes made)

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -1
 5%           -1             -1
10%           68             -1       Obs               7,276
25%           72             -1       Sum of Wgt.       7,276

50%           78                      Mean           74.06308
                        Largest       Std. Dev.      21.50473
75%           85            104
90%           90            105       Variance       462.4533
95%           93            107       Skewness      -2.712013
99%           98            108       Kurtosis       10.03057

. //for last month of life interviews, use age at death variable
. tab ivw_type if age==-1, missing

                              ivw_type |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
Died, proxy SP LML interview completed |      2,212      100.00      100.00
---------------------------------------+-----------------------------------
                                 Total |      2,212      100.00

. replace age=r2ddeathage if ivw_type==2 & r2dintvwrage==-1
(503 real changes made)

. sum age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     41,466      75.985    17.82843         -8        108

. //some observations that died still have missing age, so set to missing
. tab ivw_type if inlist(age,-7,-8)

                              ivw_type |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
Died, proxy SP LML interview completed |          4      100.00      100.00
---------------------------------------+-----------------------------------
                                 Total |          4      100.00

. replace age=. if inlist(age,-7,-8)
(4 real changes made, 4 to missing)

. 
. la var age "Age at interview or death"

. sum age if ivw_type==1, detail

                  Age at interview or death
-------------------------------------------------------------
      Percentiles      Smallest
 1%           66             65
 5%           67             65
10%           69             65       Obs              36,572
25%           72             65       Sum of Wgt.      36,572

50%           78                      Mean           78.67169
                        Largest       Std. Dev.      7.799021
75%           84            107
90%           90            107       Variance       60.82472
95%           92            107       Skewness       .3768395
99%           97            108       Kurtosis       2.394895

. sum age if ivw_type==2, detail

                  Age at interview or death
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -1
 5%           -1             -1
10%           -1             -1       Obs               2,208
25%           -1             -1       Sum of Wgt.       2,208

50%           -1                      Mean           18.54891
                        Largest       Std. Dev.       36.3913
75%           -1            102
90%           88            102       Variance       1324.327
95%           92            103       Skewness       1.349578
99%           98            103       Kurtosis       2.880494

. sum age, detail

                  Age at interview or death
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -1
 5%           66             -1
10%           68             -1       Obs              41,462
25%           72             -1       Sum of Wgt.      41,462

50%           78                      Mean           75.99308
                        Largest       Std. Dev.       17.8103
75%           85            107
90%           90            107       Variance       317.2069
95%           93            107       Skewness      -3.185353
99%           98            108       Kurtosis       14.55205

. 
. //gender, only asked in round 1
. gen female=.
(41,466 missing values generated)

. replace female=1 if r1dgender==2
(4,925 real changes made)

. replace female=0 if r1dgender==1
(3,320 real changes made)

. replace female=1 if r5dgender==2
(4,927 real changes made)

. replace female=0 if r5dgender==1
(3,407 real changes made)

. 
. la var female "Female"

. la def female 0"Male" 1"Female"

. la val female female

. tab female if wave==1, missing

     Female |      Freq.     Percent        Cum.
------------+-----------------------------------
       Male |      3,320       40.27       40.27
     Female |      4,925       59.73      100.00
------------+-----------------------------------
      Total |      8,245      100.00

. tab rl1dracehisp, missing

       R1 D RACE AND HISPANIC ETHNICITY |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                  1 White, non-hispanic |      5,655       13.64       13.64
                  2 Black, non-hispanic |      1,794        4.33       17.96
 3 Other (Am Indian/Asian/Native Hawaii |        231        0.56       18.52
                             4 Hispanic |        472        1.14       19.66
           5 more than one DKRF primary |          6        0.01       19.67
                                 6 DKRF |         87        0.21       19.88
                                      . |     33,221       80.12      100.00
----------------------------------------+-----------------------------------
                                  Total |     41,466      100.00

. 
. //race, ethnicity
. gen race_cat=rl1dracehisp
(33,221 missing values generated)

. replace race_cat=-8 if inlist(rl1dracehisp,5,6)
(93 real changes made)

. label define race 1 "White Non-His" 2 "Black Non-His" 4 "Hispanic" ///
>         3 "Other (Am Indian/Asian/Nat. Hawaii)" -8 "DKRF"

. label values race_cat race

. la var race_cat "Race, categorical"

. tab race_cat if wave==1, missing

                  Race, categorical |      Freq.     Percent        Cum.
------------------------------------+-----------------------------------
                               DKRF |         93        1.13        1.13
                      White Non-His |      5,655       68.59       69.71
                      Black Non-His |      1,794       21.76       91.47
Other (Am Indian/Asian/Nat. Hawaii) |        231        2.80       94.28
                           Hispanic |        472        5.72      100.00
------------------------------------+-----------------------------------
                              Total |      8,245      100.00

. 
. replace race_cat = 1 if rl5dracehisp==1
(5,703 real changes made)

. replace race_cat = 2 if rl5dracehisp==2
(1,710 real changes made)

. replace race_cat = 3 if rl5dracehisp==3
(244 real changes made)

. replace race_cat = 4 if rl5dracehisp==4
(467 real changes made)

. replace race_cat = -8 if inlist(rl5dracehisp,5,6) 
(210 real changes made)

. 
. //education
. generate education=.
(41,466 missing values generated)

. replace education=1 if inlist(el1higstschl,1,2,3)
(2,047 real changes made)

. replace education=2 if el1higstschl==4
(2,069 real changes made)

. replace education=3 if inlist(el1higstschl,5,6,7)
(1,818 real changes made)

. replace education=4 if inlist(el1higstschl,8,9)
(1,579 real changes made)

. replace education=-7 if el1higstschl == -7
(10 real changes made)

. replace education=-8 if el1higstschl == -8
(86 real changes made)

. 
. replace education=1 if inlist(el5higstschl,1,2,3)
(798 real changes made)

. replace education=2 if el5higstschl==4
(1,050 real changes made)

. replace education=3 if inlist(el5higstschl,5,6,7)
(1,037 real changes made)

. replace education=4 if inlist(el5higstschl,8,9)
(907 real changes made)

. 
. 
. la var education "Education level, categorical"

. label define edulbl 1 "<High School" 2 "High School/GED" 3 "Some College" ///
>         4 ">=Bachelors" 5 "DKRF"

. label values education edulbl

. tab education el1higstschl if wave==1, missing

      Education |
         level, |                                  R1 EL10 HGHST DGREE SCOOL COMPLD
    categorical | -9 Missin      -8 DK      -7 RF  -1 Inappl   1 NO SCH   2 1ST-8T   3 9TH-12   4 HIGH S   5 VOCATI |     Total
----------------+---------------------------------------------------------------------------------------------------+----------
             -8 |         0         86          0          0          0          0          0          0          0 |        86 
             -7 |         0          0         10          0          0          0          0          0          0 |        10 
   <High School |         0          0          0          0         89        900      1,058          0          0 |     2,047 
High School/GED |         0          0          0          0          0          0          0      2,069          0 |     2,069 
   Some College |         0          0          0          0          0          0          0          0        549 |     1,818 
    >=Bachelors |         0          0          0          0          0          0          0          0          0 |     1,579 
              . |       168          0          0        468          0          0          0          0          0 |       636 
----------------+---------------------------------------------------------------------------------------------------+----------
          Total |       168         86         10        468         89        900      1,058      2,069        549 |     8,245 


      Education |
         level, |      R1 EL10 HGHST DGREE SCOOL COMPLD
    categorical |  6 SOME C   7 ASSOCI   8 BACHEL   9 MASTER |     Total
----------------+--------------------------------------------+----------
             -8 |         0          0          0          0 |        86 
             -7 |         0          0          0          0 |        10 
   <High School |         0          0          0          0 |     2,047 
High School/GED |         0          0          0          0 |     2,069 
   Some College |       942        327          0          0 |     1,818 
    >=Bachelors |         0          0        863        716 |     1,579 
              . |         0          0          0          0 |       636 
----------------+--------------------------------------------+----------
          Total |       942        327        863        716 |     8,245 


. 
. gen educ_hs_ind=education>=2 if education>0 & education!=.
(30,161 missing values generated)

. 
. //income, just wave 1
. sum ia1totinc, detail //this is the actual reported income, only present 40% sample

                    R1 IA50 TOTAL INCOME
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -9             -9
 5%           -8             -9
10%           -8             -9       Obs               8,245
25%           -8             -9       Sum of Wgt.       8,245

50%         1003                      Mean           25276.52
                        Largest       Std. Dev.      126078.6
75%        27000        4000000
90%        60000        4000000       Variance       1.59e+10
95%        90000        5000000       Skewness       30.27629
99%       200000        5700000       Kurtosis       1121.346

. 
. forvalues i = 1/5 {
  2.         gen imputed_inc`i'=.
  3.         foreach w in 1 3 5 {
  4.                 replace ia`w'toincim`i'=. if inlist(ia`w'toincim`i',-9,-1)
  5.                 sum ia`w'toincim`i' if wave==`w',detail //imputed income variables
  6.                 replace imputed_inc`i' = ia`w'toincim`i' if wave==`w'
  7. }
  8.                 label var imputed_inc`i' "Imputed Income `i'"
  9. }
(41,466 missing values generated)
(636 real changes made, 636 to missing)

                 R1 IA50 IMPUTED TOTAL INC1
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         5000              0
10%         8000              0       Obs               7,609
25%        13000              0       Sum of Wgt.       7,609

50%        25000                      Mean           48101.73
                        Largest       Std. Dev.      174772.8
75%        50000        5000000
90%        85000        5000000       Variance       3.05e+10
95%       125000        5700000       Skewness       22.64232
99%       280000        5700000       Kurtosis       610.7911
(7,609 real changes made)
(3,804 real changes made, 3,804 to missing)

                 R3 IA50 IMPUTED TOTAL INC1
-------------------------------------------------------------
      Percentiles      Smallest
 1%            3              1
 5%         7416              1
10%         9600              1       Obs               1,995
25%        15000              1       Sum of Wgt.       1,995

50%        26000                      Mean           48386.08
                        Largest       Std. Dev.      281877.9
75%        50000         600000
90%        90000         700000       Variance       7.95e+10
95%       120000        1000000       Skewness       42.24874
99%       250000       1.24e+07       Kurtosis       1849.981
(1,995 real changes made)
(4,994 real changes made, 4,994 to missing)

                 R5 IA50 IMPUTED TOTAL INC1
-------------------------------------------------------------
      Percentiles      Smallest
 1%          500              0
 5%         7960              0
10%         9600              0       Obs               3,340
25%        15080              0       Sum of Wgt.       3,340

50%        28950                      Mean           56470.78
                        Largest       Std. Dev.      438429.2
75%      55627.5        1000000
90%       100000        1400000       Variance       1.92e+11
95%       140000        1400000       Skewness       55.19802
99%       350000       2.50e+07       Kurtosis       3138.764
(3,340 real changes made)
(41,466 missing values generated)
(636 real changes made, 636 to missing)

                 R1 IA50 IMPUTED TOTAL INC2
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         5000              0
10%         8000              0       Obs               7,609
25%        13000              0       Sum of Wgt.       7,609

50%        25000                      Mean           47400.31
                        Largest       Std. Dev.      163813.4
75%        50000        5000000
90%        85000        5000000       Variance       2.68e+10
95%       124000        5700000       Skewness       24.37988
99%       280000        5700000       Kurtosis       720.7381
(7,609 real changes made)
(3,804 real changes made, 3,804 to missing)

                 R3 IA50 IMPUTED TOTAL INC2
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%         7200              1
10%         9600              1       Obs               1,995
25%        15000              1       Sum of Wgt.       1,995

50%        26000                      Mean            47069.7
                        Largest       Std. Dev.      178641.3
75%        50000         700000
90%        90000        1000000       Variance       3.19e+10
95%       120000        1500000       Skewness       36.86894
99%       275000        7500000       Kurtosis       1522.939
(1,995 real changes made)
(4,994 real changes made, 4,994 to missing)

                 R5 IA50 IMPUTED TOTAL INC2
-------------------------------------------------------------
      Percentiles      Smallest
 1%           12              0
 5%         8000              0
10%         9600              0       Obs               3,340
25%        15104              0       Sum of Wgt.       3,340

50%        29000                      Mean           58321.44
                        Largest       Std. Dev.      473369.3
75%        55000        1200000
90%       100000        1500000       Variance       2.24e+11
95%       140000       1.05e+07       Skewness       47.05424
99%       324000       2.50e+07       Kurtosis       2379.933
(3,340 real changes made)
(41,466 missing values generated)
(636 real changes made, 636 to missing)

                 R1 IA50 IMPUTED TOTAL INC3
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         5000              0
10%         8000              0       Obs               7,609
25%        13000              0       Sum of Wgt.       7,609

50%        25000                      Mean           48033.05
                        Largest       Std. Dev.      174223.1
75%        50000        5000000
90%        85000        5000000       Variance       3.04e+10
95%       120000        5700000       Skewness       22.81822
99%       260000        5700000       Kurtosis       618.2839
(7,609 real changes made)
(3,804 real changes made, 3,804 to missing)

                 R3 IA50 IMPUTED TOTAL INC3
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%         7200              1
10%         9600              1       Obs               1,995
25%        15000              1       Sum of Wgt.       1,995

50%        26000                      Mean           47659.84
                        Largest       Std. Dev.      189034.5
75%        50000        1000000
90%        90000        1200000       Variance       3.57e+10
95%       120000        3000000       Skewness       32.89802
99%       250000        7500000       Kurtosis       1243.036
(1,995 real changes made)
(4,994 real changes made, 4,994 to missing)

                 R5 IA50 IMPUTED TOTAL INC3
-------------------------------------------------------------
      Percentiles      Smallest
 1%          650              0
 5%         8000              0
10%         9600              0       Obs               3,340
25%        15000              0       Sum of Wgt.       3,340

50%        28000                      Mean           48406.01
                        Largest       Std. Dev.      73053.08
75%        55000         800000
90%       100000        1000000       Variance       5.34e+09
95%       141000        1200000       Skewness       7.284459
99%       315000        1400000       Kurtosis       88.99018
(3,340 real changes made)
(41,466 missing values generated)
(636 real changes made, 636 to missing)

                 R1 IA50 IMPUTED TOTAL INC4
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         5000              0
10%         8000              0       Obs               7,609
25%        13000              0       Sum of Wgt.       7,609

50%        25000                      Mean           48079.98
                        Largest       Std. Dev.      173745.9
75%        50000        5000000
90%        85000        5000000       Variance       3.02e+10
95%       125000        5700000       Skewness       23.20914
99%       280000        5700000       Kurtosis       635.8328
(7,609 real changes made)
(3,804 real changes made, 3,804 to missing)

                 R3 IA50 IMPUTED TOTAL INC4
-------------------------------------------------------------
      Percentiles      Smallest
 1%            3              1
 5%         7512              1
10%        10000              1       Obs               1,995
25%        15000              1       Sum of Wgt.       1,995

50%        26000                      Mean           46867.35
                        Largest       Std. Dev.      179057.9
75%        50000         700000
90%        90000        1000000       Variance       3.21e+10
95%       120000        1500000       Skewness       36.63096
99%       300000        7500000       Kurtosis       1509.025
(1,995 real changes made)
(4,994 real changes made, 4,994 to missing)

                 R5 IA50 IMPUTED TOTAL INC4
-------------------------------------------------------------
      Percentiles      Smallest
 1%          650              0
 5%         8000              0
10%         9738              0       Obs               3,340
25%        15600              0       Sum of Wgt.       3,340

50%        29000                      Mean           49351.86
                        Largest       Std. Dev.      83170.27
75%        55000        1400000
90%       100000        1400000       Variance       6.92e+09
95%       140000        1400000       Skewness       8.931731
99%       340000        1500000       Kurtosis       120.3207
(3,340 real changes made)
(41,466 missing values generated)
(636 real changes made, 636 to missing)

                 R1 IA50 IMPUTED TOTAL INC5
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         5000              0
10%         8008              0       Obs               7,609
25%        13000              0       Sum of Wgt.       7,609

50%        25000                      Mean           48496.79
                        Largest       Std. Dev.        176243
75%        50000        5000000
90%        86000        5000000       Variance       3.11e+10
95%       126000        5700000       Skewness       22.54756
99%       265000        5700000       Kurtosis       604.0381
(7,609 real changes made)
(3,804 real changes made, 3,804 to missing)

                 R3 IA50 IMPUTED TOTAL INC5
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%         7500              1
10%         9600              1       Obs               1,995
25%        15000              1       Sum of Wgt.       1,995

50%        26000                      Mean            43795.8
                        Largest       Std. Dev.      65365.31
75%        50000         600000
90%        90000         700000       Variance       4.27e+09
95%       121000        1000000       Skewness       9.542474
99%       290000        1500000       Kurtosis       162.6787
(1,995 real changes made)
(4,994 real changes made, 4,994 to missing)

                 R5 IA50 IMPUTED TOTAL INC5
-------------------------------------------------------------
      Percentiles      Smallest
 1%          650              0
 5%         7872              0
10%         9600              0       Obs               3,340
25%        15363              0       Sum of Wgt.       3,340

50%        28000                      Mean           56612.57
                        Largest       Std. Dev.        472496
75%        55000        1200000
90%        98500        1400000       Variance       2.23e+11
95%       135500       1.05e+07       Skewness       47.32019
99%       300000       2.50e+07       Kurtosis       2398.247
(3,340 real changes made)

. 
. 
. 
. egen aveincome=rowmean(imputed_inc1-imputed_inc5)
(28522 missing values generated)

. foreach w in 1 3 5 {
  2.         replace aveincome=ia`w'totinc if wave==`w' & ia`w'totinc>=0 & ///
>         !missing(ia`w'totinc)
  3. }
(0 real changes made)
(2,889 real changes made)
(4,236 real changes made)

. 
. sort spid wave

. by spid: carryforward aveincome, replace
aveincome:  (18626 real changes made)

. //use first income imputation to set income categorical variable
. gen income_cat=0 if aveincome<15000 & aveincome!=.
(32,619 missing values generated)

. replace income_cat=1 if aveincome>=15000 & aveincome<30000 & aveincome!=.
(10,620 real changes made)

. replace income_cat=2 if aveincome>=30000 & aveincome<60000 & aveincome!=.
(10,170 real changes made)

. replace income_cat=3 if aveincome>=60000 & aveincome!=.
(9,058 real changes made)

. label define income_cat 0 "<15000" 1 "15-29,999" 2 "30-59,999" 3 ">60000"

. label values income_cat income_cat

. tab income_cat, missing

 income_cat |      Freq.     Percent        Cum.
------------+-----------------------------------
     <15000 |      8,847       21.34       21.34
  15-29,999 |     10,620       25.61       46.95
  30-59,999 |     10,170       24.53       71.47
     >60000 |      9,058       21.84       93.32
          . |      2,771        6.68      100.00
------------+-----------------------------------
      Total |     41,466      100.00

. 
. //speak language other than english?
. gen otherlang=rl1spkothlan
(33,221 missing values generated)

. replace otherlang=0 if rl1spkothlan==2
(6,178 real changes made)

. replace otherlang = 1 if rl1condspanh == 1
(228 real changes made)

. replace otherlang = . if inlist(otherlang,-9,-1)
(636 real changes made, 636 to missing)

. la var otherlang "Speak language other than English?"

. tab otherlang wave, missing

     Speak |
  language |
other than |                            Survey wave
  English? |         1          2          3          4          5          6 |     Total
-----------+------------------------------------------------------------------+----------
        -8 |        70          0          0          0          0          0 |        70 
        -7 |         5          0          0          0          0          0 |         5 
         0 |     6,178          0          0          0          0          0 |     6,178 
         1 |     1,356          0          0          0          0          0 |     1,356 
         . |       636      7,075      5,799      4,737      8,334      7,276 |    33,857 
-----------+------------------------------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737      8,334      7,276 |    41,466 


. 
. replace otherlang=0 if rl5spkothlan==2
(3,063 real changes made)

. replace otherlang=1 if rl5spkothlan==1
(582 real changes made)

. replace otherlang=1 if rl5condspanh==1
(150 real changes made)

. replace otherlang=. if inlist(rl5spkothlan,-9,-1)
(150 real changes made, 150 to missing)

. 
. 
. //fill in gender, race, education, income, etc. for wave 2 interviews
. sort spid wave

. by spid (wave): carryforward female race_cat education income_cat ///
> otherlang imputed_inc1 imputed_inc2 imputed_inc3 imputed_inc4 imputed_inc5, replace
female:  (24887 real changes made)
race_cat:  (24887 real changes made)
education:  (27022 real changes made)
income_cat:  (0 real changes made)
otherlang:  (26900 real changes made)
imputed_inc1:  (21614 real changes made)
imputed_inc2:  (21614 real changes made)
imputed_inc3:  (21614 real changes made)
imputed_inc4:  (21614 real changes made)
imputed_inc5:  (21614 real changes made)

. 
. gen white=race_cat==1

. gen black=race_cat==2

. gen hisp=race_cat==4

. gen other_race=race_cat==3

. label var white "White Non-Hisp"

. label var black "Black Non-Hisp"

. label var hisp "Hispanic"

. label var other_race "Other race/ethnicity"

. //merge white & other for reportability
. gen whiteoth=white | other_race if !missing(white) & !missing(other_r)

. label var whiteoth "White Non-Hispanic or other"

. //marital status
. //wave 2,3, use derived variable which is populated if not asked b/c no change 
. gen maritalstat=hh1martlstat if wave==1
(33,221 missing values generated)

. foreach w in 2 3 4 5 6{
  2.         replace maritalstat=hh`w'dmarstat if wave==`w'
  3. }
(7,075 real changes made)
(5,799 real changes made)
(4,737 real changes made)
(8,334 real changes made)
(7,276 real changes made)

. replace maritalstat=-9 if inlist(maritalstat,`miss')
(4,727 real changes made)

. 
. la var maritalstat "Marital status"

. label define maritallbl 1 "Married" 2 "Live w/Part" 3 "Separated" ///
>         4 "Divorced" 5 "Widowed" 6 "Never Married" -7 "Refused" -8 "DK"

. la val maritalstat maritallbl

. tab maritalstat wave, missing

      Marital |                            Survey wave
       status |         1          2          3          4          5          6 |     Total
--------------+------------------------------------------------------------------+----------
           -9 |       636      1,020        915        700        758        866 |     4,895 
           DK |         3          1          2          0          3          0 |         9 
      Refused |         6          0          0          0          3          0 |         9 
      Married |     3,647      2,804      2,216      1,784      3,498      2,912 |    16,861 
  Live w/Part |       151        119         88         73        155        129 |       715 
    Separated |       128         97         77         69        141        105 |       617 
     Divorced |       796        631        510        432        901        760 |     4,030 
      Widowed |     2,578      2,160      1,802      1,522      2,570      2,245 |    12,877 
Never Married |       300        243        189        157        305        259 |     1,453 
--------------+------------------------------------------------------------------+----------
        Total |     8,245      7,075      5,799      4,737      8,334      7,276 |    41,466 


. 
. 
. 
. 
. *********************************************
. *********************************************
. //Insurance coverage
. *********************************************
. *********************************************
. //medicaid status
. gen medicaid=.
(41,466 missing values generated)

. foreach w in 1 2 3 4 5 6{
  2.         tab ip`w'cmedicaid if wave==`w' , missing
  3.         replace medicaid=1 if ip`w'cmedicaid==1 & wave==`w'
  4.         replace medicaid=0 if ip`w'cmedicaid==2 & wave==`w'
  5.         replace medicaid=-7 if ip`w'cmedicaid==-7 & wave==`w'
  6.         replace medicaid=-8 if ip`w'cmedicaid==-8 & wave==`w'
  7. }

  R1 IP4 COV BY |
 STATE MEDICAID |
            PRG |      Freq.     Percent        Cum.
----------------+-----------------------------------
     -9 Missing |        168        2.04        2.04
          -8 DK |        191        2.32        4.35
          -7 RF |         16        0.19        4.55
-1 Inapplicable |        468        5.68       10.22
          1 YES |      1,173       14.23       24.45
           2 NO |      6,229       75.55      100.00
----------------+-----------------------------------
          Total |      8,245      100.00
(1,173 real changes made)
(6,229 real changes made)
(16 real changes made)
(191 real changes made)

  R2 IP4 COV BY STATE |
         MEDICAID PRG |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        190        2.69        2.69
                -8 DK |        117        1.65        4.34
                -7 RF |          6        0.08        4.42
      -1 Inapplicable |        829       11.72       16.14
                1 YES |        986       13.94       30.08
                 2 NO |      4,947       69.92      100.00
----------------------+-----------------------------------
                Total |      7,075      100.00
(986 real changes made)
(4,947 real changes made)
(6 real changes made)
(117 real changes made)

  R3 IP4 COV BY STATE |
         MEDICAID PRG |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        179        3.09        3.09
                -8 DK |        200        3.45        6.54
                -7 RF |         21        0.36        6.90
      -1 Inapplicable |        736       12.69       19.59
                1 YES |        740       12.76       32.35
                 2 NO |      3,923       67.65      100.00
----------------------+-----------------------------------
                Total |      5,799      100.00
(740 real changes made)
(3,923 real changes made)
(21 real changes made)
(200 real changes made)

  R4 IP4 COV BY STATE |
         MEDICAID PRG |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        156        3.29        3.29
                -8 DK |        206        4.35        7.64
                -7 RF |          4        0.08        7.73
      -1 Inapplicable |        544       11.48       19.21
                1 YES |        615       12.98       32.19
                 2 NO |      3,212       67.81      100.00
----------------------+-----------------------------------
                Total |      4,737      100.00
(615 real changes made)
(3,212 real changes made)
(4 real changes made)
(206 real changes made)

  R5 IP4 COV BY STATE |
         MEDICAID PRG |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        179        2.15        2.15
                -8 DK |        388        4.66        6.80
                -7 RF |         16        0.19        7.00
      -1 Inapplicable |        579        6.95       13.94
                1 YES |      1,103       13.23       27.18
                 2 NO |      6,069       72.82      100.00
----------------------+-----------------------------------
                Total |      8,334      100.00
(1,103 real changes made)
(6,069 real changes made)
(16 real changes made)
(388 real changes made)

  R6 IP4 COV BY STATE |
         MEDICAID PRG |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        177        2.43        2.43
                -8 DK |        197        2.71        5.14
                -7 RF |          6        0.08        5.22
      -1 Inapplicable |        689        9.47       14.69
                1 YES |        992       13.63       28.33
                 2 NO |      5,215       71.67      100.00
----------------------+-----------------------------------
                Total |      7,276      100.00
(992 real changes made)
(5,215 real changes made)
(6 real changes made)
(197 real changes made)

. la var medicaid "Medicaid"

. tab medicaid wave,missing

           |                            Survey wave
  Medicaid |         1          2          3          4          5          6 |     Total
-----------+------------------------------------------------------------------+----------
        -8 |       191        117        200        206        388        197 |     1,299 
        -7 |        16          6         21          4         16          6 |        69 
         0 |     6,229      4,947      3,923      3,212      6,069      5,215 |    29,595 
         1 |     1,173        986        740        615      1,103        992 |     5,609 
         . |       636      1,019        915        700        758        866 |     4,894 
-----------+------------------------------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737      8,334      7,276 |    41,466 


. tab medicaid if wave==1 & ivw_type==1,missing

   Medicaid |      Freq.     Percent        Cum.
------------+-----------------------------------
         -8 |        191        2.51        2.51
         -7 |         16        0.21        2.72
          0 |      6,229       81.86       84.58
          1 |      1,173       15.42      100.00
------------+-----------------------------------
      Total |      7,609      100.00

. //medigap status
. gen medigap=.
(41,466 missing values generated)

. foreach w in 1 2 3 4 5 6{
  2.         tab ip`w'mgapmedsp if wave==`w' , missing
  3.         replace medigap=1 if ip`w'mgapmedsp==1 & wave==`w'
  4.         replace medigap=0 if ip`w'mgapmedsp==2 & wave==`w'
  5.         replace medigap=-7 if ip`w'mgapmedsp==-7 & wave==`w'
  6.         replace medigap=-8 if ip`w'mgapmedsp==-8 & wave==`w'
  7. }

 R1 IP3 MEDIGAP |
    OR MEDICARE |
           SUPP |      Freq.     Percent        Cum.
----------------+-----------------------------------
     -9 Missing |        168        2.04        2.04
          -8 DK |        255        3.09        5.13
          -7 RF |         21        0.25        5.39
-1 Inapplicable |        468        5.68       11.06
          1 YES |      4,207       51.02       62.09
           2 NO |      3,126       37.91      100.00
----------------+-----------------------------------
          Total |      8,245      100.00
(4,207 real changes made)
(3,126 real changes made)
(21 real changes made)
(255 real changes made)

    R2 IP3 MEDIGAP OR |
        MEDICARE SUPP |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        190        2.69        2.69
                -8 DK |        176        2.49        5.17
                -7 RF |          9        0.13        5.30
      -1 Inapplicable |        829       11.72       17.02
                1 YES |      3,697       52.25       69.27
                 2 NO |      2,174       30.73      100.00
----------------------+-----------------------------------
                Total |      7,075      100.00
(3,697 real changes made)
(2,174 real changes made)
(9 real changes made)
(176 real changes made)

    R3 IP3 MEDIGAP OR |
        MEDICARE SUPP |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        179        3.09        3.09
                -8 DK |        247        4.26        7.35
                -7 RF |         22        0.38        7.73
      -1 Inapplicable |        736       12.69       20.42
                1 YES |      2,966       51.15       71.56
                 2 NO |      1,649       28.44      100.00
----------------------+-----------------------------------
                Total |      5,799      100.00
(2,966 real changes made)
(1,649 real changes made)
(22 real changes made)
(247 real changes made)

    R4 IP3 MEDIGAP OR |
        MEDICARE SUPP |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        156        3.29        3.29
                -8 DK |        275        5.81        9.10
                -7 RF |          4        0.08        9.18
      -1 Inapplicable |        544       11.48       20.67
                1 YES |      2,483       52.42       73.08
                 2 NO |      1,275       26.92      100.00
----------------------+-----------------------------------
                Total |      4,737      100.00
(2,483 real changes made)
(1,275 real changes made)
(4 real changes made)
(275 real changes made)

    R5 IP3 MEDIGAP OR |
        MEDICARE SUPP |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        179        2.15        2.15
                -8 DK |        440        5.28        7.43
                -7 RF |         16        0.19        7.62
      -1 Inapplicable |        579        6.95       14.57
                1 YES |      4,498       53.97       68.54
                 2 NO |      2,622       31.46      100.00
----------------------+-----------------------------------
                Total |      8,334      100.00
(4,498 real changes made)
(2,622 real changes made)
(16 real changes made)
(440 real changes made)

    R6 IP3 MEDIGAP OR |
        MEDICARE SUPP |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        177        2.43        2.43
                -8 DK |        276        3.79        6.23
                -7 RF |          7        0.10        6.32
      -1 Inapplicable |        689        9.47       15.79
                1 YES |      4,069       55.92       71.72
                 2 NO |      2,058       28.28      100.00
----------------------+-----------------------------------
                Total |      7,276      100.00
(4,069 real changes made)
(2,058 real changes made)
(7 real changes made)
(276 real changes made)

. la var medigap "Medigap"

. tab medigap wave,missing

           |                            Survey wave
   Medigap |         1          2          3          4          5          6 |     Total
-----------+------------------------------------------------------------------+----------
        -8 |       255        176        247        275        440        276 |     1,669 
        -7 |        21          9         22          4         16          7 |        79 
         0 |     3,126      2,174      1,649      1,275      2,622      2,058 |    12,904 
         1 |     4,207      3,697      2,966      2,483      4,498      4,069 |    21,920 
         . |       636      1,019        915        700        758        866 |     4,894 
-----------+------------------------------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737      8,334      7,276 |    41,466 


. 
. //medicare part d
. gen mc_partd=.
(41,466 missing values generated)

. foreach w in 1 2 3 4 5 6{
  2.         tab ip`w'covmedcad if wave==`w' , missing
  3.         replace mc_partd=1 if ip`w'covmedcad==1 & wave==`w'
  4.         replace mc_partd=0 if ip`w'covmedcad==2 & wave==`w'
  5.         replace mc_partd=-7 if ip`w'covmedcad==-7 & wave==`w'
  6.         replace mc_partd=-8 if ip`w'covmedcad==-8 & wave==`w'
  7. }

  R1 IP1 COVERD |
    BY MEDICARE |
         PART D |      Freq.     Percent        Cum.
----------------+-----------------------------------
     -9 Missing |        168        2.04        2.04
          -8 DK |        335        4.06        6.10
          -7 RF |         23        0.28        6.38
-1 Inapplicable |        468        5.68       12.06
          1 YES |      4,575       55.49       67.54
           2 NO |      2,676       32.46      100.00
----------------+-----------------------------------
          Total |      8,245      100.00
(4,575 real changes made)
(2,676 real changes made)
(23 real changes made)
(335 real changes made)

     R2 IP1 COVERD BY |
      MEDICARE PART D |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        190        2.69        2.69
                -8 DK |        252        3.56        6.25
                -7 RF |          5        0.07        6.32
      -1 Inapplicable |        829       11.72       18.04
                1 YES |      3,938       55.66       73.70
                 2 NO |      1,861       26.30      100.00
----------------------+-----------------------------------
                Total |      7,075      100.00
(3,938 real changes made)
(1,861 real changes made)
(5 real changes made)
(252 real changes made)

     R3 IP1 COVERD BY |
      MEDICARE PART D |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        179        3.09        3.09
                -8 DK |        314        5.41        8.50
                -7 RF |         21        0.36        8.86
      -1 Inapplicable |        736       12.69       21.56
                1 YES |      3,155       54.41       75.96
                 2 NO |      1,394       24.04      100.00
----------------------+-----------------------------------
                Total |      5,799      100.00
(3,155 real changes made)
(1,394 real changes made)
(21 real changes made)
(314 real changes made)

     R4 IP1 COVERD BY |
      MEDICARE PART D |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        156        3.29        3.29
                -8 DK |        346        7.30       10.60
                -7 RF |          6        0.13       10.72
      -1 Inapplicable |        544       11.48       22.21
                1 YES |      2,606       55.01       77.22
                 2 NO |      1,079       22.78      100.00
----------------------+-----------------------------------
                Total |      4,737      100.00
(2,606 real changes made)
(1,079 real changes made)
(6 real changes made)
(346 real changes made)

     R5 IP1 COVERD BY |
      MEDICARE PART D |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        179        2.15        2.15
                -8 DK |        578        6.94        9.08
                -7 RF |         14        0.17        9.25
      -1 Inapplicable |        579        6.95       16.20
                1 YES |      4,873       58.47       74.67
                 2 NO |      2,111       25.33      100.00
----------------------+-----------------------------------
                Total |      8,334      100.00
(4,873 real changes made)
(2,111 real changes made)
(14 real changes made)
(578 real changes made)

     R6 IP1 COVERD BY |
      MEDICARE PART D |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        177        2.43        2.43
                -8 DK |        422        5.80        8.23
                -7 RF |          8        0.11        8.34
      -1 Inapplicable |        689        9.47       17.81
                1 YES |      4,281       58.84       76.65
                 2 NO |      1,699       23.35      100.00
----------------------+-----------------------------------
                Total |      7,276      100.00
(4,281 real changes made)
(1,699 real changes made)
(8 real changes made)
(422 real changes made)

. la var mc_partd "Medicare Part D"

. tab mc_partd wave,missing

  Medicare |                            Survey wave
    Part D |         1          2          3          4          5          6 |     Total
-----------+------------------------------------------------------------------+----------
        -8 |       335        252        314        346        578        422 |     2,247 
        -7 |        23          5         21          6         14          8 |        77 
         0 |     2,676      1,861      1,394      1,079      2,111      1,699 |    10,820 
         1 |     4,575      3,938      3,155      2,606      4,873      4,281 |    23,428 
         . |       636      1,019        915        700        758        866 |     4,894 
-----------+------------------------------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737      8,334      7,276 |    41,466 


. 
. //tricare - va insurance
. gen tricare=.
(41,466 missing values generated)

. foreach w in 1 2 3 4 5 6{
  2.         tab ip`w'covtricar if wave==`w' , missing
  3.         replace tricare=1 if ip`w'covtricar==1 & wave==`w'
  4.         replace tricare=0 if ip`w'covtricar==2 & wave==`w'
  5.         replace tricare=-7 if ip`w'covtricar==-7 & wave==`w'
  6.         replace tricare=-8 if ip`w'covtricar==-8 & wave==`w'
  7. }

 R1 IP5 COVERED |
     BY TRICARE |      Freq.     Percent        Cum.
----------------+-----------------------------------
     -9 Missing |        168        2.04        2.04
          -8 DK |        127        1.54        3.58
          -7 RF |         16        0.19        3.77
-1 Inapplicable |        468        5.68        9.45
          1 YES |        413        5.01       14.46
           2 NO |      7,053       85.54      100.00
----------------+-----------------------------------
          Total |      8,245      100.00
(413 real changes made)
(7,053 real changes made)
(16 real changes made)
(127 real changes made)

    R2 IP5 COVERED BY |
              TRICARE |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        190        2.69        2.69
                -8 DK |         65        0.92        3.60
                -7 RF |          5        0.07        3.67
      -1 Inapplicable |        829       11.72       15.39
                1 YES |        350        4.95       20.34
                 2 NO |      5,636       79.66      100.00
----------------------+-----------------------------------
                Total |      7,075      100.00
(350 real changes made)
(5,636 real changes made)
(5 real changes made)
(65 real changes made)

    R3 IP5 COVERED BY |
              TRICARE |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        179        3.09        3.09
                -8 DK |        151        2.60        5.69
                -7 RF |         21        0.36        6.05
      -1 Inapplicable |        736       12.69       18.74
                1 YES |        284        4.90       23.64
                 2 NO |      4,428       76.36      100.00
----------------------+-----------------------------------
                Total |      5,799      100.00
(284 real changes made)
(4,428 real changes made)
(21 real changes made)
(151 real changes made)

    R4 IP5 COVERED BY |
              TRICARE |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        156        3.29        3.29
                -8 DK |        165        3.48        6.78
                -7 RF |          3        0.06        6.84
      -1 Inapplicable |        544       11.48       18.32
                1 YES |        238        5.02       23.35
                 2 NO |      3,631       76.65      100.00
----------------------+-----------------------------------
                Total |      4,737      100.00
(238 real changes made)
(3,631 real changes made)
(3 real changes made)
(165 real changes made)

    R5 IP5 COVERED BY |
              TRICARE |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        179        2.15        2.15
                -8 DK |        274        3.29        5.44
                -7 RF |         12        0.14        5.58
      -1 Inapplicable |        579        6.95       12.53
                1 YES |        430        5.16       17.69
                 2 NO |      6,860       82.31      100.00
----------------------+-----------------------------------
                Total |      8,334      100.00
(430 real changes made)
(6,860 real changes made)
(12 real changes made)
(274 real changes made)

    R6 IP5 COVERED BY |
              TRICARE |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        177        2.43        2.43
                -8 DK |        126        1.73        4.16
                -7 RF |          5        0.07        4.23
      -1 Inapplicable |        689        9.47       13.70
                1 YES |        399        5.48       19.19
                 2 NO |      5,880       80.81      100.00
----------------------+-----------------------------------
                Total |      7,276      100.00
(399 real changes made)
(5,880 real changes made)
(5 real changes made)
(126 real changes made)

. la var tricare "Tricare - veterans insurance"

. tab tricare wave,missing

 Tricare - |
  veterans |                            Survey wave
 insurance |         1          2          3          4          5          6 |     Total
-----------+------------------------------------------------------------------+----------
        -8 |       127         65        151        165        274        126 |       908 
        -7 |        16          5         21          3         12          5 |        62 
         0 |     7,053      5,636      4,428      3,631      6,860      5,880 |    33,488 
         1 |       413        350        284        238        430        399 |     2,114 
         . |       636      1,019        915        700        758        866 |     4,894 
-----------+------------------------------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737      8,334      7,276 |    41,466 


. 
. //long term care nursing home insurance, private
. gen private_ltc=.
(41,466 missing values generated)

. foreach w in 1 2 3 4 5 6{
  2.         tab ip`w'nginsnurs if wave==`w' , missing
  3.         replace private_ltc=1 if ip`w'nginsnurs==1 & wave==`w'
  4.         replace private_ltc=0 if ip`w'nginsnurs==2 & wave==`w'
  5.         replace private_ltc=-7 if ip`w'nginsnurs==-7 & wave==`w'
  6.         replace private_ltc=-8 if ip`w'nginsnurs==-8 & wave==`w'
  7. }

  R1 IP6 NONGOV |
  INSR FOR NURS |
           HOME |      Freq.     Percent        Cum.
----------------+-----------------------------------
     -9 Missing |        168        2.04        2.04
          -8 DK |        472        5.72        7.76
          -7 RF |         21        0.25        8.02
-1 Inapplicable |        468        5.68       13.69
          1 YES |      1,179       14.30       27.99
           2 NO |      5,937       72.01      100.00
----------------+-----------------------------------
          Total |      8,245      100.00
(1,179 real changes made)
(5,937 real changes made)
(21 real changes made)
(472 real changes made)

   R2 IP6 NONGOV INSR |
        FOR NURS HOME |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        190        2.69        2.69
                -8 DK |        291        4.11        6.80
                -7 RF |         10        0.14        6.94
      -1 Inapplicable |      1,824       25.78       32.72
                1 YES |        329        4.65       37.37
                 2 NO |      4,431       62.63      100.00
----------------------+-----------------------------------
                Total |      7,075      100.00
(329 real changes made)
(4,431 real changes made)
(10 real changes made)
(291 real changes made)

   R3 IP6 NONGOV INSR |
        FOR NURS HOME |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        179        3.09        3.09
                -8 DK |        334        5.76        8.85
                -7 RF |         18        0.31        9.16
      -1 Inapplicable |      1,723       29.71       38.87
                1 YES |        180        3.10       41.97
                 2 NO |      3,365       58.03      100.00
----------------------+-----------------------------------
                Total |      5,799      100.00
(180 real changes made)
(3,365 real changes made)
(18 real changes made)
(334 real changes made)

   R4 IP6 NONGOV INSR |
        FOR NURS HOME |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        156        3.29        3.29
                -8 DK |        356        7.52       10.81
                -7 RF |          3        0.06       10.87
      -1 Inapplicable |      1,443       30.46       41.33
                1 YES |        147        3.10       44.44
                 2 NO |      2,632       55.56      100.00
----------------------+-----------------------------------
                Total |      4,737      100.00
(147 real changes made)
(2,632 real changes made)
(3 real changes made)
(356 real changes made)

   R5 IP6 NONGOV INSR |
        FOR NURS HOME |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        179        2.15        2.15
                -8 DK |        681        8.17       10.32
                -7 RF |         18        0.22       10.54
      -1 Inapplicable |      1,422       17.06       27.60
                1 YES |        761        9.13       36.73
                 2 NO |      5,273       63.27      100.00
----------------------+-----------------------------------
                Total |      8,334      100.00
(761 real changes made)
(5,273 real changes made)
(18 real changes made)
(681 real changes made)

   R6 IP6 NONGOV INSR |
        FOR NURS HOME |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           -9 Missing |        177        2.43        2.43
                -8 DK |        454        6.24        8.67
                -7 RF |          8        0.11        8.78
      -1 Inapplicable |      1,979       27.20       35.98
                1 YES |        281        3.86       39.84
                 2 NO |      4,377       60.16      100.00
----------------------+-----------------------------------
                Total |      7,276      100.00
(281 real changes made)
(4,377 real changes made)
(8 real changes made)
(454 real changes made)

. la var private_ltc "Private nursing home insurance"

. tab private_ltc wave,missing

   Private |
   nursing |
      home |                            Survey wave
 insurance |         1          2          3          4          5          6 |     Total
-----------+------------------------------------------------------------------+----------
        -8 |       472        291        334        356        681        454 |     2,588 
        -7 |        21         10         18          3         18          8 |        78 
         0 |     5,937      4,431      3,365      2,632      5,273      4,377 |    26,015 
         1 |     1,179        329        180        147        761        281 |     2,877 
         . |       636      2,014      1,902      1,599      1,601      2,156 |     9,908 
-----------+------------------------------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737      8,334      7,276 |    41,466 


. 
. //if report nh insurance in prev wave, asked to verify still have it curr wave
. foreach w in 2 3 4 5 6{
  2. tab ip`w'nginslast if wave==`w' & ip`w'nginsnurs==-1, missing
  3. replace private_ltc=1 if ip`w'nginslast==1 & ip`w'nginsnurs==-1 & wave==`w'
  4. replace private_ltc=0 if ip`w'nginslast==2 & ip`w'nginsnurs==-1 & wave==`w'
  5. replace private_ltc=-7 if ip`w'nginslast==-7 & ip`w'nginsnurs==-1 & wave==`w'
  6. replace private_ltc=-8 if ip`w'nginslast==-8 & ip`w'nginsnurs==-1 & wave==`w'
  7. }

     R2 IP5A HAVE LTC INS FROM LAST INT |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                  -8 DK |         14        0.77        0.77
                                  -7 RF |          2        0.11        0.88
                        -1 Inapplicable |        829       45.45       46.33
                                  1 YES |        931       51.04       97.37
                                   2 NO |         48        2.63      100.00
----------------------------------------+-----------------------------------
                                  Total |      1,824      100.00
(931 real changes made)
(48 real changes made)
(2 real changes made)
(14 real changes made)

     R3 IP5A HAVE LTC INS FROM LAST INT |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                  -8 DK |         44        2.55        2.55
                                  -7 RF |          3        0.17        2.73
                        -1 Inapplicable |        736       42.72       45.44
                                  1 YES |        892       51.77       97.21
                                   2 NO |         48        2.79      100.00
----------------------------------------+-----------------------------------
                                  Total |      1,723      100.00
(892 real changes made)
(48 real changes made)
(3 real changes made)
(44 real changes made)

     R4 IP5A HAVE LTC INS FROM LAST INT |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                  -8 DK |         40        2.77        2.77
                                  -7 RF |          1        0.07        2.84
                        -1 Inapplicable |        544       37.70       40.54
                                  1 YES |        810       56.13       96.67
                                   2 NO |         48        3.33      100.00
----------------------------------------+-----------------------------------
                                  Total |      1,443      100.00
(810 real changes made)
(48 real changes made)
(1 real change made)
(40 real changes made)

     R5 IP5A HAVE LTC INS FROM LAST INT |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                  -8 DK |         35        2.46        2.46
                                  -7 RF |          1        0.07        2.53
                        -1 Inapplicable |        579       40.72       43.25
                                  1 YES |        758       53.31       96.55
                                   2 NO |         49        3.45      100.00
----------------------------------------+-----------------------------------
                                  Total |      1,422      100.00
(758 real changes made)
(49 real changes made)
(1 real change made)
(35 real changes made)

     R6 IP5A HAVE LTC INS FROM LAST INT |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                  -8 DK |         44        2.22        2.22
                                  -7 RF |          2        0.10        2.32
                        -1 Inapplicable |        689       34.82       37.14
                                  1 YES |      1,167       58.97       96.11
                                   2 NO |         77        3.89      100.00
----------------------------------------+-----------------------------------
                                  Total |      1,979      100.00
(1,167 real changes made)
(77 real changes made)
(2 real changes made)
(44 real changes made)

. tab private_ltc wave,missing

   Private |
   nursing |
      home |                            Survey wave
 insurance |         1          2          3          4          5          6 |     Total
-----------+------------------------------------------------------------------+----------
        -8 |       472        305        378        396        716        498 |     2,765 
        -7 |        21         12         21          4         19         10 |        87 
         0 |     5,937      4,479      3,413      2,680      5,322      4,454 |    26,285 
         1 |     1,179      1,260      1,072        957      1,519      1,448 |     7,435 
         . |       636      1,019        915        700        758        866 |     4,894 
-----------+------------------------------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737      8,334      7,276 |    41,466 


. 
. *********************************************
. *********************************************
. //Residence information
. *********************************************
. *********************************************
. //residence physical structure variable only in wave 1
. tab re1resistrct if wave==1, missing

       R1 RE1 RESIDNCE PHYSICAL STRCTUR |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                             -9 Missing |        168        2.04        2.04
                        -1 Inapplicable |        468        5.68        7.71
 1 FREE-STANDING (DETACHED) SINGLE HOUS |      5,483       66.50       74.21
 2 SINGLE HOUSE BUT ATTACHED TO OTHERS  |        615        7.46       81.67
               3 MOBILE HOME OR TRAILER |        344        4.17       85.85
             4 MULTI-UNIT (2+) BUILDING |      1,110       13.46       99.31
                     91 OTHER (SPECIFY) |         57        0.69      100.00
----------------------------------------+-----------------------------------
                                  Total |      8,245      100.00

. tab re1resistrct ht1placedesc if wave==1, missing

      R1 RE1 RESIDNCE |                        R1 HT3 PLACE BEST DESCRIPTION
     PHYSICAL STRCTUR | -9 Missin  -1 Inappl   1 PRIVAT   2 A GROU   3 ASSIST   4 RELIGI  91 OTHER  |     Total
----------------------+-----------------------------------------------------------------------------+----------
           -9 Missing |       168          0          0          0          0          0          0 |       168 
      -1 Inapplicable |         0        468          0          0          0          0          0 |       468 
 1 FREE-STANDING (DET |         0          0      5,450         10         14          1          8 |     5,483 
 2 SINGLE HOUSE BUT A |         0          0        587          5          8          1         14 |       615 
 3 MOBILE HOME OR TRA |         0        344          0          0          0          0          0 |       344 
 4 MULTI-UNIT (2+) BU |         0      1,110          0          0          0          0          0 |     1,110 
   91 OTHER (SPECIFY) |         0         57          0          0          0          0          0 |        57 
----------------------+-----------------------------------------------------------------------------+----------
                Total |       168      1,979      6,037         15         22          2         22 |     8,245 


. //derived variable in waves 2, 3
. tab re2dresistrct if wave==2, missing

         R2 D RESIDNCE PHYSICAL STRCTUR |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                        -1 Inapplicable |      1,019       14.40       14.40
1 FREE-STANDING (DETACHED) SINGLE HOUSE |      4,315       60.99       75.39
2 SINGLE HOUSE BUT ATTACHED TO OTHERS ( |        475        6.71       82.11
               3 MOBILE HOME OR TRAILER |        281        3.97       86.08
             4 MULTI-UNIT (2+) BUILDING |        916       12.95       99.02
                     91 OTHER (SPECIFY) |         69        0.98      100.00
----------------------------------------+-----------------------------------
                                  Total |      7,075      100.00

. //per user guide, need to fix this variable since incorrectly coded for 71 obs
. replace re2dresistrct = re2newstrct if inlist(re2spadrsnew,1,3) & inlist(re2newstrct,1,2,3,4,91)
(71 real changes made)

. 
. tab re3dresistrct if wave==3, missing

         R3 D RESIDNCE PHYSICAL STRCTUR |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                        -1 Inapplicable |        915       15.78       15.78
1 FREE-STANDING (DETACHED) SINGLE HOUSE |      3,470       59.84       75.62
2 SINGLE HOUSE BUT ATTACHED TO OTHERS ( |        383        6.60       82.22
               3 MOBILE HOME OR TRAILER |        234        4.04       86.26
             4 MULTI-UNIT (2+) BUILDING |        737       12.71       98.97
                     91 OTHER (SPECIFY) |         60        1.03      100.00
----------------------------------------+-----------------------------------
                                  Total |      5,799      100.00

. 
. //housing type in each wave, however missing if same residence as prior wave
. foreach w in 1 2 3{
  2. tab ht`w'placedesc if wave==`w', missing
  3. }

          R1 HT3 PLACE BEST DESCRIPTION |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                             -9 Missing |        168        2.04        2.04
                        -1 Inapplicable |      1,979       24.00       26.04
                    1 PRIVATE RESIDENCE |      6,037       73.22       99.26
 2 A GROUP HOME, BOARD AND CARE, OR SUP |         15        0.18       99.44
 3 ASSISTED LIVING FACILITY OR CONTINUI |         22        0.27       99.71
             4 RELIGIOUS GROUP QUARTERS |          2        0.02       99.73
                     91 OTHER (SPECIFY) |         22        0.27      100.00
----------------------------------------+-----------------------------------
                                  Total |      8,245      100.00

          R2 HT3 PLACE BEST DESCRIPTION |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                             -9 Missing |        190        2.69        2.69
                        -1 Inapplicable |      6,718       94.95       97.64
                    1 PRIVATE RESIDENCE |        150        2.12       99.76
2 A GROUP HOME, BOARD AND CARE, OR SUPE |          4        0.06       99.82
3 ASSISTED LIVING FACILITY OR CONTINUIN |          8        0.11       99.93
                     91 OTHER (SPECIFY) |          5        0.07      100.00
----------------------------------------+-----------------------------------
                                  Total |      7,075      100.00

          R3 HT3 PLACE BEST DESCRIPTION |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                             -9 Missing |        179        3.09        3.09
                        -1 Inapplicable |      5,489       94.65       97.74
                    1 PRIVATE RESIDENCE |        118        2.03       99.78
2 A GROUP HOME, BOARD AND CARE, OR SUPE |          5        0.09       99.86
3 ASSISTED LIVING FACILITY OR CONTINUIN |          5        0.09       99.95
                     91 OTHER (SPECIFY) |          3        0.05      100.00
----------------------------------------+-----------------------------------
                                  Total |      5,799      100.00

. 
. //if missing housing type in waves 2,3, backfill with wave 1 info
. //get indicators for moving in waves 2 or 3
. tab re2dadrscorr, missing

  R2 D RE4F ADDRESS SAME DIFF CORRECTED |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                             -9 Missing |        190        0.46        0.46
                        -1 Inapplicable |        326        0.79        1.24
                    1 YES, SAME ADDRESS |      6,041       14.57       15.81
                2 NO, DIFFERENT ADDRESS |        470        1.13       16.95
3 YES, SAME ADDRESS WITH MINOR CORRECTI |         48        0.12       17.06
                                      . |     34,391       82.94      100.00
----------------------------------------+-----------------------------------
                                  Total |     41,466      100.00

. 
. gen w2_moved=1 if re2dadrscorr==2
(40,996 missing values generated)

. replace w2_moved=0 if re2dadrscorr==1 | re2dadrscorr==3
(6,089 real changes made)

. tab w2_moved

   w2_moved |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,089       92.83       92.83
          1 |        470        7.17      100.00
------------+-----------------------------------
      Total |      6,559      100.00

. 
. tab re3spadrsnew, missing

        R3 RE4F SP ADDRESS SAME OR DIFF |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                             -9 Missing |        179        0.43        0.43
                        -1 Inapplicable |        213        0.51        0.95
                    1 YES, SAME ADDRESS |      5,022       12.11       13.06
                2 NO, DIFFERENT ADDRESS |        346        0.83       13.89
3 YES, SAME ADDRESS WITH MINOR CORRECTI |         39        0.09       13.98
                                      . |     35,667       86.02      100.00
----------------------------------------+-----------------------------------
                                  Total |     41,466      100.00

. gen w3_moved=1 if re3spadrsnew==2
(41,120 missing values generated)

. replace w3_moved=0 if re3spadrsnew==1 | re3spadrsnew==3
(5,061 real changes made)

. tab w3_moved

   w3_moved |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,061       93.60       93.60
          1 |        346        6.40      100.00
------------+-----------------------------------
      Total |      5,407      100.00

. 
. gen w4_moved=1 if re4spadrsnew==2
(41,164 missing values generated)

. replace w4_moved=0 if re4spadrsnew==1 | re4spadrsnew==3
(4,139 real changes made)

. tab w4_moved

   w4_moved |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,139       93.20       93.20
          1 |        302        6.80      100.00
------------+-----------------------------------
      Total |      4,441      100.00

. 
. gen w5_moved=1 if re5spadrsnew==2
(41,254 missing values generated)

. replace w5_moved=0 if re5spadrsnew==1 | re5spadrsnew==3
(3,697 real changes made)

. tab w5_moved

   w5_moved |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,697       94.58       94.58
          1 |        212        5.42      100.00
------------+-----------------------------------
      Total |      3,909      100.00

. 
. gen w6_moved=1 if re6spadrsnew==2
(41,088 missing values generated)

. replace w6_moved=0 if re6spadrsnew==1 | re6spadrsnew==3
(6,505 real changes made)

. tab w6_moved

   w6_moved |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,505       94.51       94.51
          1 |        378        5.49      100.00
------------+-----------------------------------
      Total |      6,883      100.00

. 
. gen ht_new=.
(41,466 missing values generated)

. foreach w in 1 2 3 4 5 6{
  2. replace ht_new=ht`w'placedesc if wave==`w'
  3. }
(8,245 real changes made)
(7,075 real changes made)
(5,799 real changes made)
(4,737 real changes made)
(8,334 real changes made)
(7,276 real changes made)

. 
. foreach w in 2 3 4 5 6{
  2. replace ht_new=. if ht`w'placedesc==-1 & w`w'_moved==0
  3. }
(6,089 real changes made, 6,089 to missing)
(5,060 real changes made, 5,060 to missing)
(4,139 real changes made, 4,139 to missing)
(3,697 real changes made, 3,697 to missing)
(6,505 real changes made, 6,505 to missing)

. 
. tab ht_new wave, missing

           |                            Survey wave
    ht_new |         1          2          3          4          5          6 |     Total
-----------+------------------------------------------------------------------+----------
        -9 |       168        190        179        156        179        177 |     1,049 
        -1 |     1,979        629        429        326      1,202        433 |     4,998 
         1 |     6,037        150        118        108      3,229        145 |     9,787 
         2 |        15          4          5          2         14          7 |        47 
         3 |        22          8          5          6          7          7 |        55 
         4 |         2          0          0          0          3          0 |         5 
        91 |        22          5          3          0          3          2 |        35 
         . |         0      6,089      5,060      4,139      3,697      6,505 |    25,490 
-----------+------------------------------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737      8,334      7,276 |    41,466 


. 
. sort spid wave

. by spid (wave): carryforward ht_new, replace
ht_new:  (25490 real changes made)

. 
. tab ht_new wave, missing

           |                            Survey wave
    ht_new |         1          2          3          4          5          6 |     Total
-----------+------------------------------------------------------------------+----------
        -9 |       168        214        215        213        222        207 |     1,239 
        -1 |     1,979      1,861      1,507      1,175      1,974      1,772 |    10,268 
         1 |     6,037      4,943      4,019      3,298      6,076      5,231 |    29,604 
         2 |        15         15         17         14         26         25 |       112 
         3 |        22         21         20         23         21         25 |       132 
         4 |         2          2          2          2          5          5 |        18 
        91 |        22         19         19         12         10         11 |        93 
-----------+------------------------------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737      8,334      7,276 |    41,466 


. 
. //most residence information from wave 1
. //used derived variables wave 2,3
. gen residence=.
(41,466 missing values generated)

. replace residence=re1resistrct if wave==1
(8,245 real changes made)

. replace residence=re2dresistrct if wave==2
(7,075 real changes made)

. replace residence=re3dresistrct if wave==3
(5,799 real changes made)

. replace residence=re4dresistrct if wave==4
(4,737 real changes made)

. replace residence=re5dresistrct if wave==5
(8,334 real changes made)

. replace residence=re6dresistrct if wave==6
(7,276 real changes made)

. replace residence=3 if inlist(residence,4,91)
(6,027 real changes made)

. 
. tab residence wave

           |                            Survey wave
 residence |         1          2          3          4          5          6 |     Total
-----------+------------------------------------------------------------------+----------
        -9 |       168          0          0          0          0          0 |       168 
        -1 |       468      1,019        915        428        760        866 |     4,456 
         1 |     5,483      4,309      3,470      3,019      5,400      4,536 |    26,217 
         2 |       615        483        383        342        618        521 |     2,962 
         3 |     1,511      1,264      1,031        948      1,556      1,353 |     7,663 
-----------+------------------------------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737      8,334      7,276 |    41,466 


. 
. //now overwrite with the new housing type description as done in orig code
. replace residence=1 if ht_new==1
(3,645 real changes made)

. replace residence=2 if inlist(ht_new,2,3,4,91)
(214 real changes made)

. replace residence=. if inlist(residence,-9,-1)
(3,773 real changes made, 3,773 to missing)

. tab residence wave, missing

           |                            Survey wave
 residence |         1          2          3          4          5          6 |     Total
-----------+------------------------------------------------------------------+----------
         1 |     6,037      4,971      4,038      3,312      6,087      5,238 |    29,683 
         2 |        61         76         73         66         72         74 |       422 
         3 |     1,511      1,244      1,013        931      1,544      1,345 |     7,588 
         . |       636        784        675        428        631        619 |     3,773 
-----------+------------------------------------------------------------------+----------
     Total |     8,245      7,075      5,799      4,737      8,334      7,276 |    41,466 


. 
. label define residlbl 1 "Private Res." 2 "Group Home/Facility" ///
>         3 "Mobile Home/Multi-Unit"

. label values residence residlbl

. tab residence if wave==1, missing

             residence |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
          Private Res. |      6,037       73.22       73.22
   Group Home/Facility |         61        0.74       73.96
Mobile Home/Multi-Unit |      1,511       18.33       92.29
                     . |        636        7.71      100.00
-----------------------+-----------------------------------
                 Total |      8,245      100.00

. tab residence if wave==2, missing

             residence |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
          Private Res. |      4,971       70.26       70.26
   Group Home/Facility |         76        1.07       71.34
Mobile Home/Multi-Unit |      1,244       17.58       88.92
                     . |        784       11.08      100.00
-----------------------+-----------------------------------
                 Total |      7,075      100.00

. tab residence if wave==3, missing

             residence |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
          Private Res. |      4,038       69.63       69.63
   Group Home/Facility |         73        1.26       70.89
Mobile Home/Multi-Unit |      1,013       17.47       88.36
                     . |        675       11.64      100.00
-----------------------+-----------------------------------
                 Total |      5,799      100.00

. tab residence if wave==4, missing

             residence |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
          Private Res. |      3,312       69.92       69.92
   Group Home/Facility |         66        1.39       71.31
Mobile Home/Multi-Unit |        931       19.65       90.96
                     . |        428        9.04      100.00
-----------------------+-----------------------------------
                 Total |      4,737      100.00

. tab residence if wave==5, missing

             residence |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
          Private Res. |      6,087       73.04       73.04
   Group Home/Facility |         72        0.86       73.90
Mobile Home/Multi-Unit |      1,544       18.53       92.43
                     . |        631        7.57      100.00
-----------------------+-----------------------------------
                 Total |      8,334      100.00

. tab residence if wave==6, missing

             residence |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
          Private Res. |      5,238       71.99       71.99
   Group Home/Facility |         74        1.02       73.01
Mobile Home/Multi-Unit |      1,345       18.49       91.49
                     . |        619        8.51      100.00
-----------------------+-----------------------------------
                 Total |      7,276      100.00

. 
. 
. ***********************************************************
. //living arrangement, NHATS derived variable
. gen livearrang=.
(41,466 missing values generated)

. foreach w in 1 2 3 4 5 6{
  2. tab hh`w'dlvngarrg if wave==`w' & ivw_type==1, missing
  3. replace livearrang=hh`w'dlvngarrg if wave==`w'
  4. replace livearrang=1 if (hh`w'dlvngarrg==-9 & hh`w'dhshldnum==1)  & wave==`w'
  5. replace livearrang=-7 if hh`w'dlvngarrg == -7 & wave == `w'
  6. replace livearrang=-8 if hh`w'dlvngarrg == -8 & wave == `w'
  7. }

                R1 D LIVING ARRANGEMENT |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                            -9 Missing  |         31        0.41        0.41
                               1 Alone  |      2,474       32.51       32.92
2 With spouse/partner only [spouse/part |      3,050       40.08       73.01
  3 With spouse/partner and with others |        688        9.04       82.05
                    4 With others only  |      1,366       17.95      100.00
----------------------------------------+-----------------------------------
                                  Total |      7,609      100.00
(8,245 real changes made)
(31 real changes made)
(0 real changes made)
(0 real changes made)

                R2 D LIVING ARRANGEMENT |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                1 Alone |      1,972       32.56       32.56
2 With spouse/partner only (spouse/part |      2,285       37.73       70.29
  3 With spouse/partner and with others |        574        9.48       79.77
                     4 With others only |      1,225       20.23      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,056      100.00
(7,075 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

                R3 D LIVING ARRANGEMENT |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                1 Alone |      1,757       35.97       35.97
2 With spouse/partner only (spouse/part |      1,754       35.91       71.89
  3 With spouse/partner and with others |        433        8.87       80.75
                     4 With others only |        940       19.25      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,884      100.00
(5,799 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

                R4 D LIVING ARRANGEMENT |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                1 Alone |      1,479       36.64       36.64
2 With spouse/partner only (spouse/part |      1,433       35.50       72.13
  3 With spouse/partner and with others |        354        8.77       80.90
                     4 With others only |        771       19.10      100.00
----------------------------------------+-----------------------------------
                                  Total |      4,037      100.00
(4,737 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

                R5 D LIVING ARRANGEMENT |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                1 Alone |      2,620       34.58       34.58
2 With spouse/partner only (spouse/part |      2,884       38.07       72.65
  3 With spouse/partner and with others |        689        9.09       81.74
                     4 With others only |      1,383       18.26      100.00
----------------------------------------+-----------------------------------
                                  Total |      7,576      100.00
(8,334 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

                R6 D LIVING ARRANGEMENT |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                1 Alone |      2,223       34.68       34.68
2 With spouse/partner only (spouse/part |      2,371       36.99       71.67
  3 With spouse/partner and with others |        604        9.42       81.09
                     4 With others only |      1,212       18.91      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,410      100.00
(7,276 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. replace livearrang=. if livearrang==-1 
(4,894 real changes made, 4,894 to missing)

. 
. la var livearrang "Living arrangmeent, categorical"

. la def livearrang 1 "Alone" 2 "With spouse/partner" ///
>         3"With spouse/partner + others" 4 "With others"

. la val livearrang livearrang

. tab livearrang wave if ivw_type==1, missing

  Living arrangmeent, |                            Survey wave
          categorical |         1          2          3          4          5          6 |     Total
----------------------+------------------------------------------------------------------+----------
                Alone |     2,505      1,972      1,757      1,479      2,620      2,223 |    12,556 
  With spouse/partner |     3,050      2,285      1,754      1,433      2,884      2,371 |    13,777 
With spouse/partner + |       688        574        433        354        689        604 |     3,342 
          With others |     1,366      1,225        940        771      1,383      1,212 |     6,897 
----------------------+------------------------------------------------------------------+----------
                Total |     7,609      6,056      4,884      4,037      7,576      6,410 |    36,572 


. 
. //live alone?
. gen livealone=1 if livearrang==1
(28,910 missing values generated)

. replace livealone=0 if inlist(livearrang,2,3,4)
(24,016 real changes made)

. la var livealone "Lives alone"

. tab livealone livearrang, missing

     Lives |            Living arrangmeent, categorical
     alone |     Alone  With spou  With spou  With othe          . |     Total
-----------+-------------------------------------------------------+----------
         0 |         0     13,777      3,342      6,897          0 |    24,016 
         1 |    12,556          0          0          0          0 |    12,556 
         . |         0          0          0          0      4,894 |     4,894 
-----------+-------------------------------------------------------+----------
     Total |    12,556     13,777      3,342      6,897      4,894 |    41,466 


. 
. save round_1_6_cleanv1.dta, replace
file round_1_6_cleanv1.dta saved

. local ivars age female race_cat education  income_cat otherlang maritalstat medicaid medigap mc_partd tricare private_ltc w2_moved w3
> _moved ht_new residence livearrang livealone

. foreach w in `ivars'{
  2. 
. tab `w'
  3. 
. 
. }

     Age at |
  interview |
   or death |      Freq.     Percent        Cum.
------------+-----------------------------------
         -1 |      1,709        4.12        4.12
         65 |        117        0.28        4.40
         66 |        686        1.65        6.06
         67 |      1,075        2.59        8.65
         68 |      1,405        3.39       12.04
         69 |      1,524        3.68       15.72
         70 |      1,599        3.86       19.57
         71 |      1,730        4.17       23.74
         72 |      1,757        4.24       27.98
         73 |      1,620        3.91       31.89
         74 |      1,590        3.83       35.72
         75 |      1,531        3.69       39.42
         76 |      1,666        4.02       43.43
         77 |      1,607        3.88       47.31
         78 |      1,553        3.75       51.06
         79 |      1,557        3.76       54.81
         80 |      1,547        3.73       58.54
         81 |      1,611        3.89       62.43
         82 |      1,561        3.76       66.19
         83 |      1,553        3.75       69.94
         84 |      1,523        3.67       73.61
         85 |      1,389        3.35       76.96
         86 |      1,387        3.35       80.31
         87 |      1,193        2.88       83.18
         88 |      1,083        2.61       85.80
         89 |        985        2.38       88.17
         90 |        844        2.04       90.21
         91 |        813        1.96       92.17
         92 |        746        1.80       93.97
         93 |        649        1.57       95.53
         94 |        487        1.17       96.71
         95 |        399        0.96       97.67
         96 |        305        0.74       98.41
         97 |        210        0.51       98.91
         98 |        144        0.35       99.26
         99 |        106        0.26       99.52
        100 |         75        0.18       99.70
        101 |         52        0.13       99.82
        102 |         42        0.10       99.92
        103 |         17        0.04       99.96
        104 |          5        0.01       99.98
        105 |          3        0.01       99.98
        106 |          3        0.01       99.99
        107 |          3        0.01      100.00
        108 |          1        0.00      100.00
------------+-----------------------------------
      Total |     41,462      100.00

     Female |      Freq.     Percent        Cum.
------------+-----------------------------------
       Male |     16,734       40.36       40.36
     Female |     24,732       59.64      100.00
------------+-----------------------------------
      Total |     41,466      100.00

                  Race, categorical |      Freq.     Percent        Cum.
------------------------------------+-----------------------------------
                               DKRF |        614        1.48        1.48
                      White Non-His |     28,752       69.34       70.82
                      Black Non-His |      8,722       21.03       91.85
Other (Am Indian/Asian/Nat. Hawaii) |      1,116        2.69       94.54
                           Hispanic |      2,262        5.46      100.00
------------------------------------+-----------------------------------
                              Total |     41,466      100.00

      Education |
         level, |
    categorical |      Freq.     Percent        Cum.
----------------+-----------------------------------
             -8 |        260        0.68        0.68
             -7 |         43        0.11        0.79
   <High School |      9,446       24.58       25.37
High School/GED |     10,286       26.77       52.14
   Some College |      9,494       24.71       76.85
    >=Bachelors |      8,894       23.15      100.00
----------------+-----------------------------------
          Total |     38,423      100.00

 income_cat |      Freq.     Percent        Cum.
------------+-----------------------------------
     <15000 |      8,847       22.86       22.86
  15-29,999 |     10,620       27.45       50.31
  30-59,999 |     10,170       26.28       76.59
     >60000 |      9,058       23.41      100.00
------------+-----------------------------------
      Total |     38,695      100.00

      Speak |
   language |
 other than |
   English? |      Freq.     Percent        Cum.
------------+-----------------------------------
         -8 |        214        0.56        0.56
         -7 |         15        0.04        0.60
          0 |     31,527       82.63       83.23
          1 |      6,398       16.77      100.00
------------+-----------------------------------
      Total |     38,154      100.00

      Marital |
       status |      Freq.     Percent        Cum.
--------------+-----------------------------------
           -9 |      4,895       11.80       11.80
           DK |          9        0.02       11.83
      Refused |          9        0.02       11.85
      Married |     16,861       40.66       52.51
  Live w/Part |        715        1.72       54.23
    Separated |        617        1.49       55.72
     Divorced |      4,030        9.72       65.44
      Widowed |     12,877       31.05       96.50
Never Married |      1,453        3.50      100.00
--------------+-----------------------------------
        Total |     41,466      100.00

   Medicaid |      Freq.     Percent        Cum.
------------+-----------------------------------
         -8 |      1,299        3.55        3.55
         -7 |         69        0.19        3.74
          0 |     29,595       80.92       84.66
          1 |      5,609       15.34      100.00
------------+-----------------------------------
      Total |     36,572      100.00

    Medigap |      Freq.     Percent        Cum.
------------+-----------------------------------
         -8 |      1,669        4.56        4.56
         -7 |         79        0.22        4.78
          0 |     12,904       35.28       40.06
          1 |     21,920       59.94      100.00
------------+-----------------------------------
      Total |     36,572      100.00

   Medicare |
     Part D |      Freq.     Percent        Cum.
------------+-----------------------------------
         -8 |      2,247        6.14        6.14
         -7 |         77        0.21        6.35
          0 |     10,820       29.59       35.94
          1 |     23,428       64.06      100.00
------------+-----------------------------------
      Total |     36,572      100.00

  Tricare - |
   veterans |
  insurance |      Freq.     Percent        Cum.
------------+-----------------------------------
         -8 |        908        2.48        2.48
         -7 |         62        0.17        2.65
          0 |     33,488       91.57       94.22
          1 |      2,114        5.78      100.00
------------+-----------------------------------
      Total |     36,572      100.00

    Private |
    nursing |
       home |
  insurance |      Freq.     Percent        Cum.
------------+-----------------------------------
         -8 |      2,765        7.56        7.56
         -7 |         87        0.24        7.80
          0 |     26,285       71.87       79.67
          1 |      7,435       20.33      100.00
------------+-----------------------------------
      Total |     36,572      100.00

   w2_moved |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,089       92.83       92.83
          1 |        470        7.17      100.00
------------+-----------------------------------
      Total |      6,559      100.00

   w3_moved |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,061       93.60       93.60
          1 |        346        6.40      100.00
------------+-----------------------------------
      Total |      5,407      100.00

     ht_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         -9 |      1,239        2.99        2.99
         -1 |     10,268       24.76       27.75
          1 |     29,604       71.39       99.14
          2 |        112        0.27       99.41
          3 |        132        0.32       99.73
          4 |         18        0.04       99.78
         91 |         93        0.22      100.00
------------+-----------------------------------
      Total |     41,466      100.00

             residence |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
          Private Res. |     29,683       78.75       78.75
   Group Home/Facility |        422        1.12       79.87
Mobile Home/Multi-Unit |      7,588       20.13      100.00
-----------------------+-----------------------------------
                 Total |     37,693      100.00

         Living arrangmeent, |
                 categorical |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                       Alone |     12,556       34.33       34.33
         With spouse/partner |     13,777       37.67       72.00
With spouse/partner + others |      3,342        9.14       81.14
                 With others |      6,897       18.86      100.00
-----------------------------+-----------------------------------
                       Total |     36,572      100.00

Lives alone |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,016       65.67       65.67
          1 |     12,556       34.33      100.00
------------+-----------------------------------
      Total |     36,572      100.00

. 
. 
. 
. 
. *********************************************
. log close
      name:  <unnamed>
       log:  E:\nhats\nhats_code\NHATS data setup\logs2_nhats_cleaning.txt
  log type:  text
 closed on:  15 Mar 2018, 10:03:10
---------------------------------------------------------------------------------------------------------------------------------------
