--------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\nhats\nhats_code\NHATS data setup\logs1a-help_hours_imputation-LOG.txt
  log type:  text
 opened on:   4 Apr 2016, 14:29:36

. 
. //PC file paths
. local r1raw "E:\nhats\data\NHATS Public\round_1\"

. local r2raw "E:\nhats\data\NHATS Public\round_2\"

. local r3raw "E:\nhats\data\NHATS Public\round_3\"

. local r4raw "E:\nhats\data\NHATS PUBLIC\round_4\"

. local work "E:\nhats\data\NHATS working data\"

. local r1s "E:\nhats\data\NHATS Sensitive\r1_sensitive\"

. local r2s "E:\nhats\data\NHATS Sensitive\r2_sensitive\"

. local r3s "E:\nhats\data\NHATS Sensitive\r3_sensitive\"

. local r4s "E:\nhats\data\NHATS Sensitive\r4_sensitive\"

. 
. /* //Rebecca mac file paths
> local r1raw /Users/rebeccagorges/Documents/data/nhats/round_1/
> local r2raw /Users/rebeccagorges/Documents/data/nhats/round_2/
> local r3raw /Users/rebeccagorges/Documents/data/nhats/round_3/
> local work /Users/rebeccagorges/Documents/data/nhats/working
> local r1s /Users/rebeccagorges/Documents/data/nhats/r1_sensitive/
> local r2s /Users/rebeccagorges/Documents/data/nhats/r2_sensitive/ 
>  */
.  
. cd "`work'"
E:\nhats\data\NHATS working data

. 
. **User note: This section can be commented out after run one time to set up datasets
. ********************************************************************
. //combine op and sp data files
. //round 1
. use "`r1raw'NHATS_Round_1_OP_File_v2.dta", clear

. 
end of do-file

. tab op1ishelp

 R1 BXHL1 HELPS |
             SP |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     26,500       69.56       69.56
          1 Yes |     11,597       30.44      100.00
----------------+-----------------------------------
          Total |     38,097      100.00

. tab op1insdhl

 R1 MO19A HELPS |
SP INSIDE HOUSE |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |     36,951       96.99       96.99
          1 Yes |      1,146        3.01      100.00
----------------+-----------------------------------
          Total |     38,097      100.00

. tab op1ishelp op1insdh

                |   R1 MO19A HELPS SP
 R1 BXHL1 HELPS |     INSIDE HOUSE
             SP | -1 Inappl      1 Yes |     Total
----------------+----------------------+----------
-1 Inapplicable |    26,433         67 |    26,500 
          1 Yes |    10,518      1,079 |    11,597 
----------------+----------------------+----------
          Total |    36,951      1,146 |    38,097 


. tab op1dhrsm op1ishelp

 R1 D HL2 HL3 HL4 HRS |   R1 BXHL1 HELPS SP
           HELP MONTH | -1 Inappl      1 Yes |     Total
----------------------+----------------------+----------
    -11:hours missing |         0        253 |       253 
     -10:days missing |         0        103 |       103 
  -9:days+hrs missing |         0        729 |       729 
            -1:Inapp. |    26,500          0 |    26,500 
                    1 |         0      1,093 |     1,093 
                    2 |         0        554 |       554 
                    3 |         0        219 |       219 
                    4 |         0        834 |       834 
                    5 |         0        134 |       134 
                    6 |         0        291 |       291 
                    7 |         0         68 |        68 
                    8 |         0        285 |       285 
                    9 |         0        291 |       291 
                   10 |         0        191 |       191 
                   11 |         0          2 |         2 
                   12 |         0        197 |       197 
                   13 |         0        118 |       118 
                   14 |         0         72 |        72 
                   15 |         0        118 |       118 
                   16 |         0        129 |       129 
                   17 |         0        126 |       126 
                   18 |         0         36 |        36 
                   20 |         0        139 |       139 
                   21 |         0         33 |        33 
                   22 |         0         66 |        66 
                   23 |         0          2 |         2 
                   24 |         0         92 |        92 
                   25 |         0         34 |        34 
                   26 |         0        134 |       134 
                   27 |         0          2 |         2 
                   28 |         0         31 |        31 
                   30 |         0        531 |       531 
                   31 |         0         41 |        41 
                   32 |         0         41 |        41 
                   33 |         0          1 |         1 
                   35 |         0        116 |       116 
                   36 |         0         24 |        24 
                   39 |         0         47 |        47 
                   40 |         0         62 |        62 
                   42 |         0         23 |        23 
                   43 |         0         60 |        60 
                   44 |         0          4 |         4 
                   45 |         0         23 |        23 
                   46 |         0          2 |         2 
                   48 |         0         24 |        24 
                   49 |         0          7 |         7 
                   50 |         0         28 |        28 
                   52 |         0         76 |        76 
                   54 |         0          1 |         1 
                   56 |         0         27 |        27 
                   60 |         0        304 |       304 
                   61 |         0        219 |       219 
                   62 |         0         34 |        34 
                   63 |         0          3 |         3 
                   64 |         0          9 |         9 
                   65 |         0         54 |        54 
                   69 |         0         40 |        40 
                   70 |         0          8 |         8 
                   72 |         0         11 |        11 
                   75 |         0         15 |        15 
                   78 |         0         18 |        18 
                   80 |         0         23 |        23 
                   84 |         0          8 |         8 
                   87 |         0         38 |        38 
                   90 |         0        146 |       146 
                   91 |         0        122 |       122 
                   93 |         0         13 |        13 
                   95 |         0          1 |         1 
                   96 |         0         16 |        16 
                   98 |         0          2 |         2 
                  100 |         0         23 |        23 
                  104 |         0         45 |        45 
                  105 |         0          3 |         3 
                  108 |         0         23 |        23 
                  112 |         0          4 |         4 
                  120 |         0        139 |       139 
                  121 |         0        108 |       108 
                  124 |         0         20 |        20 
                  125 |         0          6 |         6 
                  126 |         0          1 |         1 
                  128 |         0          2 |         2 
                  130 |         0         10 |        10 
                  135 |         0          1 |         1 
                  139 |         0          2 |         2 
                  140 |         0          6 |         6 
                  150 |         0         81 |        81 
                  152 |         0         81 |        81 
                  154 |         0          1 |         1 
                  155 |         0         17 |        17 
                  156 |         0         11 |        11 
                  160 |         0          9 |         9 
                  161 |         0          1 |         1 
                  168 |         0         28 |        28 
                  173 |         0         20 |        20 
                  176 |         0          1 |         1 
                  180 |         0         43 |        43 
                  182 |         0         56 |        56 
                  184 |         0          1 |         1 
                  186 |         0         12 |        12 
                  191 |         0          1 |         1 
                  195 |         0          5 |         5 
                  200 |         0          9 |         9 
                  208 |         0         16 |        16 
                  210 |         0          8 |         8 
                  212 |         0         27 |        27 
                  216 |         0          1 |         1 
                  217 |         0          4 |         4 
                  220 |         0          1 |         1 
                  224 |         0          2 |         2 
                  225 |         0          1 |         1 
                  234 |         0          2 |         2 
                  240 |         0         73 |        73 
                  242 |         0        101 |       101 
                  248 |         0         18 |        18 
                  250 |         0          1 |         1 
                  252 |         0          3 |         3 
                  260 |         0          7 |         7 
                  270 |         0          2 |         2 
                  273 |         0          7 |         7 
                  279 |         0          1 |         1 
                  286 |         0          1 |         1 
                  288 |         0          1 |         1 
                  299 |         0          1 |         1 
                  300 |         0         23 |        23 
                  303 |         0         23 |        23 
                  310 |         0          5 |         5 
                  312 |         0         18 |        18 
                  330 |         0          1 |         1 
                  333 |         0          2 |         2 
                  336 |         0          1 |         1 
                  338 |         0          1 |         1 
                  360 |         0         33 |        33 
                  364 |         0         49 |        49 
                  372 |         0          4 |         4 
                  375 |         0          3 |         3 
                  390 |         0          1 |         1 
                  394 |         0          1 |         1 
                  416 |         0          3 |         3 
                  420 |         0          1 |         1 
                  424 |         0          7 |         7 
                  425 |         0          1 |         1 
                  432 |         0          1 |         1 
                  433 |         0          3 |         3 
                  434 |         0          1 |         1 
                  450 |         0          4 |         4 
                  455 |         0          2 |         2 
                  465 |         0          1 |         1 
                  480 |         0          8 |         8 
                  485 |         0         22 |        22 
                  496 |         0          2 |         2 
                  504 |         0          1 |         1 
                  515 |         0          1 |         1 
                  520 |         0          6 |         6 
                  527 |         0          2 |         2 
                  540 |         0          3 |         3 
                  546 |         0          4 |         4 
                  558 |         0          2 |         2 
                  576 |         0          2 |         2 
                  600 |         0          3 |         3 
                  624 |         0          2 |         2 
                  660 |         0          1 |         1 
                  667 |         0          1 |         1 
                  690 |         0          1 |         1 
                  697 |         0          1 |         1 
                  713 |         0          1 |         1 
                  720 |         0         62 |        62 
                  727 |         0        301 |       301 
                  744 |         0         30 |        30 
Not codeable, <1 hour |         0      1,306 |     1,306 
----------------------+----------------------+----------
                Total |    26,500     11,597 |    38,097 


. tab op1rel

        R1 OTHR PRSN RELATIONSHIP TO SP |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                      2 SPOUSE/ PARTNER |      3,804        9.99        9.99
                             3 DAUGHTER |     10,386       27.26       37.25
                                  4 SON |     10,322       27.09       64.34
                      5 DAUGHTER-IN-LAW |        403        1.06       65.40
                           6 SON-IN-LAW |        331        0.87       66.27
                         7 STEPDAUGHTER |        974        2.56       68.82
                              8 STEPSON |        891        2.34       71.16
                               9 SISTER |      1,360        3.57       74.73
                             10 BROTHER |        571        1.50       76.23
                       11 SISTER-IN-LAW |        205        0.54       76.77
                      12 BROTHER-IN-LAW |         77        0.20       76.97
                              13 MOTHER |        115        0.30       77.27
                          14 STEPMOTHER |          5        0.01       77.29
                       15 MOTHER-IN-LAW |         35        0.09       77.38
                              16 FATHER |         14        0.04       77.42
                          17 STEPFATHER |          3        0.01       77.42
                       18 FATHER-IN-LAW |          7        0.02       77.44
                       19 GRANDDAUGHTER |      1,169        3.07       80.51
                            20 GRANDSON |        950        2.49       83.00
                               21 NIECE |        347        0.91       83.91
                              22 NEPHEW |        201        0.53       84.44
                                23 AUNT |         45        0.12       84.56
                               24 UNCLE |         14        0.04       84.60
                              25 COUSIN |        182        0.48       85.07
        26 STEPDAUGHTER'S SON/ DAUGHTER |         30        0.08       85.15
             27 STEPSON'S SON/ DAUGHTER |         12        0.03       85.19
     28 DAUGHTER-IN-LAW'S SON/ DAUGHTER |         55        0.14       85.33
          29 SON-IN-LAW'S SON/ DAUGHTER |         26        0.07       85.40
                      30 BOARDER/RENTER |         10        0.03       85.42
    31 PAID AIDE/ HOUSEKEEPER/ EMPLOYEE |        547        1.44       86.86
                            32 ROOMMATE |         25        0.07       86.93
                 33 EX-WIFE/ EX-HUSBAND |         54        0.14       87.07
               34 BOYFRIEND/ GIRLFRIEND |         51        0.13       87.20
                            35 NEIGHBOR |        189        0.50       87.70
                              36 FRIEND |      2,803        7.36       95.05
  37 STAFF PERSON AT THE PLACE SP LIVES |        367        0.96       96.02
                           38 CO-WORKER |         18        0.05       96.07
   39 MINISTER, PRIEST, OR OTHER CLERGY |        155        0.41       96.47
40 PSYCHIATRIST, PSYCHOLOGIST, COUNSELO |         41        0.11       96.58
                      91 OTHER RELATIVE |        451        1.18       97.76
                   92 OTHER NONRELATIVE |        852        2.24      100.00
----------------------------------------+-----------------------------------
                                  Total |     38,097      100.00

. tab op1ishel if op1rel==37

 R1 BXHL1 HELPS |
             SP |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |        365       99.46       99.46
          1 Yes |          2        0.54      100.00
----------------+-----------------------------------
          Total |        367      100.00

. tab op1ishel if op1rel==37 & op1insdh

 R1 BXHL1 HELPS |
             SP |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |        365       99.46       99.46
          1 Yes |          2        0.54      100.00
----------------+-----------------------------------
          Total |        367      100.00

. tab op1ishel if op1rel==37 & op1insdh==1

 R1 BXHL1 HELPS |
             SP |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |         66      100.00      100.00
----------------+-----------------------------------
          Total |         66      100.00

. tab op1gender if op1rel==37

R1 OTHER PERSON |
         GENDER |      Freq.     Percent        Cum.
----------------+-----------------------------------
-1 Inapplicable |        346       94.28       94.28
         1 MALE |          2        0.54       94.82
       2 FEMALE |         19        5.18      100.00
----------------+-----------------------------------
          Total |        367      100.00

. do "C:\Users\bollee01\AppData\Local\Temp\7\STD02000000.tmp"

. /*Collapse helper information to the SP - wave level
> and merge into SP dataset
> 
> variables created are:
> Total # helpers for the SP
> Total hours/month help provided for SP
> Indicators for relationship of primary helper (identified as helper 
> with the most hours)
> 
> Uses imputed hours per code 1a_help_hours_imputation.do
> (see NHATS Technical Paper #7 for imputation methodology)
> */
. 
. capture log close
